<?xml version="1.0" encoding="utf-8"?>
<glossary id="glossary-1">
  <title>Glossar</title>
  <glossentry id="glossary-16">
    <glossterm>Ansicht</glossterm>
    <glossdef>
      <para>Eine <application>Nautilus</application>-Komponente, die Ihnen
die M&ouml;glichkeit gibt, einen Ordner auf eine bestimmte Weise anzuzeigen. <application>Nautilus</application> verf&uuml;gt z.B. &uuml;ber eine Symbolansicht, mit
der Sie den Inhalt eines Ordners in Form von Symbolen anzeigen lassen k&ouml;nnen. <application>Nautilus</application> enth&auml;lt au&szlig;erdem eine Listenansicht, mit
der der Inhalt eines Ordners in Form einer Liste dargestellt wird. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-6">
    <glossterm>Applet</glossterm>
    <glossdef>
      <para>Ein Applet ist eine kleine interaktive Anwendung, die sich
in einem Panel befindet, z.B. der <application>CD-Player</application>. Jedes
Applet besitzt eine einfache Benutzeroberfl&auml;che, die Sie mit der Maus
oder der Tastatur bedienen k&ouml;nnen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-7">
    <glossterm>Arbeitsbereich</glossterm>
    <glossdef>
      <para>Eine Arbeitsfl&auml;che ist ein separater Bereich auf dem
Desktop, in dem Sie arbeiten k&ouml;nnen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-22">
    <glossterm>Bereich</glossterm>
    <glossdef>
      <para>Eine Partition einer Festplatte. Bereiche k&ouml;nnen auf
Zip- und Jaz-Medien erstellt werden. F&uuml;r jeden Bereich erscheint ein
Objekt auf dem Desktop-Hintergrund.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-17">
    <glossterm>Betrachter-Komponente</glossterm>
    <glossdef>
      <para>Eine <application>Nautilus</application>-Komponente, die Ihnen
die M&ouml;glichkeit gibt, im Ansichtsteilfenster einen bestimmten Dateityp
anzuzeigen. Die Betrachter-Komponente f&uuml;gt unter Umst&auml;nden zu den
Nautilus-Men&uuml;s Optionen hinzu, die sich auf den entsprechenden Dateityp
beziehen. Mit einer Betrachter-Komponente haben Sie eventuell auch die M&ouml;glichkeit,
die Gr&ouml;&szlig;e des Elements mit den Zoom-Schaltfl&auml;chen im Ansichtsteilfenster
von <application>Nautilus</application> zu &auml;ndern. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-9">
    <glossterm>Desktop-Hintergrundobjekt</glossterm>
    <glossdef>
      <para>Ein Symbol auf dem Desktop-Hintergrund, mit dem Sie Dateien,
Ordner und Anwendungen &ouml;ffnen k&ouml;nnen. &Uuml;ber Desktop-Hintergrundobjekte
haben Sie bequemen Zugriff auf Dateien, Ordner und Anwendungen, die Sie h&auml;ufig
verwenden.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-20">
    <glossterm>DNS-Name</glossterm>
    <glossdef>
      <para>Eine eindeutige alphabetische Kennung f&uuml;r einen Computer
in einem Netzwerk. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-24">
    <glossterm>Einh&auml;ngen</glossterm>
    <glossdef>
      <para>Durch <firstterm>Einh&auml;ngen</firstterm> wird ein Dateisystem
f&uuml;r den Zugriff vorbereitet. Wenn Sie ein Dateisystem einh&auml;ngen,
wird es als Unterverzeichnis an Ihr Dateisystem angeh&auml;ngt. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-8">
    <glossterm>Erweiterungsbereich</glossterm>
    <glossdef>
      <para>Ein Erweiterungsbereich ist eine gleitende Erweiterung eines
Panels, das Sie &uuml;ber ein Erweiterungsbereichsymbol &ouml;ffnen oder schlie&szlig;en
k&ouml;nnen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-23">
    <glossterm>Formatieren</glossterm>
    <glossdef>
      <para>Beim Formatieren von Medien werden die Medien zur Verwendung
mit einem bestimmten Dateisystem vorbereitet. Beim Formatieren von Medien
&uuml;berschreiben Sie alle darauf vorhandenen Daten. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-10">
    <glossterm>GNOME-konforme Anwendung</glossterm>
    <glossdef>
      <para>Eine Anwendung, die die standardm&auml;&szlig;igen GNOME-Programmierbibliotheken
verwendet, wird als GNOME-konforme Anwendung bezeichnet. <application>Nautilus</application> und <application>gedit</application> sind z.B. GNOME-konforme
Anwendungen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-18">
    <glossterm>Inode</glossterm>
    <glossdef>
      <para>Eine Datenstruktur, die Informationen &uuml;ber einzelne Dateien
in UNIX-Dateisystemen enth&auml;lt. Jede Datei hat einen Inode. Ein Inode
enth&auml;lt den Knoten, den Typ, den Eigent&uuml;mer und den Speicherort
einer Datei. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-21">
    <glossterm>IP-Adresse</glossterm>
    <glossdef>
      <para>Eine eindeutige Kennung f&uuml;r einen Computer in einem Netzwerk.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-26">
    <glossterm>Kurzbefehl </glossterm>
    <glossdef>
      <para>Kurzbefehle sind Tastenk&uuml;rzel, &uuml;ber die Anwendungen
gestartet werden k&ouml;nnen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-11">
    <glossterm>Men&uuml;leiste</glossterm>
    <glossdef>
      <para>Die Men&uuml;leiste befindet sich im oberen Bereich eines
Anwendungsfensters und enth&auml;lt die Men&uuml;s der Anwendung. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-27">
    <glossterm>MIME-Typ</glossterm>
    <glossdef>
      <para>Der MIME-Type (MIME: Multipurpose Internet Mail Extension
- Mehrzweck-Internet-Mailerweiterung) gibt den Typ einer gegebenen Datei an.
Anhand des MIME-Typs k&ouml;nnen Anwendungen das Format der Datei erkennen
und sie somit lesen. Beispielsweise kann eine E-Mail-Anwendung anhand des
MIME-Typs <literal>image/png</literal> erkennen, dass sich in der Anlage zur
E-Mail eine Datei im PNG-Format (Portable Networks Graphic) befindet.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-15">
    <glossterm>Stapelreihenfolge</glossterm>
    <glossdef>
      <para>Die Stapelreihenfolge ist die Reihenfolge, in der Fenster
auf dem Bildschirm &uuml;bereinander angeordnet werden. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-3">
    <glossterm>Startprogramm</glossterm>
    <glossdef>
      <para>Ein Startprogramm dient zum Starten einer bestimmten Anwendung,
zum Ausf&uuml;hren eines Befehls oder zum &Ouml;ffnen einer Datei. Ein Startprogramm
kann sich in einem Panel oder in einem Men&uuml; befinden.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-13">
    <glossterm>Statusleiste</glossterm>
    <glossdef>
      <para>Die Statusleiste unten in einem Fenster enth&auml;lt Informationen
&uuml;ber den aktuellen Status des Fensterinhalts. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-28">
    <glossterm>Symbolische Verkn&uuml;pfung</glossterm>
    <glossdef>
      <para>Eine symbolische Verkn&uuml;pfung ist eine besondere Dateiart,
die auf eine andere Datei oder einen anderen Ordner verweist. Aktionen an
einem symbolischen Link werden in Wirklichkeit an der Datei oder an dem Ordner
ausgef&uuml;hrt, auf die bzw. den der symbolische Link verweist. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-12">
    <glossterm>Symbolleiste</glossterm>
    <glossdef>
      <para>Die Symbolleiste enth&auml;lt Schaltfl&auml;chen f&uuml;r
die h&auml;ufigsten Befehle einer Anwendung. Die Symbolleiste wird in der
Regel unterhalb der Men&uuml;leiste angezeigt. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-25">
    <glossterm>Tastenk&uuml;rzel</glossterm>
    <glossdef>
      <para>Ein <firstterm>Tastenk&uuml;rzel</firstterm> ist eine Taste
oder eine Tastenkombination, die eine Alternative zur Standardvorgehensweise
f&uuml;r eine Aktion bietet. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-5">
    <glossterm>Tastenkombinationen</glossterm>
    <glossdef>
      <para>Tastenkombinationen sind Tastenfolgen, mit denen Sie einen
Vorgang schnell ausf&uuml;hren k&ouml;nnen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-4">
    <glossterm>Teilfenster</glossterm>
    <glossdef>
      <para>Ein Teilfenster ist ein Teilbereich eines Fensters. Das Fenster <application>Nautilus</application> enth&auml;lt z.B. ein Seiten-Teilfenster und ein Ansichtsteilfenster. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-19">
    <glossterm>Uniform Resource Locator</glossterm>
    <glossdef>
      <para>Ein Uniform Resource Locator (URL) ist die Adresse eines bestimmten
Standorts im Internet.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-2">
    <glossterm>Voreinstellungstool</glossterm>
    <glossdef>
      <para>Ein spezielles Softwaretool, das einen bestimmten Aspekt des
Desktopverhaltens steuert.</para>
    </glossdef>
  </glossentry>
</glossary>
