<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustaccess-1">
  <title>Verwenden der Eingabehilfe-Einstellungstools</title>
  <highlights>
    <para>In diesem Kapitel wird beschrieben, wie Sie den Desktop mit den Tools der <guilabel>Eingabehilfe</guilabel> anpassen 
k&ouml;nnen.</para>
  </highlights>
  <sect1 id="goscustaccess-2">
    <title>&Ouml;ffnen eines Eingabehilfe-Tools</title>
    <para>Sie haben folgende M&ouml;glichkeiten, ein <guilabel>Eingabehilfe</guilabel>-Einstellungstool zu &ouml;ffnen: </para>
    <itemizedlist>
      <listitem>
        <para>Im Men&uuml; <guisubmenu>Einstellungen</guisubmenu> f&uuml;r den Desktop </para>
        <para>W&auml;hlen Sie <menuchoice><guimenu>Anwendungen</guimenu><guisubmenu>Desktop-Einstellungen</guisubmenu><guisubmenu>Eingabehilfe</guisubmenu></menuchoice>. W&auml;hlen Sie im Untermen&uuml; das gew&uuml;nschte Einstellungstool. Das Dialogfeld f&uuml;r das Tool wird 
angezeigt.</para>
      </listitem>
      <listitem>
        <para>&Uuml;ber das <guilabel>Hier starten</guilabel>-Verzeichnis</para>
        <para>&Ouml;ffnen Sie ein <application>Nautilus</application>-Fenster, und w&auml;hlen Sie <menuchoice><guimenu>Wechseln zu</guimenu><guimenuitem>Hier starten</guimenuitem></menuchoice>. Sie k&ouml;nnen auch auf dem 
Desktop-Hintergrund auf das Objekt <guilabel>Hier starten</guilabel> doppelklicken. Das <guilabel>Hier starten</guilabel>-Verzeichnis 
wird angezeigt. Doppelklicken Sie im Fenster <application>Nautilus</application> auf das Objekt 
<guilabel>Desktop-Einstellungen</guilabel> und danach auf den Ordner <guilabel>Eingabehilfe</guilabel>. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustaccess-6">
    <title>Konfigurieren von Optionen f&uuml;r den Tastaturzugriff</title>
    <indexterm>
      <primary>AccessX</primary>
      <see>Einstellungstools, Tastaturzugriff </see>
    </indexterm>
    <indexterm>
      <primary>Tastatur</primary>
      <secondary>Konfigurieren von 
Eingabehilfe-Optionen</secondary>
    </indexterm>
    <indexterm>
      <primary>Eingabehilfe</primary>
      <secondary>Konfigurieren der 
Tastatur</secondary>
    </indexterm>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Tastaturzugriff</secondary>
    </indexterm>
    <para>Legen Sie mit dem Einstellungstool <application>Tastatur</application> Einstellungen f&uuml;r den Tastaturzugriff fest. 
Das Eingabehilfen-Einstellungstool <application> Tastatur</application> ist auch unter dem Namen  <application> AccessX</application> 
bekannt. </para>
    <para><xref linkend="goscustaccess-TBL-1"/> listet die Einstellungen f&uuml;r den Tastaturzugriff auf, die Sie &auml;ndern 
k&ouml;nnen.</para>
    <table frame="topbot" id="goscustaccess-TBL-1">
      <title>Einstellungen f&uuml;r den Tastaturzugriff</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="25.64*"/>
        <colspec colname="colspec1" colwidth="74.36*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option </para>
            </entry>
            <entry valign="top">
              <para>Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Tastaturzugriff aktivieren</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> W&auml;hlen Sie diese Option, um Funktionen f&uuml;r den Tastaturzugriff zu aktivieren. Sobald Sie diese Option 
gew&auml;hlt haben, werden auch die anderen Optionen im Einstellungstool verf&uuml;gbar.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Signalton beim Aktivieren/Deaktivieren der 
Eingabehilfefunktionen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> W&auml;hlen Sie diese Option, falls ein 
akustisches Signal ert&ouml;nen soll, wenn eine Funktion wie die Einrastfunktion oder die Anschlagverz&ouml;gerung aktiviert bzw. 
deaktiviert wird.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Deaktivieren bei Nichtverwendung</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>W&auml;hlen Sie diese Option, um die Eingabehilfen-Einstellungen f&uuml;r die Tastatur zu 
deaktivieren, wenn die Tastatur eine bestimmte Zeit nicht genutzt wird. Legen Sie mit dem Schieber fest, nach wie vielen Sekunden 
Tastatur-Inaktivit&auml;t das System die Eingabehilfen-Einstellungen f&uuml;r die Tastatur deaktivieren soll. Nach Verstreichen dieser 
Zeit werden folgende Eingabehilfen-Einstellungen der Tastatur deaktiviert:</para>
              <itemizedlist>
                <listitem>
                  <para>Tastenprellung</para>
                </listitem>
                <listitem>
                  <para>Maustasten</para>
                </listitem>
                <listitem>
                  <para>Tastenverz&ouml;gerung</para>
                </listitem>
                <listitem>
                  <para>Einrastfunktion</para>
                </listitem>
                <listitem>
                  <para>Tasten umschalten</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Maustasten 
aktivieren</guilabel>
              </para>
              <indexterm>
                <primary>Zugriff</primary>
                <secondary>Maustasten </secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>W&auml;hlen Sie diese Option, damit Sie mit der Zifferntastatur Mausaktionen emulieren k&ouml;nnen. 
Sie k&ouml;nnen die folgenden Einstellungen f&uuml;r Maustasten festlegen: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Maximale Zeigergeschwindigkeit</guilabel>: Legen Sie mit dieser Einstellung die maximale Geschwindigkeit fest, 
mit der sich der Mauszeiger &uuml;ber den Bildschirm bewegt. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Zeit bis zur Beschleunigung auf maximale Geschwindigkeit</guilabel>: Geben Sie mit dieser Einstellung die 
L&auml;nge der Beschleunigungszeit f&uuml;r den Mauszeiger an. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Bewegung in folgendem Abstand nach der Tastatureingabe ausf&uuml;hren</guilabel>: Geben Sie mit dieser 
Einstellung an, wie viel Zeit nach einem Tastendruck vergehen muss, bis sich der Mauszeiger bewegt. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Tastenverz&ouml;gerung aktivieren</guilabel>
              </para>
              <indexterm>
                <primary>Zugriff</primary>
                <secondary>Langsame Tasten</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Legen 
Sie mit dieser Option fest, wie lange eine Taste gedr&uuml;ckt gehalten werden muss, damit der Tastendruck akzeptiert wird. Sie 
k&ouml;nnen die folgenden Einstellungen f&uuml;r langsame Tasten festlegen: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Tastatureingaben nur akzeptieren nach</guilabel>: Legen Sie mit dieser Einstellung fest, wie lange eine Taste 
gedr&uuml;ckt gehalten werden muss, damit der Tastendruck akzeptiert wird. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Signalton, wenn Taste gedr&uuml;ckt wird</guilabel>: W&auml;hlen Sie diese Option, damit beim Dr&uuml;cken 
einer Taste ein akustisches Signal ert&ouml;nt. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Signalton, wenn Taste akzeptiert wird</guilabel>: W&auml;hlen Sie diese Option, damit beim Akzeptieren der 
Taste ein akustisches Signal ert&ouml;nt. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Singalton, wenn Taste abgelehnt wird</guilabel>: W&auml;hlen Sie diese Option, damit beim Zur&uuml;ckweisen der 
Taste ein akustisches Signal ert&ouml;nt. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Tastenprellung aktivieren</guilabel>
              </para>
              <indexterm>
                <primary>Zugriff</primary>
                <secondary>Anschlagcharakteristik der Tasten</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>W&auml;hlen Sie diese Option, um eine Tastatureingabe zu akzeptieren und die Wiederholeigenschaften der Tastatur zu 
steuern. Sie k&ouml;nnen die folgenden Einstellungen f&uuml;r die Anschlagcharakteristik der Tastatur festlegen: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Tastenanschl&auml;ge ignorieren innerhalb von</guilabel>: Legen Sie mit dieser Einstellung das Intervall nach 
dem ersten Tastendruck fest, bevor eine gedr&uuml;ckte Taste automatisch wiederholt wird. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Signalton, wenn Taste abgelehnt wird</guilabel>: W&auml;hlen Sie diese Option, damit beim Zur&uuml;ckweisen der 
Taste ein akustisches Signal ert&ouml;nt. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Einrastfunktion aktivieren</guilabel>
              </para>
              <indexterm>
                <primary>Zugriff</primary>
                <secondary>Einrastfunktion</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>W&auml;hlen Sie diese Option, wenn Tastenkombinationen durch Tastenfolgen, also das Dr&uuml;cken mehrerer Tasten 
hintereinander, ersetzt werden sollen. Sie k&ouml;nnen f&uuml;r die Einrastfunktion folgende Einstellungen festlegen: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Signalton, wenn Zusatztaste gedr&uuml;ckt wird</guilabel>: W&auml;hlen Sie diese Option, damit beim 
Dr&uuml;cken einer Zusatztaste ein akustisches Signal ert&ouml;nt. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Einrastfunktion deaktivieren, wenn zwei Tasten gleichzeitig gedr&uuml;ckt werden</guilabel>: Geben Sie mit 
dieser Option an, dass zum gleichzeitigen Dr&uuml;cken von zwei Tasten nicht mehr zwei Tasten nacheinander gedr&uuml;ckt werden 
k&ouml;nnen.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Statusanzeige und Wiederholgeschwindigkeit</guilabel>
              </para>
              <indexterm>
                <primary>Zugriff</primary>
                <secondary>Umschalttasten</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>W&auml;hlen Sie diese Option, damit beim Dr&uuml;cken einer Umschalttaste ein akustisches Signal ert&ouml;nt. Beim 
Aktivieren einer Umschalttaste ert&ouml;nt ein akustisches Signal. Beim Deaktivieren einer Umschalttaste ert&ouml;nen zwei akustische 
Signale. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Testbereich</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Der Testbereich ist eine interaktive Oberfl&auml;che, in der Sie sehen k&ouml;nnen, wie sich 
die Tastatureinstellungen bei der Eingabe auf die Anzeige auswirken. Geben Sie in den Testbereich Text ein, um die Wirkung der 
Einstellungen zu testen.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guibutton>CDE-AccessX-Datei importieren</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Klicken Sie auf diese Schaltfl&auml;che, um eine CDE AccessX-Konfigurationsdatei zu importieren. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>N&auml;here Informationen zur Konfiguration der Eingabehilfen-Einstellungen f&uuml;r die Tastatur finden Sie 
im <citetitle> GNOME 2.0 Desktop for the Solaris Operating Environment Accessibility Guide </citetitle>.</para>
  </sect1>
</chapter>
