<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustdesk-6">
  <title>Verwenden der grundlegenden Einstellungstools</title>
  <highlights>
    <para>Die grundlegenden Einstellungstools erm&ouml;glichen Ihnen das Anpassen des Desktop-Hintergrunds. Mit ihnen k&ouml;nnen Sie die Tastatur- und Mauseinstellungen konfigurieren, Tastenkombinationen programmieren, Sound-Einstellungen festlegen und den Netzwerk-Proxy konfigurieren. Des Weiteren k&ouml;nnen Sie mit diesen Tools ein Thema und Schriftarten f&uuml;r den Desktop ausw&auml;hlen sowie die Men&uuml;- und Symbolleisten der Anwendungen und die Methode zur Auswahl des aktiven Fensters anpassen.</para>
    <para>In diesem Kapitel wird beschrieben, wie Sie den Desktop mit den grundlegenden Einstellungstools anpassen.</para>
  </highlights>
  <sect1 id="goscustdesk-37">
    <title>&Ouml;ffnen eines grundlegenden Einstellungstools</title>
    <para>Sie haben zwei M&ouml;glichkeiten, eines der grundlegenden Einstellungstools zu &ouml;ffnen:</para>
    <itemizedlist>
      <listitem>
        <para>&Uuml;ber das Men&uuml; <guimenu>Desktop-Einstellungen</guimenu></para>
        <para>W&auml;hlen Sie <menuchoice><guimenu>Anwendungen</guimenu><guimenuitem>Desktop-Einstellungen</guimenuitem></menuchoice>. W&auml;hlen Sie im Untermen&uuml; das gew&uuml;nschte Einstellungstool. Das Dialogfeld f&uuml;r das Tool wird angezeigt.</para>
      </listitem>
      <listitem>
        <para>&Uuml;ber das <guilabel>Hier starten</guilabel>-Verzeichnis</para>
        <para>&Ouml;ffnen Sie ein <application>Nautilus</application>-Fenster, und w&auml;hlen Sie <menuchoice><guimenu>Wechseln zu</guimenu><guimenuitem>Hier starten</guimenuitem></menuchoice>. Sie k&ouml;nnen auch auf dem Desktop-Hintergrund auf das Objekt <guilabel>Hier starten</guilabel> doppelklicken. Das <guilabel>Hier starten</guilabel>-Verzeichnis wird angezeigt. Doppelklicken Sie im <application>Nautilus</application>-Fenster auf das Objekt <guilabel>Desktop-Einstellungen</guilabel>, um die Einstellungstools anzuzeigen. </para>
        <para>Doppelklicken Sie auf das gew&uuml;nschte Tool. Das Dialogfeld f&uuml;r das Tool wird angezeigt.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustdesk-7">
    <title>Anpassen des Desktop-Hintergrunds</title>
    <indexterm>
      <primary>Desktop-Hintergrund</primary>
      <secondary>Anpassen</secondary>
    </indexterm>
    <indexterm>
      <primary>Desktop-Einstellungstools</primary>
      <see>Einstellungstools</see>
    </indexterm>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary> Hintergrund</secondary>
    </indexterm>
    <indexterm>
      <primary>Hintergr&uuml;nde</primary>
      <secondary>Anpassen des Desktop-Hintergrunds</secondary>
    </indexterm>
    <para>Der Desktop-Hintergrund ist der Teil des Desktops, in dem sich keine grafischen Oberfl&auml;chenelemente wie Panels und Fenster befinden. Er liegt immer unter den anderen Oberfl&auml;chenelementen.</para>
    <para>Sie haben folgende M&ouml;glichkeiten, den Desktop-Hintergrund anzupassen:</para>
    <itemizedlist>
      <listitem>
        <para>W&auml;hlen Sie ein Bild aus, das auf dem Desktop-Hintergrund angezeigt werden soll. Das Bild wird &uuml;ber die Desktop-Hintergrundfarbe projiziert. Die Desktop-Hintergrundfarbe sehen Sie, wenn Sie ein transparentes Bild ausw&auml;hlen oder wenn das Bild nicht den gesamten Desktop-Hintergrund ausf&uuml;llt.</para>
      </listitem>
      <listitem>
        <para>W&auml;hlen Sie eine Farbe f&uuml;r den Desktop-Hintergrund aus. Sie k&ouml;nnen eine durchgehende Farbe ausw&auml;hlen oder einen &Uuml;bergangseffekt aus zwei Farben erzeugen. Ein &Uuml;bergangseffekt ist ein visueller Effekt, bei dem eine Farbe allm&auml;hlich in eine andere Farbe &uuml;bergeht. </para>
      </listitem>
    </itemizedlist>
    <para>Sie k&ouml;nnen das Aussehen des Desktop-Hintergrunds mit dem <application>Nautilus</application>-Datei-Manager &auml;ndern.</para>
    <para><xref linkend="goscustdesk-TBL-14"/> enth&auml;lt eine Liste der Hintergrundeinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
    <table frame="topbot" id="goscustdesk-TBL-14">
      <title>Einstellungen f&uuml;r den Desktop-Hintergrund</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Element</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Bild ausw&auml;hlen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>W&auml;hlen Sie ein Bild aus, das auf dem Desktop-Hintergrund angezeigt werden soll. Zum Ausw&auml;hlen eines Bildes klicken Sie auf die Schaltfl&auml;che <guibutton>Bild</guibutton>. Es erscheint ein Bildauswahl-Dialogfeld. W&auml;hlen Sie in diesem Dialogfeld ein Bild aus. Wenn Sie ein Bild ausgew&auml;hlt haben, klicken Sie auf <guibutton>OK</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Bildoptionen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Um festzulegen, wie das Bild angezeigt werden soll, w&auml;hlen Sie eine der folgenden Optionen aus:</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Hintergrundmuster</guilabel>:Wiederholt das Bild, bis der Desktop-Hintergrund v&ouml;llig ausgef&uuml;llt ist.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Zentriert</guilabel>:Zeigt das Bild in der Mitte des Desktop-Hintergrunds an.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Skaliert</guilabel>:Vergr&ouml;&szlig;ert das Bild bis in die Bildschirmecken unter Wahrung der relativen Bilddimensionen.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Gestreckt</guilabel>:Vergr&ouml;&szlig;ert das Bild so weit, dass der gesamte Desktop-Hintergrund ausgef&uuml;llt ist. Die relativen Bilddimensionen werden dabei angepasst.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Kein Bild</guilabel>:Zeigt kein Bild an.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Hintergrund-Stil</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Zum Festlegen eines Farbschemas verwenden Sie die Optionen im Dropdown-Listenfeld <guilabel>Hintergrund-Stil</guilabel> sowie die Farbauswahl-Schaltfl&auml;chen.</para>
              <para>Sie k&ouml;nnen eine der folgenden M&ouml;glichkeiten zum Festlegen eines Farbschemas nutzen:</para>
              <itemizedlist>
                <listitem>
                  <para>W&auml;hlen Sie <guilabel>Einfarbig</guilabel> im Dropdown-Listenfeld <guilabel>Hintergrund-Stil</guilabel>, um eine Farbe f&uuml;r den Desktop-Hintergrund festzulegen. </para>
                  <para>Zur Auswahl der gew&uuml;nschten Farbe klicken Sie auf die Schaltfl&auml;che <guibutton>Farbe</guibutton>. Es erscheint das Dialogfeld <guilabel>W&auml;hlen Sie eine Farbe aus</guilabel>. W&auml;hlen Sie eine Farbe, und klicken Sie auf <guibutton>OK</guibutton>.</para>
                </listitem>
                <listitem>
                  <para>W&auml;hlen Sie <guilabel>Horizontaler Verlauf</guilabel> im Dropdown-Listenfeld <guilabel>Hintergrund-Stil</guilabel>. Mit dieser Option erzeugen Sie einen &Uuml;bergangseffekt vom linken zum rechten Bildschirmrand.</para>
                  <para>Klicken Sie auf die Schaltfl&auml;che <guibutton>Farbe links</guibutton>, um das Dialogfeld <guilabel>W&auml;hlen Sie eine Farbe aus</guilabel> aufzurufen. W&auml;hlen Sie die Farbe aus, die am linken Rand erscheinen soll.</para>
                  <para>Klicken Sie auf die Schaltfl&auml;che <guibutton>Farbe rechts</guibutton>. W&auml;hlen Sie die Farbe aus, die am rechten Rand erscheinen soll.</para>
                </listitem>
                <listitem>
                  <para>W&auml;hlen Sie <guilabel>Vertikaler Verlauf</guilabel> im Dropdown-Listenfeld <guilabel>Hintergrund-Stil</guilabel>. Damit erzeugen Sie einen &Uuml;bergangseffekt vom oberen zum unteren Bildschirmrand.</para>
                  <para>Klicken Sie auf die Schaltfl&auml;che <guibutton>Farbe oben</guibutton>, um das Dialogfeld <guilabel>W&auml;hlen Sie eine Farbe aus</guilabel> aufzurufen. W&auml;hlen Sie die Farbe aus, die am oberen Rand erscheinen soll.</para>
                  <para>Klicken Sie auf die Schaltfl&auml;che <guibutton>Farbe unten</guibutton>. W&auml;hlen Sie die Farbe aus, die am unteren Rand erscheinen soll.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustdesk-38">
    <title>Ausw&auml;hlen von Standardschriften</title>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Font</secondary>
    </indexterm>
    <indexterm>
      <primary>Fonts</primary>
      <secondary>Desktop-Hintergrund </secondary>
    </indexterm>
    <indexterm>
      <primary>Schriften</primary>
      <secondary>Anwendungen </secondary>
    </indexterm>
    <para>W&auml;hlen Sie im Einstellungstool <application>Schriftart</application> die Schriftarten aus, die in den Anwendungen und auf dem Desktop-Hintergrund verwendet werden sollen.</para>
    <para><xref linkend="goscustdesk-TBL-26"/> enth&auml;lt eine Liste der Schrifteinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
    <table frame="topbot" id="goscustdesk-TBL-26">
      <title>Einstellungen f&uuml;r Schriften</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec18" colwidth="19.21*"/>
        <colspec colname="colspec19" colwidth="46.79*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Option </para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Anwendungs-Schriftart</guilabel>
              </para>
            </entry>
            <entry colsep="0" rowsep="0" valign="top">
              <para>Klicken Sie auf die Schriftauswahl-Schaltfl&auml;che, um eine in den Anwendungen zu verwendende Schrift auszuw&auml;hlen. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Desktop-Schriftart</guilabel>
              </para>
            </entry>
            <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
              <para>Klicken Sie auf die Schriftauswahl-Schaltfl&auml;che, um eine Schrift auszuw&auml;hlen, die auf dem Desktop-Hintergrund verwendet werden soll. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustperiph-2">
    <title>Konfigurieren von Tastatureinstellungen</title>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Tastatur</secondary>
    </indexterm>
    <indexterm>
      <primary>Tastatur</primary>
      <secondary>Konfigurieren allgemeiner Einstellungen</secondary>
    </indexterm>
    <para>Verwenden Sie das Einstellungstool <application>Tastatur</application>, um die automatischen Wiederholungseinstellungen f&uuml;r die Tastatur auszuw&auml;hlen und die mit der Tastatur verkn&uuml;pften Sound-Ereignisse zu konfigurieren. </para>
    <para>Sie k&ouml;nnen die Einstellungen f&uuml;r das Einstellungstool <application>Tastatur</application> in den folgenden funktionellen Bereichen anpassen:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Tastatur</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Sound</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustdesk-40">
      <title>Tastatureinstellungen</title>
      <para>Verwenden Sie den Registerabschnitt <guilabel>Tastatur</guilabel>, um allgemeine Tastatureinstellungen festzulegen. Um das Einstellungstool <application/><emphasis/><application>AccessX</application> f&uuml;r den Tastaturzugriff zu starten, klicken Sie auf die Schaltfl&auml;che <guibutton>Eingabehilfen</guibutton>.</para>
      <para><xref linkend="goscustperiph-TBL-3"/> enth&auml;lt eine Liste der Tastatureinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
      <table frame="topbot" id="goscustperiph-TBL-3">
        <title>Einstellungen f&uuml;r die Tastatur</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option </para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Die Tastatur wiederholt die Eingabe, wenn die Taste gedr&uuml;ckt gehalten wird</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie die Option, um die Tastaturwiederholung zu aktivieren. Wenn die Tastaturwiederholung aktiviert ist und Sie eine Taste gedr&uuml;ckt halten, wird die mit der Taste verkn&uuml;pfte Aktion mehrfach ausgef&uuml;hrt. Halten Sie beispielsweise eine Buchstabentaste gedr&uuml;ckt, wird der Buchstabe mehrfach eingegeben.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Verz&ouml;gerung</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie den Wert f&uuml;r die Verz&ouml;gerung vom Dr&uuml;cken einer Taste bis zum Wiederholen der Aktion.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Geschwindigkeit</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie die Geschwindigkeit aus, mit der die Aktion wiederholt wird. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Blinkt in Text- und anderen Feldern</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie die Option aus, um den Cursor in Feldern und Textfeldern blinken zu lassen.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Geschwindigkeit</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Verwenden Sie den Schieberegler, um die Geschwindigkeit einzustellen, mit der der Cursor in Feldern und Textfeldern blinken soll.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-41">
      <title>Sound-Einstellungen</title>
      <indexterm>
        <primary>Tastatur</primary>
        <secondary>Konfigurieren von Sound-Einstellungen</secondary>
      </indexterm>
      <indexterm>
        <primary>Sound</primary>
        <secondary>Konfigurieren von Tastatureinstellungen</secondary>
      </indexterm>
      <para>Verwenden Sie den Registerabschnitt <guilabel>Sound</guilabel>, um Einstellungen f&uuml;r Tastatur-Kl&auml;nge festzulegen. </para>
      <para>Einige Anwendungen geben einen Klingel-Sound bei Tastatureingabefehlern aus. Mit den Optionen im Registerabschnitt <guilabel>Sound</guilabel> k&ouml;nnen Sie den Klingel-Sound konfigurieren. <xref linkend="goscustdesk-TBL-1"/> enth&auml;lt eine Liste der Tastatur-Sound-Einstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
      <table frame="topbot" id="goscustdesk-TBL-1">
        <title>Einstellungen f&uuml;r Tastatur-Sounds</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option </para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0">
                <para>
                  <guilabel>Aus </guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0">
                <para>W&auml;hlen Sie diese Option aus, um den Klingel-Sound zu deaktivieren.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Signalton</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie diese Option aus, um den Klingel-Sound zu aktivieren.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-39">
    <title>Anpassen von Tastenk&uuml;rzeln</title>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Tastenk&uuml;rzel</secondary>
    </indexterm>
    <indexterm>
      <primary>Tastenkombinationen</primary>
      <secondary> Konfigurieren</secondary>
    </indexterm>
    <indexterm>
      <primary>Tastenk&uuml;rzel </primary>
      <secondary>Konfigurieren</secondary>
    </indexterm>
    <indexterm>
      <primary> Kurzbefehle</primary>
      <secondary>Konfigurieren</secondary>
    </indexterm>
    <para>Ein <firstterm>Tastenk&uuml;rzel</firstterm> ist eine Taste oder eine Tastenkombination, die eine Alternative zur Standardvorgehensweise f&uuml;r eine Aktion bietet. </para>
    <para>Verwenden Sie das Einstellungstool <application>Tastaturkurzbefehle</application>, um die Standardtastenk&uuml;rzel anzuzeigen. Sie k&ouml;nnen die Standardtastenk&uuml;rzel an Ihre Anforderungen anpassen. </para>
    <para>Au&szlig;erdem k&ouml;nnen Sie <firstterm>Kurzbefehle</firstterm> erstellen. Kurzbefehle sind Tastenk&uuml;rzel, &uuml;ber die Anwendungen gestartet werden k&ouml;nnen. </para>
    <para><xref linkend="goscustdesk-TBL-3"/> enth&auml;lt eine Liste mit den Tastenk&uuml;rzeleinstellungen, die von Ihnen angepasst werden k&ouml;nnen.</para>
    <table frame="topbot" id="goscustdesk-TBL-3">
      <title>Standardeinstellungen f&uuml;r Tastenk&uuml;rzel</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="36.11*"/>
        <colspec colname="colspec1" colwidth="63.89*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option </para>
            </entry>
            <entry valign="top">
              <para>Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Tastenkombinationen zur Textbearbeitung</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>W&auml;hlen Sie eine der folgenden Einstellungen:</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Standard</guilabel>:Verwenden Sie diese Einstellung f&uuml;r Standardtastenkombinationen.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Emacs</guilabel>:Verwenden Sie diese Einstellung f&uuml;r <application>Emacs</application>-Tastenkombinationen.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Desktop-Tastenkombinationen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Diese Tabelle enth&auml;lt eine Liste der Aktionen und der mit jeder Aktion verbundenen Tastenkombination. </para>
              <para>Um die Tastenkombinationen f&uuml;r eine Aktion zu &auml;ndern, markieren Sie die gew&uuml;nsche Aktion mit einem Mausklick und klicken dann ihre Tastenkombination an. Dr&uuml;cken Sie die Tasten, die Sie mit der Aktion verkn&uuml;pfen m&ouml;chten.</para>
              <para>Um die Tastenkombinationen f&uuml;r eine Aktion zu entfernen, doppelklicken Sie auf die gew&uuml;nsche Aktion und klicken dann auf ihre Tastenkombination. Dr&uuml;cken Sie die <keycap>R&uuml;cktaste</keycap>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Benutzerdefinierte Tastenkombinationen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1">
              <para>Zum Hinzuf&uuml;gen eines Kurzbefehls f&uuml;hren Sie die folgenden Schritte aus:</para>
              <orderedlist>
                <listitem>
                  <para>Klicken Sie auf <guibutton>Neu</guibutton>. Das Dialogfeld <guilabel>Benutzerdefinierte Belegung</guilabel> wird angezeigt. Geben Sie den mit dem Kurzbefehl zu verkn&uuml;pfenden Befehl in das Feld <guilabel>Neuer Befehl</guilabel> ein. Alternativ k&ouml;nnen Sie nach dem Befehl suchen, indem Sie auf die Schaltfl&auml;che <guibutton>Durchsuchen</guibutton> klicken. Wenn Sie den Befehl ausgew&auml;hlt haben, klicken Sie auf <guibutton>OK</guibutton>. Der Befehl wird zum Abschnitt <guilabel>Benutzerdefinierte Tastenkombinationen</guilabel> der Tabelle <guilabel>Desktop-Tastenkombinationen</guilabel> hinzugef&uuml;gt.</para>
                </listitem>
                <listitem>
                  <para>Klicken Sie im Abschnitt <guilabel>Benutzerdefinierte Belegung</guilabel> der Tabelle <guilabel>Desktop-Tastenkombinationen</guilabel> in die Spalte &quot;Tastenkombination&quot;. Dr&uuml;cken Sie die Taste oder Tastenkombination, die mit dem Befehl verkn&uuml;pft werden soll. </para>
                </listitem>
              </orderedlist>
              <para>Um einen Kurzbefehl zu bearbeiten, w&auml;hlen Sie den Kurzbefehl im Abschnitt <guilabel>Benutzerdefinierte Tastenkombinationen</guilabel> der Tabelle <guilabel>Desktop-Tastenkombinationen</guilabel> aus und klicken anschlie&szlig;end auf <guibutton>Bearbeiten</guibutton>. Bearbeiten Sie den Befehl im Dialogfeld <guilabel>Benutzerdefinierte Belegung</guilabel>.</para>
              <para>Um einen Kurzbefehl zu l&ouml;schen, w&auml;hlen Sie den Kurzbefehl im Abschnitt <guilabel>Benutzerdefinierte Tastenkombinationen</guilabel> der Tabelle <guilabel>Desktop-Tastenkombinationen</guilabel> aus und klicken anschlie&szlig;end auf <guibutton>Entfernen</guibutton>. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustuserinter-2">
    <title>Anpassen der Men&uuml;s und Symbolleisten in Anwendungen</title>
    <indexterm>
      <primary>Symbolleisten, Anpassen des Aussehens</primary>
    </indexterm>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Men&uuml;s &amp; Symbolleisten </secondary>
    </indexterm>
    <indexterm>
      <primary>Men&uuml;s</primary>
      <secondary>In Anwendungen, Anpassen des Aussehens</secondary>
    </indexterm>
    <para>Mit dem Einstellungstool <application>Men&uuml;s &amp; Symbolleisten</application> k&ouml;nnen Sie das Aussehen von Men&uuml;s, Men&uuml;leisten und Symbolleisten f&uuml;r GNOME-konforme Anwendungen anpassen.</para>
    <para><xref linkend="goscustuserinter-TBL-8"/> enth&auml;lt eine Liste der Men&uuml;- und Symbolleisteneinstellungen f&uuml;r GNOME-konforme Anwendungen, die von Ihnen angepasst werden k&ouml;nnen. </para>
    <table frame="topbot" id="goscustuserinter-TBL-8">
      <title>Einstellungen f&uuml;r das Anpassen von Anwendungen</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Option </para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Schaltfl&auml;chenbezeichnungen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>W&auml;hlen Sie eine der folgenden Optionen, um den Inhalt der Symbolleisten in GNOME-konformen Anwendungen festzulegen:</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Text unter Symbolen</guilabel>:W&auml;hlen Sie diese Option aus, um Symbolleisten mit Text sowie einem Symbol auf jeder Schaltfl&auml;che anzuzeigen. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Text neben Symbolen</guilabel>:W&auml;hlen Sie diese Option aus, um Symbolleisten nur mit einem Symbol auf den Schaltfl&auml;chen und mit Text auf den wichtigsten Schaltfl&auml;chen anzuzeigen.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Nur Symbole</guilabel>:W&auml;hlen Sie diese Option aus, um Symbolleisten nur mit einem Symbol auf jeder Schaltfl&auml;che anzuzeigen. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Nur Text</guilabel>:W&auml;hlen Sie diese Option aus, um Symbolleisten nur mit Text auf jeder Schaltfl&auml;che anzuzeigen. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Symbolleisten k&ouml;nnen losgel&ouml;st und verschoben werden</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>W&auml;hlen Sie diese Option aus, wenn Sie Symbolleisten aus Anwendungsfenstern an andere Positionen auf dem Desktop verschieben m&ouml;chten. Wenn Sie diese Option ausw&auml;hlen, werden die Symbolleisten in den Anwendungen mit Anfasspunkten auf der linken Seite angezeigt. Zum Verschieben einer Symbolleiste greifen Sie den Anfasspunkt mit der Maus und ziehen die Symbolleiste dann an die neue Position.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Symbole in Men&uuml;s anzeigen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>W&auml;hlen Sie diese Option aus, um neben jeder Funktion in einem Men&uuml; ein Symbol anzuzeigen. Einige Men&uuml;punkte besitzen kein Symbol.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustperiph-5">
    <title>Konfigurieren von Mauseinstellungen</title>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Maus</secondary>
    </indexterm>
    <indexterm>
      <primary>Maus</primary>
      <secondary>Konfigurieren</secondary>
    </indexterm>
    <para>Verwenden Sie das Einstellungstool <application>Maus</application>, um die Maus f&uuml;r den Gebrauch mit der rechten oder linken Hand zu konfigurieren. Auch die Geschwindigkeit und die Empfindlichkeit der Mausbewegung k&ouml;nnen Sie einstellen.</para>
    <para>Die Einstellungen f&uuml;r das Einstellungstool <application>Maus</application> k&ouml;nnen in den folgenden funktionellen Bereichen angepasst werden:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Tasten</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Cursor</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Bewegung</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustdesk-55">
      <title>Tasteneinstellungen</title>
      <para>Verwenden Sie den Registerabschnitt <guilabel>Tasten</guilabel>, um festzulegen, ob die Maustasten f&uuml;r die linke Hand konfiguriert werden sollen. Sie k&ouml;nnen auch den Verz&ouml;gerungswert f&uuml;r die Klicks beim Doppelklicken einstellen.</para>
      <para><xref linkend="goscustperiph-TBL-6"/> enth&auml;lt eine Liste der Maustasteneinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
      <table frame="topbot" id="goscustperiph-TBL-6">
        <title>Einstellungen f&uuml;r Maustasten</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option </para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Maus f&uuml;r Linksh&auml;nder</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie diese Option aus, um die Maus f&uuml;r den Gebrauch mit der linken Hand zu konfigurieren. In diesem Fall werden die Funktionen der linken und der rechten Maustaste getauscht.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Verz&ouml;gerung</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Verwenden Sie den Schieberegler, um die Zeitspanne festzulegen, die maximal zwischen den Klicks beim Doppelklicken liegen darf. Wenn das Intervall zwischen dem ersten und dem zweiten Klick l&auml;nger als der hier festgelegte Wert ist, wird die Aktion nicht als Doppelklick interpretiert. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-54">
      <title>Mauszeigereinstellungen</title>
      <para>Verwenden Sie den Registerabschnitt <guilabel>Cursor</guilabel>, um die Mauszeigereinstellungen festzulegen.</para>
      <para><xref linkend="goscustdesk-TBL-45"/> enth&auml;lt eine Liste der Mauszeigereinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen:</para>
      <table frame="topbot" id="goscustdesk-TBL-45">
        <title>Einstellungen f&uuml;r Mauszeiger</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="50*"/>
          <colspec colname="colspec1" colwidth="50*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Option </para>
              </entry>
              <entry valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Cursor-Thema</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>W&auml;hlen Sie das gew&uuml;nschte Mauszeigerthema im Listenfeld aus. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <guilabel>Position des Cursors anzeigen, wenn die Strg-Taste gedr&uuml;ckt wird</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>W&auml;hlen Sie diese Option aus, um eine Mauszeigeranimation zu aktivieren, wenn Sie die Taste <keycap>Strg</keycap> dr&uuml;cken und loslassen. Diese Funktion kann Ihnen das Auffinden des Mauszeigers erleichtern.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-53">
      <title>Bewegungseinstellungen</title>
      <para>Verwenden Sie den Registerabschnitt <guilabel>Bewegung</guilabel>, um die Einstellungen f&uuml;r Mausbewegungen festzulegen. </para>
      <para><xref linkend="goscustdesk-TBL-47"/> enth&auml;lt eine Liste der Mausbewegungseinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen:</para>
      <table frame="topbot" id="goscustdesk-TBL-47">
        <title>Einstellungen f&uuml;r Mausbewegungen</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="30.10*"/>
          <colspec colwidth="69.90*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Einstellung</para>
              </entry>
              <entry valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Beschleunigung</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Verwenden Sie den Schieberegler, um die Geschwindigkeit festzulegen, mit der sich der Mauszeiger beim Bewegen der Maus auf dem Bildschirm bewegt.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Empfindlichkeit</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Verwenden Sie den Schieberegler, um festzulegen, wie empfindlich der Mauszeiger auf Bewegungen der Maus reagieren soll.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Schwellenwert</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Verwenden Sie den Schieberegler, um die Strecke festzulegen, die ein Objekt verschoben werden muss, bevor die Verschiebungsaktion als Drag-and-Drop-Aktion interpretiert wird.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-50">
    <title>Konfigurieren der Netzwerk-Proxy-Einstellungen</title>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Netzwerk-Proxy</secondary>
    </indexterm>
    <indexterm>
      <primary>Netzwerk-Proxy</primary>
      <secondary>Festlegen von Einstellungen</secondary>
    </indexterm>
    <indexterm>
      <primary>Proxy</primary>
      <secondary>Festlegen von Einstellungen</secondary>
    </indexterm>
    <para>Mit dem Einstellungstool <application>Netzwerk-Proxy</application> k&ouml;nnen Sie die Netzwerkverbindungen des Systems konfigurieren. Sie haben die M&ouml;glichkeit, den Desktop mit einem <glossterm>Proxy-Server</glossterm> zu verbinden und die Details des Proxy-Servers anzugeben. Ein Proxy-Server ist ein Server, der Anforderungen an einen anderen Server abf&auml;ngt und selbst bearbeitet, sofern er dazu in der Lage ist. Sie k&ouml;nnen den Domain Name Service (DNS)-Namen oder die Internet Protocol (IP)-Adresse des Proxy-Servers eingeben. Ein <firstterm>DNS-Name</firstterm> ist eine eindeutige Kennung f&uuml;r einen Computer in einem Netzwerk. Eine <firstterm>IP-Adresse</firstterm> ist eine eindeutige numerische Kennung f&uuml;r einen Computer in einem Netzwerk. </para>
    <para><xref linkend="goscustdesk-TBL-52"/> enth&auml;lt eine Liste der Netzwerk-Proxy-Einstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
    <table frame="topbot" id="goscustdesk-TBL-52">
      <title>Netzwerk-Proxy-Einstellungen</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec2" colwidth="35.09*"/>
        <colspec colname="colspec3" colwidth="64.91*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option </para>
            </entry>
            <entry valign="top">
              <para>Funktion </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>HTTP-Proxy verwenden</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>W&auml;hlen Sie diese Option aus, um einen Proxy-Server f&uuml;r den HTTP-Dienst zu verwenden.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Adresse</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Geben Sie den DNS-Namen oder die IP-Adresse des Proxy-Servers ein, der beim Anfordern eines HTTP-Dienstes verwendet werden soll.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Port</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Geben Sie die Anschlussnummer des HTTP-Dienstes am Proxy-Server ein.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Proxy ben&ouml;tigt Benutzername und Passwort</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>W&auml;hlen Sie diese Option aus, wenn der Proxy-Server einen Benutzernamen und ein Passwort ben&ouml;tigt.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Benutzername und Kennwort auf der Festplatte speichern</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>Aktivieren Sie diese Option, wenn Sie m&ouml;chten, dass Ihr Benutzername und Kennwort gespeichert wird.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Benutzername</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>Geben Sie Ihren Benutzernamen f&uuml;r den Proxy-Server ein. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Kennwort</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Geben Sie Ihr Passwort f&uuml;r den Proxy-Server ein.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustmulti-2">
    <title>Festlegen von Sound-Einstellungen</title>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Sound</secondary>
    </indexterm>
    <indexterm>
      <primary>Sound</primary>
      <secondary>Festlegen von Einstellungen</secondary>
    </indexterm>
    <indexterm>
      <primary>Sound</primary>
      <secondary>Verkn&uuml;pfen von Ereignissen mit Sounds</secondary>
    </indexterm>
    <indexterm>
      <primary>Ereignisse, Verkn&uuml;pfen von Sounds mit</primary>
    </indexterm>
    <indexterm>
      <primary>Sound-Server</primary>
    </indexterm>
    <para>Mit dem Einstellungstool <application>Sound</application> k&ouml;nnen Sie steuern, wann der GNOME-Sound-Server gestartet wird. Au&szlig;erdem k&ouml;nnen Sie festlegen, welche Sounds bei welchem speziellen Ereignis ausgegeben werden.</para>
    <para>Die Einstellungen f&uuml;r das Einstellungstool <application>Sound</application> k&ouml;nnen in den folgenden funktionellen Bereichen angepasst werden:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Allgemein</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Klangereignisse</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustmulti-3">
      <title>Allgemeine Einstellungen</title>
      <para>Verwenden Sie den Registerabschnitt <guilabel>Allgemein</guilabel> des Einstellungstools <application>Sound</application>, um festzulegen, wann der GNOME-Sound-Server gestartet werden soll. Sie k&ouml;nnen auch Sound-Ereignisfunktionen aktivieren.</para>
      <para><xref linkend="goscustmulti-TBL-4"/> enth&auml;lt eine Liste der allgemeinen Sound-Einstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
      <table frame="topbot" id="goscustmulti-TBL-4">
        <title>Einstellungen f&uuml;r Sounds</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option </para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Starten des Soundservers aktivieren</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie diese Option aus, um den GNOME-Sound-Server beim Start einer GNOME-Sitzung zu starten. Wenn der Sound-Server aktiv ist, kann der Desktop Sounds ausgeben.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Kl&auml;nge f&uuml;r Ereignisse</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>W&auml;hlen Sie diese Option aus, um Sounds auszugeben, wenn bestimmte Ereignisse auf dem Desktop stattfinden. Diese Option kann nur ausgew&auml;hlt werden, wenn die Option <guilabel>Starten des Soundservers aktivieren</guilabel> aktiv ist.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-48">
      <title>Sound-Ereigniseinstellungen</title>
      <para>Verwenden Sie den Registerabschnitt <guilabel>Klangereignisse</guilabel> des Einstellungstools <application>Sound</application>, um bestimmte Kl&auml;nge mit bestimmten Ereignissen zu verkn&uuml;pfen. </para>
      <note>
        <para>Sie m&uuml;ssen die Optionen <guilabel>Starten des Soundservers aktivieren</guilabel> und <guilabel>Kl&auml;nge f&uuml;r Ereignisse</guilabel> ausw&auml;hlen, bevor Sie auf den Registerabschnitt <guilabel>Klangereignisse</guilabel> zugreifen k&ouml;nnen.</para>
      </note>
      <para><xref linkend="goscustmulti-TBL-6"/> enth&auml;lt eine Liste der Sound-Ereigniseinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
      <table frame="topbot" id="goscustmulti-TBL-6">
        <title>Einstellungen f&uuml;r Sound-Ereignisse</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option </para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>Tabelle <guilabel>Sounds</guilabel></para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Verwenden Sie die Tabelle <guilabel>Sounds</guilabel>, um bestimmte Kl&auml;nge mit bestimmten Ereignissen zu verkn&uuml;pfen. </para>
                <para>In der Spalte <guilabel>Ereignis</guilabel> wird eine hierarchische Liste m&ouml;glicher Ereignisse angezeigt. Um eine Kategorie von Ereignissen zu erweitern, klicken Sie auf den rechten Pfeil neben dieser Kategorie.</para>
                <para>Die Spalte <guilabel>Datei f&uuml;r die Wiedergabe</guilabel> nennt die Sound-Datei, die beim Eintreten des entsprechenden Ereignisses wiedergegeben wird.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guibutton>Wiedergabe</guibutton>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Klicken Sie auf die Schaltfl&auml;che, um die mit dem ausgew&auml;hlten Ereignis verkn&uuml;pfte Sound-Datei wiederzugeben. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>Dropdown-Kombinationsfeld f&uuml;r Audiodatei, Schaltfl&auml;che <guibutton>Durchsuchen</guibutton></para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Um einen Klang mit einem Ereignis zu verkn&uuml;pfen, w&auml;hlen Sie das Ereignis in der Tabelle <guilabel>Sounds</guilabel> aus. Geben Sie den Namen der Sound-Datei, die mit dem ausgew&auml;hlten Ereignis verkn&uuml;pft werden soll, in das Dropdown-Kombinationsfeld ein. Alternativ k&ouml;nnen Sie auf <guibutton>Durchsuchen</guibutton> klicken, um das Dialogfeld <guilabel>Audiodatei ausw&auml;hlen</guilabel> aufzurufen. Verwenden Sie dieses Dialogfeld, um die mit dem ausgew&auml;hlten Ereignis zu verkn&uuml;pfende Sound-Datei anzugeben. </para>
                <note>
                  <para>Es k&ouml;nnen nur Sound-Dateien im <filename>.wav</filename>-Format mit Ereignissen verkn&uuml;pft werden. </para>
                </note>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-12">
    <title>Einstellen von Themen im Desktop</title>
    <indexterm>
      <primary>Gtk+ Themen</primary>
      <see>Themen</see>
    </indexterm>
    <indexterm>
      <primary>Themen</primary>
      <secondary>Festlegen von Desktop-Themen</secondary>
    </indexterm>
    <indexterm>
      <primary>Themen</primary>
      <secondary>Festlegen von Fensterrahmen-Themen </secondary>
    </indexterm>
    <indexterm>
      <primary>Fenster</primary>
      <secondary>Festlegen von Rahmenthemen</secondary>
    </indexterm>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Thema</secondary>
    </indexterm>
    <para>W&auml;hlen Sie im Einstellungstool <application>Thema</application> ein Thema f&uuml;r den Desktop und die Fensterrahmen aus. Sie k&ouml;nnen die Einstellungen f&uuml;r das Einstellungstool <application>Theme</application> in den folgenden Funktionsbereichen anpassen:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Widget-Thema</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Fensterrahmen</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <para>Das Erscheinungsbild Ihres Desktops wird nicht nur vom Desktop- und vom Fensterrahmen-Thema definiert. So enth&auml;lt <application>Nautilus</application> zum Beispiel Themen, mit denen Sie das Erscheinungsbild der <application>Nautilus </application>-Fenster und des Desktop-Hintergrunds &auml;ndern k&ouml;nnen. </para>
    <sect2 id="goscustdesk-56">
      <title>Einstellungen f&uuml;r das Desktop-Thema</title>
      <para>W&auml;hlen Sie im Registerabschnitt <guilabel>Widget-Thema</guilabel> des Einstellungstools <application>Thema</application> ein Thema f&uuml;r den Desktop aus. Das Desktop-Thema bestimmt das visuelle Erscheinungsbild der Panels, Applets und Fenster sowie der Oberfl&auml;chenelemente in den GNOME-konformen Anwendungen. Das Thema beeinflusst beispielsweise das Aussehen von Schaltfl&auml;chen, Bildlaufleisten, Kontrollk&auml;stchen usw.</para>
      <para>Sie k&ouml;nnen eine Auswahl in der Liste der verf&uuml;gbaren Themen treffen oder neue Themen installieren. Die Liste der verf&uuml;gbaren Desktop-Themen enth&auml;lt zahlreiche Themen f&uuml;r Benutzer mit Zugriffsanforderungen.</para>
      <para><xref linkend="goscustlookandfeel-TBL-23"/> enth&auml;lt eine Liste der Desktop-Themeneinstellungen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
      <table frame="topbot" id="goscustlookandfeel-TBL-23">
        <title>Einstellungen f&uuml;r Desktop-Themen</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="40.81*"/>
          <colspec colwidth="59.19*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Option </para>
              </entry>
              <entry valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Verf&uuml;gbare Themen</para>
              </entry>
              <entry valign="top">
                <para>W&auml;hlen Sie das gew&uuml;nschte Thema im Listenfeld aus.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Neues Thema installieren</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Sie k&ouml;nnen der Liste der verf&uuml;gbaren Themen ein Thema hinzuf&uuml;gen. Beim neuen Thema muss es sich um einen unkomprimierten Ordner handeln. </para>
                <para>Um ein Thema zur Liste der verf&uuml;gbaren Themen hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che <guibutton>Neues Thema installieren</guibutton>. Es erscheint ein Dialogfeld. Geben Sie den Speicherort des Themenordners in das Dropdown-Kombinationsfeld ein. Alternativ k&ouml;nnen Sie nach der Datei suchen, indem Sie auf die Schaltfl&auml;che <guibutton>Durchsuchen</guibutton> klicken. Wenn Sie den Ordner ausgew&auml;hlt haben, klicken Sie auf <guibutton>OK</guibutton>.</para>
                <para>Sie k&ouml;nnen zahlreiche GTK-Themen im Internet finden.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Zu Themenordner wechseln</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Klicken Sie auf diese Schaltfl&auml;che, um ein Datei-Manager-Fenster f&uuml;r den Standardthemenordner zu &ouml;ffnen. Sie k&ouml;nnen Themen aus dem Datei-Manager-Fenster l&ouml;schen. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-57">
      <title>Fensterrahmen-Einstellungen</title>
      <para>W&auml;hlen Sie im Registerabschnitt <guilabel>Fensterrahmen</guilabel> des Einstellungstools <application>Thema</application> ein Thema f&uuml;r die Fensterrahmen aus. Sie k&ouml;nnen eine Auswahl in der Liste der verf&uuml;gbaren Themen treffen oder neue Themen installieren. Die Liste der verf&uuml;gbaren Fensterrahmen-Themen enth&auml;lt zahlreiche Themen f&uuml;r Benutzer mit Zugriffsanforderungen.</para>
      <para><xref linkend="goscustdesk-TBL-2"/> enth&auml;lt eine Liste der Fensterrahmen-Themen, die von Ihnen konfiguriert werden k&ouml;nnen.</para>
      <table frame="topbot" id="goscustdesk-TBL-2">
        <title>Einstellungen f&uuml;r Fensterrahmen-Themen</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="40.81*"/>
          <colspec colwidth="59.19*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Option </para>
              </entry>
              <entry valign="top">
                <para>Funktion</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Verf&uuml;gbare Themen</para>
              </entry>
              <entry valign="top">
                <para>W&auml;hlen Sie das gew&uuml;nschte Thema im Listenfeld aus.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Neues Thema installieren</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Sie k&ouml;nnen der Liste der verf&uuml;gbaren Themen ein Thema hinzuf&uuml;gen. Beim neuen Thema muss es sich um einen unkomprimierten Ordner handeln. </para>
                <para>Um ein Thema zur Liste der verf&uuml;gbaren Themen hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che <guibutton>Neues Thema installieren</guibutton>. Es erscheint ein Dialogfeld. Geben Sie den Speicherort des Themenordners in das Dropdown-Kombinationsfeld ein. Alternativ k&ouml;nnen Sie nach dem Ordner suchen, indem Sie auf die Schaltfl&auml;che <guibutton>Durchsuchen</guibutton> klicken. Wenn Sie den Ordner ausgew&auml;hlt haben, klicken Sie auf <guibutton>OK</guibutton>.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Zu Themenordner wechseln</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Klicken Sie auf diese Schaltfl&auml;che, um ein Datei-Manager-Fenster f&uuml;r den Standardthemenordner zu &ouml;ffnen. Sie k&ouml;nnen Themen aus dem Datei-Manager-Fenster l&ouml;schen. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustwindows-2">
    <title>Anpassen der Auswahlmethode f&uuml;r das aktive Fenster</title>
    <indexterm>
      <primary>Metacity-Fenster-Manager</primary>
      <see>Fenster-Manager</see>
    </indexterm>
    <indexterm>
      <primary>Fenster-Manager</primary>
      <secondary>Anpassen </secondary>
    </indexterm>
    <indexterm>
      <primary>Einstellungstools</primary>
      <secondary>Fenster-Fokus</secondary>
    </indexterm>
    <para>Verwenden Sie das Einstellungstool <application>Fenster-Fokus</application>, um die Methode f&uuml;r die Auswahl des aktiven Fensters auf dem Desktop anzupassen. </para>
    <para><xref linkend="goscustwindows-TBL-3"/> enth&auml;lt eine Liste der Einstellungen f&uuml;r die Auswahl des aktiven Fensters, die von Ihnen angepasst werden k&ouml;nnen.</para>
    <table frame="topbot" id="goscustwindows-TBL-3">
      <title>Einstellungen f&uuml;r die Auswahl des aktiven Fensters</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Option </para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Klicken Sie zum Fokussieren</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>W&auml;hlen Sie diese Option aus, um ein Fenster als aktives Fenster auszuw&auml;hlen, indem Sie darauf klicken. Das Fenster bleibt so lange aktiv, bis Sie auf ein anderes Fenster klicken.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0">
              <para>
                <guilabel>Zum Fokussieren zeigen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0">
              <para>W&auml;hlen Sie diese Option aus, um ein Fenster als aktives Fenster auszuw&auml;hlen, indem Sie mit der Maus darauf zeigen. Das Fenster bleibt so lange aktiv, bis Sie auf ein anderes Fenster zeigen. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0">
              <para>
                <guilabel>Fenster beim Fokussieren nach vorne stellen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0">
              <para>W&auml;hlen Sie diese Option aus, wenn das aktive Fenster immer hervorgehoben werden soll.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
</chapter>
