<?xml version="1.0" encoding="utf-8"?>
<part id="part1-1"><title>Eine Tour durch den GNOME-Desktop</title><partintro><para>In diesem Abschnitt werden die wichtigsten GNOME-Komponenten vorgestellt. Der Abschnitt enth&auml;lt au&szlig;erdem Informationen, die Ihnen helfen, die Arbeit mit dem Desktop aufzunehmen. Der Desktop bietet viele Konfigurationsm&ouml;glichkeiten. In diesem Abschnitt werden daher die Hauptm&ouml;glichkeiten f&uuml;r die Desktop-Funktionen behandelt. Wenn Sie wissen m&ouml;chten, wie die in diesem Abschnitt erw&auml;hnten verschiedenen Konfigurationsm&ouml;glichkeiten implementiert werden, lesen Sie den Abschnitt &quot;Anpassen des GNOME-Desktops&quot;. Dieser Abschnitt enth&auml;lt folgende Kapitel: </para><itemizedlist><listitem><para><emphasis>Grundlegende Arbeitstechniken</emphasis></para><para>In diesem Kapitel finden Sie Informationen &uuml;ber die Verwendung der Maus, &uuml;ber Tastenkombinationen und &uuml;ber grundlegende Arbeitstechniken im Umgang mit Fenstern sowie Dialogfeldern. </para></listitem><listitem><para><emphasis>&Uuml;berblick &uuml;ber den Desktop</emphasis></para><para>Dieses Kapitel enth&auml;lt eine Einf&uuml;hrung in die Hauptkomponenten und -funktionen des Desktops. Sie sollten in diesem Handbuch auf jeden Fall dieses Kapitel lesen.</para></listitem><listitem><para><emphasis>Desktop-Sitzungen</emphasis></para><para>Dieses Kapitel enth&auml;lt Informationen &uuml;ber das Starten, Verwalten und Beenden von Desktop-Sitzungen. </para></listitem><listitem><para><emphasis>Arbeiten mit Panels</emphasis></para><para>Dieses Kapitel enth&auml;lt Informationen zum  Verwenden von Panels. Panels sind eine zentrale Komponente des Desktops. In dem Kapitel erfahren Sie, wie die verschiedenen Elemente von Panels verwendet und wie die Funktionen des Desktops &uuml;ber Panels aufgerufen werden.</para></listitem><listitem><para><emphasis>Arbeiten mit Men&uuml;s</emphasis></para><para>Dieses Kapitel enth&auml;lt Informationen zum  Verwenden von Men&uuml;s. </para></listitem><listitem><para><emphasis>Arbeiten mit Fenstern</emphasis></para><para>Dieses Kapitel enth&auml;lt Informationen zum  Verwenden von Fenstern. Es beschreibt grundlegende Funktionen f&uuml;r Fenster, z.B. das Verschieben und &Auml;ndern der Gr&ouml;&szlig;e von Fenstern. Au&szlig;erdem werden die f&uuml;r Fenster verwendeten Steuerelemente beschrieben. </para></listitem><listitem><para><emphasis>Nautilus-Datei-Manager</emphasis></para><para>In diesem Kapitel wird der <application>Nautilus</application> Datei-Manager dargestellt. Es beschreibt, wie Sie <application>Nautilus</application> beim Arbeiten mit dem Dateisystem einsetzen. Au&szlig;erdem wird erl&auml;utert, wie Sie <application> Nautilus</application> anpassen k&ouml;nnen.</para></listitem><listitem><para><emphasis>Verwenden des Desktop-Hintergrunds</emphasis></para><para>Dieses Kapitel enth&auml;lt Informationen &uuml;ber die Verwendung des Desktop-Hintergrunds. Es wird erl&auml;utert, wie Sie mit dem Desktop-Hintergrund Anwendungen starten und Dateien sowie Ordner &ouml;ffnen. Das Kapitel informiert au&szlig;erdem dar&uuml;ber, wie Sie den <guilabel>Papierkorb</guilabel> im Desktop einsetzen, wie Sie mit dem Men&uuml; <guimenu>Desktop-Hintergrund</guimenu> arbeiten und wie sich der Desktop-Hintergrund anpassen l&auml;sst.</para></listitem></itemizedlist></partintro>&gosbasic;
&gosoverview;
&gosstartsession;
&gospanel;
&goseditmainmenu;
&gosmetacity;
&gosnautilus;
&gosdeskback;</part>
