<?xml version="1.0" encoding="utf-8"?>
<part id="part2-1"><title>Anpassen des GNOME-Desktops</title><partintro><para>Sie haben die M&ouml;glichkeit, zahlreiche Eigenschaften des Desktops anzupassen. Die Anpassung der verschiedenen Aspekte des Desktops erfolgt mit Hilfe eines speziellen Softwaretools, dem so genannten Desktop-Einstellungstool. Um den Zugriff auf die Einstellungstools zu erleichtern, wurden sie unter den folgenden &Uuml;berschriften zusammengefasst:</para><itemizedlist><listitem><para>Standard</para></listitem><listitem><para><guilabel>Eingabehilfen</guilabel></para></listitem><listitem><para><guilabel>Erweitert</guilabel></para></listitem></itemizedlist><para>Sie haben folgende M&ouml;glichkeiten, die Einstellungstools zu &ouml;ffnen: </para><itemizedlist><listitem><para>W&auml;hlen Sie <menuchoice><guimenu>Anwendungen</guimenu><guimenuitem>Desktop-Einstellungen</guimenuitem></menuchoice>. W&auml;hlen Sie in den Untermen&uuml;s das gew&uuml;nschte Einstellungstool aus. </para></listitem><listitem><para>Doppelklicken Sie auf das Objekt <guilabel>Hier starten</guilabel> auf dem Desktop-Hintergrund. Im Verzeichnis <guilabel>Hier starten</guilabel> wird ein <application>Nautilus</application>-Fenster ge&ouml;ffnet. Doppelklicken Sie im <application>Nautilus</application>-Fenster auf das Objekt <guilabel>Einstellungen</guilabel>, um die Einstellungstools anzuzeigen. Doppelklicken Sie auf das gew&uuml;nschte Tool. </para></listitem></itemizedlist><para>In den folgenden Kapiteln dieses Abschnitts wird die Konfiguration des Desktops beschrieben. </para><itemizedlist><listitem><para><emphasis>Verwenden des grundlegenden Einstellungstools</emphasis></para><para>Dieses Kapitel enth&auml;lt Informationen &uuml;ber die Anpassung des Desktop-Hintergrunds. Au&szlig;erdem finden Sie Informationen &uuml;ber die Konfiguration der Tastatur- und Mauseinstellungen. Das Kapitel behandelt die Konfiguration von Tastenkombinationen, die Einstellung von Sound-Einstellungen und die Konfiguration des Proxy-Servers f&uuml;r Ihr Netzwerk. Zus&auml;tzlich enth&auml;lt es Informationen dar&uuml;ber, wie Sie ein Thema und Schriften f&uuml;r den Desktop ausw&auml;hlen und wie Sie die Men&uuml;- und Symbolleiste von Anwendungen anpassen. Schlie&szlig;lich wird in diesem Kapitel die Anpassung des Verhaltens aktiver Fenster erl&auml;utert. </para></listitem><listitem><para><emphasis>Verwenden des erweiterten Einstellungstools</emphasis></para><para>Dieses Kapitel beschreibt die Konfiguration von Dateitypen, der von Ihnen bevorzugten Anwendungen und von Panels. Es enth&auml;lt zudem Informationen &uuml;ber die Anpassung von Sitzungen und Startprogrammen. </para></listitem><listitem><para><emphasis>Verwenden des Eingabehilfen-Einstellungstools</emphasis></para><para>Dieses Kapitel erl&auml;utert den Einsatz der Eingabehilfen-Funktionen des Desktops. Sie erfahren, wie die Tastaturzugriffsfunktionen verwendet werden.</para></listitem></itemizedlist></partintro>&goscustdesk;
&goscustlookandfeel;
&goscustaccess;</part>
