<?xml version="1.0" encoding="utf-8"?>
<glossary id="glossary-1">
  <title>Glosario</title>
  <glossentry id="glossary-10">
    <glossterm>aplicaci&oacute;n compatible con GNOME</glossterm>
    <glossdef>
      <para>Una aplicaci&oacute;n que utiliza las bibliotecas est&aacute;ndar de GNOME. Por ejemplo, <application>Nautilus</application> y <application>gedit</application> son aplicaciones compatibles con GNOME. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-6">
    <glossterm>aplique</glossterm>
    <glossdef>
      <para>Un aplique es una aplicaci&oacute;n peque&ntilde;a e interactiva que est&aacute; dentro de un panel, por ejemplo el <application>Lector de CD</application>. Cada aplique dispone de una interfaz simple de usuario con la que se puede trabajar mediante el rat&oacute;n o el teclado. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-7">
    <glossterm>&aacute;rea de trabajo</glossterm>
    <glossdef>
      <para>Un &aacute;rea de trabajo es un &aacute;rea definida del escritorio en la que se trabaja. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-25">
    <glossterm>atajo de teclado</glossterm>
    <glossdef>
      <para>Un <firstterm>atajo de teclado</firstterm> es una combinaci&oacute;n de teclas que proporciona una alternativa a los procedimientos est&aacute;ndar para ejecutar una acci&oacute;n. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-13">
    <glossterm>barra de estado</glossterm>
    <glossdef>
      <para>Una barra situada en la parte inferior de una aplicaci&oacute;n que muestra el estado de lo que se ve en la ventana. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-12">
    <glossterm>barra de herramientas</glossterm>
    <glossdef>
      <para>Una barra que contiene los botones correspondientes a los comandos m&aacute;s utilizados de una aplicaci&oacute;n. Por lo general, suele aparecer debajo de una barra de men&uacute;. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-11">
    <glossterm>barra de men&uacute;s</glossterm>
    <glossdef>
      <para>Una barra situada en la parte superior de una aplicaci&oacute;n que contiene los men&uacute;s de &eacute;sta. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-8">
    <glossterm>caj&oacute;n</glossterm>
    <glossdef>
      <para>Un caj&oacute;n es una extensi&oacute;n desplegable de un icono que se puede abrir o cerrar. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-5">
    <glossterm>combinaciones de teclas</glossterm>
    <glossdef>
      <para>Mediante una combinaci&oacute;n de teclas se proporciona un m&eacute;todo r&aacute;pido de ejecutar una acci&oacute;n. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-17">
    <glossterm>componente visualizador</glossterm>
    <glossdef>
      <para>Un componente de <application>Nautilus</application> que permite mostrar un tipo de archivo determinado en el panel de visualizaci&oacute;n. Este tipo de componente suele a&ntilde;adir elementos al men&uacute; de Nautilus que son relevantes para el tipo de archivo abierto. El visualizador tambi&eacute;n permite la utilizaci&oacute;n de los botones de ampliaci&oacute;n de <application>Nautilus </application> para cambiar el tama&ntilde;o del elemento en el panel de visualizaci&oacute;n. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-21">
    <glossterm>direcci&oacute;n IP</glossterm>
    <glossdef>
      <para>Un n&uacute;mero que identifica a una computadora en una red.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-28">
    <glossterm>enlace simb&oacute;lico</glossterm>
    <glossdef>
      <para>Un tipo especial de archivo que se&ntilde;ala a otro archivo o carpeta. Al ejecutar una acci&oacute;n sobre un enlace simb&oacute;lico, &eacute;sta se ejecuta sobre el archivo o carpeta al que apunta. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-23">
    <glossterm>formatear </glossterm>
    <glossdef>
      <para><glossterm>Formatear</glossterm> un soporte es prepararlo para utilizarlo con un determinado sistema de archivos. Al formatear un soporte, se sobrescribe cualquier informaci&oacute;n existente. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-2">
    <glossterm>herramienta de preferencias</glossterm>
    <glossdef>
      <para>Una herramienta espec&iacute;fica de software que controla una determinada parte del comportamiento del escritorio.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-18">
    <glossterm>inode</glossterm>
    <glossdef>
      <para>Una estructura de datos que contiene informaci&oacute;n acerca de cada archivo en un sistema UNIX. Cada archivo tiene su propio inode. El inode contiene la informaci&oacute;n del nodo, tipo, propietario y ubicaci&oacute;n del archivo. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-3">
    <glossterm>lanzador</glossterm>
    <glossdef>
      <para>Un lanzador inicia una aplicaci&oacute;n en particular, ejecuta un comando o abre un archivo. Puede estar en un panel o en un men&uacute;.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-24">
    <glossterm>montar</glossterm>
    <glossdef>
      <para><firstterm>Montar</firstterm> es hacer accesible un sistema de archivos. Cuando se monta un sistema de archivos, se anexa como un subdirectorio al sistema de archivos del usuario. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-20">
    <glossterm>nombre DNS</glossterm>
    <glossdef>
      <para>Un nombre que identifica a una computadora en una red. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-9">
    <glossterm>objeto del fondo de escritorio</glossterm>
    <glossdef>
      <para>Un icono del fondo del escritorio que se utiliza para abrir archivos, carpetas y aplicaciones. Se pueden utilizar estos objetos para facilitar el acceso a los archivos, carpetas y aplicaciones que se usan con m&aacute;s frecuencia.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-15">
    <glossterm>orden de colocaci&oacute;n</glossterm>
    <glossdef>
      <para>El orden en el que las ventanas se colocan apiladas unas encima de otras en la pantalla. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-4">
    <glossterm>panel</glossterm>
    <glossdef>
      <para>Un panel es una subdivisi&oacute;n de una ventana. Por ejemplo, la ventana de <application>Nautilus</application> contiene un panel lateral y uno de visualizaci&oacute;n. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-22">
    <glossterm>segmento </glossterm>
    <glossdef>
      <para>La partici&oacute;n de un disco. Se pueden crear segmentos en unidades Zip o Jaz. Para cada segmento, se crear&aacute; su correspondiente objeto en el fondo del escritorio. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-26">
    <glossterm>tecla de acceso directo</glossterm>
    <glossdef>
      <para>Una tecla de acceso directo es un atajo de teclado para iniciar aplicaciones. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-27">
    <glossterm>tipo MIME</glossterm>
    <glossdef>
      <para>Un tipo de extensiones multifunci&oacute;n de correo de Internet (MIME) identifica el formato de un archivo. El tipo MIME permite que las aplicaciones lean el archivo. Por ejemplo, una aplicaci&oacute;n de correo electr&oacute;nico puede utilizar el tipo MIME <literal>image/png</literal> para detectar que un mensaje de correo electr&oacute;nico lleva anexado un archivo de tipo Portable Networks Graphic (PNG).</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-19">
    <glossterm>URL</glossterm>
    <glossdef>
      <para>URL (Uniform Resource Locator) es la direcci&oacute;n de un recurso en Internet.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-16">
    <glossterm>vista</glossterm>
    <glossdef>
      <para>Un componente de <application>Nautilus</application> que permite mostrar una carpeta de una determinada manera. Por ejemplo, <application>Nautilus </application> tiene una vista de iconos que permite mostrar el contenido de una carpeta en forma de iconos. <application>Nautilus</application> tambi&eacute;n dispone de una vista que permite mostrar dicho contenido en forma de lista. </para>
    </glossdef>
  </glossentry>
</glossary>
