<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustaccess-1">
  <title>Uso de las herramientas de preferencias de accesibilidad</title>
  <highlights>
    <para>En este cap&iacute;tulo se describe el uso de las herramientas de preferencias <guilabel>Accesibilidad</guilabel> para personalizar el escritorio.</para>
  </highlights>
  <sect1 id="goscustaccess-2">
    <title>Apertura de una herramienta de accesibilidad</title>
    <para>Puede abrir una herramienta de preferencias de <guilabel>Accesibilidad</guilabel> de la siguiente manera: </para>
    <itemizedlist>
      <listitem>
        <para>En el men&uacute; <guisubmenu>Preferencias</guisubmenu></para>
        <para>Elija <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu> Preferencias</guisubmenu><guisubmenu>Accesibilidad</guisubmenu></menuchoice>. Elija la herramienta de preferencias que se necesite en el submen&uacute;. Se mostrar&aacute; el cuadro de di&aacute;logo de la herramienta.</para>
      </listitem>
      <listitem>
        <para>En <guilabel>Empezar aqu&iacute;</guilabel></para>
        <para>Abra la ventana de <application>Nautilus</application> y elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute;</guimenuitem></menuchoice>. Tambi&eacute;n, haga doble clic en el objeto <guilabel>Empezar aqu&iacute;</guilabel> del fondo del escritorio. Se mostrar&aacute; la ubicaci&oacute;n <guilabel>Empezar aqu&iacute;</guilabel>. Haga doble clic en el objeto <guilabel>Preferencias del escritorio</guilabel> de la ventana <application>Nautilus</application> y haga doble clic en la carpeta <guilabel>Accesibilidad</guilabel>. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustaccess-6">
    <title>Configuraci&oacute;n de las opciones de accesibilidad del teclado</title>
    <indexterm>
      <primary>AccessX</primary>
      <see>herramientas de preferencias, accesibilidad del teclado </see>
    </indexterm>
    <indexterm>
      <primary>teclado</primary>
      <secondary>configurar opciones de accesibilidad</secondary>
    </indexterm>
    <indexterm>
      <primary>accesibilidad </primary>
      <secondary>configurar teclado</secondary>
    </indexterm>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Accesibilidad del teclado</secondary>
    </indexterm>
    <para>Se utiliza la herramienta de preferencias <application>Accesibilidad del teclado</application> para personalizar el teclado. La herramienta de preferencias <application>Accesibilidad del teclado</application> tambi&eacute;n se conoce como <application>AccessX</application>. </para>
    <para>La <xref linkend="goscustaccess-TBL-1"/> enumera los valores de accesibilidad del teclado que se pueden modificar.</para>
    <table frame="topbot" id="goscustaccess-TBL-1">
      <title>Valores de accesibilidad del teclado</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="25.64*"/>
        <colspec colname="colspec1" colwidth="74.36*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Opci&oacute;n</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Activar clic del teclado</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Seleccione esta opci&oacute;n para activar las caracter&iacute;sticas de accesibilidad del teclado. Al seleccionar esta opci&oacute;n, las dem&aacute;s opciones de la herramienta de preferencias se activan.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Emitir un pitido al activar/desactivar las caracter&iacute;sticas de accesibilidad del teclado</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Seleccione esta opci&oacute;n para que se produzca una se&ntilde;al ac&uacute;stica al activar o desactivar opciones como las teclas retenidas o las teclas lentas.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Inhabilitar si no se utiliza durante</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Seleccione esta opci&oacute;n para desactivar las preferencias de accesibilidad del teclado si &eacute;ste no se utiliza durante un per&iacute;odo de tiempo especificado. Utilice el deslizador para especificar el n&uacute;mero de segundos de inactividad del teclado que deben transcurrir para que el sistema inhabilite las preferencias de accesibilidad. Una vez transcurrido dicho n&uacute;mero de segundos se inhabilitar&aacute;n las siguientes preferencias de accesibilidad:</para>
              <itemizedlist>
                <listitem>
                  <para>Teclas de rebote</para>
                </listitem>
                <listitem>
                  <para>Teclas de rat&oacute;n</para>
                </listitem>
                <listitem>
                  <para>Teclas lentas</para>
                </listitem>
                <listitem>
                  <para>Teclas retenidas</para>
                </listitem>
                <listitem>
                  <para>Teclas de conmutaci&oacute;n</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Habilitar Teclas de rat&oacute;n</guilabel>
              </para>
              <indexterm>
                <primary>accesibilidad</primary>
                <secondary>teclas de rat&oacute;n</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Seleccione esta opci&oacute;n para que el teclado num&eacute;rico emule el funcionamiento del rat&oacute;n. Se pueden especificar los siguientes valores de configuraci&oacute;n del rat&oacute;n: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Velocidad m&aacute;xima del puntero</guilabel>: utilice este valor de configuraci&oacute;n para especificar la velocidad m&aacute;xima a la que se mover&aacute; el puntero por la pantalla. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Tiempo para acelerar a velocidad m&aacute;xima</guilabel>: utilice este valor para indicar el tiempo de aceleraci&oacute;n del puntero. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Empezar a mover despu&eacute;s de este intervalo posterior a la pulsaci&oacute;n de tecla</guilabel>: utilice este valor para indicar el tiempo que pasar&aacute; entre la pulsaci&oacute;n de una tecla y el movimiento del puntero. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Habilitar Teclas lentas</guilabel>
              </para>
              <indexterm>
                <primary>accesibilidad</primary>
                <secondary>teclas lentas</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Seleccione esta opci&oacute;n para controlar el per&iacute;odo de tiempo que se debe mantener pulsada una tecla antes de que se acepte la pulsaci&oacute;n. Se puede especificar la siguiente configuraci&oacute;n de las teclas lentas: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Aceptar pulsaci&oacute;n de tecla s&oacute;lo despu&eacute;s de:</guilabel> utilice este valor para especificar el per&iacute;odo de tiempo que se debe mantener presionada una tecla antes de que se acepte la pulsaci&oacute;n. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Emitir un pitido cuando la tecla se ha pulsado</guilabel>: seleccione esta opci&oacute;n para recibir una se&ntilde;al ac&uacute;stica al pulsar una tecla. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Emitir un pitido cuando se acepta la tecla</guilabel>: seleccione esta opci&oacute;n para recibir una se&ntilde;al ac&uacute;stica al aceptarse la pulsaci&oacute;n de una tecla. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Emitir un pitido cuando se rechaza la tecla</guilabel>: seleccione esta opci&oacute;n para recibir una se&ntilde;al ac&uacute;stica al rechazar la pulsaci&oacute;n de una tecla. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Habilitar Teclas de rebote</guilabel>
              </para>
              <indexterm>
                <primary>accesibilidad</primary>
                <secondary>teclas de rebote</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Seleccione esta opci&oacute;n para aceptar la pulsaci&oacute;n de las teclas y controlar la repetici&oacute;n. Puede especificar los siguientes valores de las teclas de rebote: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Ignorar pulsaciones de teclas durante</guilabel>: utilice este valor para especificar el intervalo de espera entre la pulsaci&oacute;n de una tecla y su repetici&oacute;n autom&aacute;tica. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Emitir un pitido cuando se rechaza la tecla</guilabel>: seleccione esta opci&oacute;n para recibir una se&ntilde;al ac&uacute;stica al rechazar la pulsaci&oacute;n de una tecla. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Habilitar Teclas retenidas</guilabel>
              </para>
              <indexterm>
                <primary>accesibilidad</primary>
                <secondary>teclas retenidas</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Seleccione esta opci&oacute;n para realizar varias pulsaciones simult&aacute;neas de teclas de forma secuencial. Puede especificar la configuraci&oacute;n de las teclas retenidas: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Emitir un pitido cuando se pulsa una tecla modificadora</guilabel>: seleccione esta opci&oacute;n para recibir una se&ntilde;al ac&uacute;stica al pulsar una tecla modificadora. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Desactivar Teclas lentas cuando se pulsen dos teclas simult&aacute;neamente</guilabel>: seleccione esta opci&oacute;n de forma que cuando se presionen dos teclas simult&aacute;neamente, ya no se puedan apretar m&aacute;s de forma secuencial, para realizar varias pulsaciones simult&aacute;neas.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Teclas de Conmutaci&oacute;n y Repetici&oacute;n</guilabel>
              </para>
              <indexterm>
                <primary>accesibilidad</primary>
                <secondary>teclas de conmutaci&oacute;n</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Seleccione esta opci&oacute;n para recibir una se&ntilde;al ac&uacute;stica al pulsar una tecla de conmutaci&oacute;n. Se oir&aacute; una se&ntilde;al cuando se active la tecla de conmutaci&oacute;n. Se oir&aacute;n dos se&ntilde;ales cuando se desactive la tecla de conmutaci&oacute;n. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>&Aacute;rea de pruebas</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>El &aacute;rea de pruebas es una interfaz interactiva que permite comprobar, al escribir, la configuraci&oacute;n del teclado. Escriba en el &aacute;rea de pruebas para comprobar el efecto de la configuraci&oacute;n.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guibutton>Importar archivo de AccessX CDE</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Haga clic en este bot&oacute;n para importar un archivo de configuraci&oacute;n AccessX de CDE. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Para obtener m&aacute;s informaci&oacute;n acerca de la configuraci&oacute;n de las preferencias de accesibilidad de teclado, consulte <citetitle>GNOME 2.0 Desktop for the Solaris Operating Environment Accessibility Guide</citetitle>.</para>
  </sect1>
</chapter>
