<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustdesk-6">
  <title>Uso de las herramientas de preferencias b&aacute;sicas</title>
  <highlights>
    <para>Las herramientas de preferencias b&aacute;sicas permiten personalizar el fondo del escritorio. Se pueden usar para configurar: los valores del teclado y del rat&oacute;n, las combinaciones de teclas, las preferencias de sonido y el proxy de la red; tambi&eacute;n para elegir los estilos y tipos de letra del escritorio, as&iacute; como personalizar las barras de men&uacute; y de herramientas de las aplicaciones. Asimismo, permiten personalizar el comportamiento del foco de la ventana.</para>
    <para>Este cap&iacute;tulo describe el uso de las herramientas de preferencias b&aacute;sicas para personalizar el escritorio.</para>
  </highlights>
  <sect1 id="goscustdesk-37">
    <title>Apertura de una herramienta de preferencias b&aacute;sicas</title>
    <para>Se puede abrir una de las herramientas de preferencias b&aacute;sicas de diversas maneras:</para>
    <itemizedlist>
      <listitem>
        <para>En el men&uacute; <guimenu>Preferencias</guimenu></para>
        <para>Elija <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem> Preferencias</guimenuitem></menuchoice>. Elija la herramienta de preferencias que se necesite en el submen&uacute;. Se mostrar&aacute; el cuadro de di&aacute;logo de la herramienta.</para>
      </listitem>
      <listitem>
        <para>En <guilabel>Empezar aqu&iacute;</guilabel></para>
        <para>Abra la ventana de <application>Nautilus</application> y elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute;</guimenuitem></menuchoice>. Tambi&eacute;n, haga doble clic en el objeto <guilabel>Empezar aqu&iacute;</guilabel> del fondo del escritorio. Se mostrar&aacute; la ubicaci&oacute;n <guilabel>Empezar aqu&iacute;</guilabel>. Haga doble clic en el objeto <guilabel>Preferencias del escritorio</guilabel> en la ventana de <application>Nautilus</application> para ver las herramientas de preferencias. </para>
        <para>Haga doble clic en la herramienta que desee. Se mostrar&aacute; el cuadro de di&aacute;logo de la herramienta.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustdesk-7">
    <title>Personalizaci&oacute;n del fondo del escritorio</title>
    <indexterm>
      <primary>fondo del escritorio </primary>
      <secondary>personalizar</secondary>
    </indexterm>
    <indexterm>
      <primary>herramientas de preferencias del escritorio</primary>
      <see>herramientas de preferencias</see>
    </indexterm>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Fondo</secondary>
    </indexterm>
    <indexterm>
      <primary>fondos</primary>
      <secondary>personalizar el fondo del escritorio</secondary>
    </indexterm>
    <para>El fondo del escritorio es la parte en la que no hay elementos gr&aacute;ficos de interfaz, como paneles o ventanas. El fondo del escritorio siempre se sit&uacute;a detr&aacute;s de los dem&aacute;s elementos de la interfaz.</para>
    <para>Se puede personalizar el fondo del escritorio de diversas maneras:</para>
    <itemizedlist>
      <listitem>
        <para>Seleccionar una imagen como fondo del escritorio. La imagen se superpone al color del fondo del escritorio. El color del fondo del escritorio se ve si la imagen es transparente o no lo cubre en su totalidad.</para>
      </listitem>
      <listitem>
        <para>Seleccionar el color del fondo del escritorio. Se puede seleccionar un color s&oacute;lido o crear un efecto de fundido entre dos colores. Un efecto de fundido es un efecto visual en el que un color se transforma gradualmente en otro. </para>
      </listitem>
    </itemizedlist>
    <para>Se puede cambiar tambi&eacute;n el aspecto del fondo del escritorio en el gestor de archivos <application>Nautilus</application>.</para>
    <para>La <xref linkend="goscustdesk-TBL-14"/> enumera los valores de configuraci&oacute;n que se pueden editar.</para>
    <table frame="topbot" id="goscustdesk-TBL-14">
      <title>Valores de configuraci&oacute;n del fondo del escritorio</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Elemento</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Seleccionar imagen</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione una imagen como fondo de escritorio. Para elegirla, haga clic en el bot&oacute;n <guibutton>Seleccionar imagen</guibutton>. Se mostrar&aacute; un selector de im&aacute;genes. Utilice el cuadro de di&aacute;logo para seleccionar una imagen. Cuando haya seleccionado la imagen, haga clic en el bot&oacute;n <guibutton>Aceptar</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Opciones de imagen</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Para indicar c&oacute;mo mostrar la imagen, seleccione una de entre las opciones siguientes:</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Papel tapiz</guilabel>: repite la imagen hasta cubrir todo el fondo del escritorio.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Centrado</guilabel>: muestra la imagen en medio del fondo del escritorio.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Escalado</guilabel>: agranda la imagen hasta encajar con el tama&ntilde;o de la pantalla manteniendo las dimensiones relativas de la imagen.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Estirado</guilabel>: agranda la imagen para que cubra todo el fondo del escritorio, sin mantener las dimensiones relativas de la imagen.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Sin imagen</guilabel>: no muestra ninguna imagen.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Estilo de fondo</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Para especificar un esquema de colores, use las opciones de la lista desplegable <guilabel>Estilo de fondo</guilabel> y los botones selectores de color</para>
              <para>Puede especificar un esquema de colores de diversas maneras:</para>
              <itemizedlist>
                <listitem>
                  <para>Elija <guilabel>Color s&oacute;lido</guilabel> en la lista desplegable <guilabel> Estilo de fondo</guilabel> para escoger un &uacute;nico color para el fondo del escritorio. </para>
                  <para>Para elegir el color, haga clic en el bot&oacute;n  <guibutton>Color</guibutton>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Elija un Color</guilabel>. Selecci&oacute;nelo y haga clic en <guibutton>Aceptar</guibutton>.</para>
                </listitem>
                <listitem>
                  <para>Elija <guilabel>Degradado horizontal </guilabel> en la lista desplegable <guilabel> Estilo de fondo</guilabel>. Esta opci&oacute;n crea un efecto de fundido de izquierda a derecha de la pantalla.</para>
                  <para>Haga clic en el bot&oacute;n <guibutton>Color izquierdo</guibutton> para mostrar el cuadro de di&aacute;logo <guilabel>Elija un color</guilabel>. Escoja el color que desee que aparezca en la parte izquierda.</para>
                  <para>Haga clic en el bot&oacute;n <guibutton>Color derecho</guibutton>. Elija el color que desee que aparezca en la parte derecha.</para>
                </listitem>
                <listitem>
                  <para>Elija <guilabel>Degradado vertical </guilabel> en la lista desplegable <guilabel>Estilo de fondo</guilabel>. Esta opci&oacute;n crea un efecto de fundido de la parte superior a la inferior de la pantalla.</para>
                  <para>Haga clic en el bot&oacute;n <guibutton>Color superior</guibutton> para que aparezca el cuadro de di&aacute;logo <guilabel>Elija un color</guilabel>. Escoja el color que desee que aparezca en la parte superior.</para>
                  <para>Haga clic en el bot&oacute;n <guibutton>Color inferior</guibutton>. Elija el color que desee que aparezca en la parte inferior.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustdesk-38">
    <title>Elecci&oacute;n de tipos de letra predeterminados</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Tipo de letra</secondary>
    </indexterm>
    <indexterm>
      <primary>tipos de letra</primary>
      <secondary>fondo del escritorio </secondary>
    </indexterm>
    <indexterm>
      <primary>tipos de letra</primary>
      <secondary>aplicaciones </secondary>
    </indexterm>
    <para>La herramienta de preferencias <application>Tipo de letra</application> permite seleccionar los tipograf&iacute;a que se desea usar en las aplicaciones y en el fondo del escritorio.</para>
    <para>La <xref linkend="goscustdesk-TBL-26"/> enumera los valores configurables de los tipos de letra.</para>
    <table frame="topbot" id="goscustdesk-TBL-26">
      <title>Valores de configuraci&oacute;n de Tipos de letra</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec18" colwidth="19.21*"/>
        <colspec colname="colspec19" colwidth="46.79*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Opci&oacute;n</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Tipograf&iacute;a para las aplicaciones</guilabel>
              </para>
            </entry>
            <entry colsep="0" rowsep="0" valign="top">
              <para> Haga clic en el bot&oacute;n del tipo de letra que desee usar en las aplicaciones. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Tipograf&iacute;a para el escritorio</guilabel>
              </para>
            </entry>
            <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
              <para> Haga clic en el bot&oacute;n del tipo de letra que desee usar en el escritorio. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustperiph-2">
    <title>Configuraci&oacute;n del teclado</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Teclado</secondary>
    </indexterm>
    <indexterm>
      <primary>teclado</primary>
      <secondary>configurar preferencias generales</secondary>
    </indexterm>
    <para>La herramienta de preferencias <application>Teclado</application> permite configurar los valores de auto-repetici&oacute;n y los eventos de sonido asociados al teclado. </para>
    <para>Se pueden personalizar los valores de <application>Teclado</application> en las siguientes &aacute;reas funcionales:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Teclado</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Sonido</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustdesk-40">
      <title>Valores de configuraci&oacute;n del teclado</title>
      <para>Se usa la pesta&ntilde;a <guilabel>Teclado</guilabel> para configurar las preferencias generales del teclado. Para iniciar <application>AccessX</application>, la herramienta de preferencia de <emphasis>accesibilidad</emphasis> del <application>Teclado</application>, haga clic en el bot&oacute;n <guibutton>Accesibilidad</guibutton>.</para>
      <para>La <xref linkend="goscustperiph-TBL-3"/> enumera los valores que se pueden configurar.</para>
      <table frame="topbot" id="goscustperiph-TBL-3">
        <title>Configuraci&oacute;n del teclado</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>El teclado repite cuando se mantiene pulsada la tecla.</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n para habilitar la funci&oacute;n de repetici&oacute;n del teclado. Si se activa, al mantener pulsada una tecla, la acci&oacute;n asociada a la tecla se ejecuta de forma repetida. Por ejemplo, si mantiene pulsado un car&aacute;cter, &eacute;ste se escribe repetidamente.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Demora</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Seleccione el intervalo entre la pulsaci&oacute;n de una tecla y la repetici&oacute;n de la acci&oacute;n.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Velocidad</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Seleccione la velocidad a la que se repite la acci&oacute;n. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> El cursor parpadea en los campos de texto</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n para activar el parpadeo del cursor en los campos y cuadros de texto.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Velocidad</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Use el deslizador para indicar la velocidad a la que el cursor debe parpadear en los campos y cuadros de texto.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-41">
      <title>Configuraci&oacute;n de sonidos</title>
      <indexterm>
        <primary>teclado</primary>
        <secondary>configurar las preferencias de sonido </secondary>
      </indexterm>
      <indexterm>
        <primary>sonido</primary>
        <secondary>configurar las preferencias de sonido</secondary>
      </indexterm>
      <para>Use la pesta&ntilde;a <guilabel>Sonido</guilabel> para configurar el sonido del teclado. </para>
      <para>Algunas aplicaciones emiten un sonido de campana para indicar un error al introducir datos con el teclado. Use las opciones de la pesta&ntilde;a <guilabel>Sonido</guilabel> para configurar el sonido de la se&ntilde;al. La <xref linkend="goscustdesk-TBL-1"/> enumera los valores del sonido del teclado que se pueden configurar</para>
      <table frame="topbot" id="goscustdesk-TBL-1">
        <title>Configuraci&oacute;n del sonido del teclado</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0">
                <para>
                  <guilabel>Apagado</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0">
                <para>Seleccione esta opci&oacute;n para desactivar la se&ntilde;al ac&uacute;stica del teclado.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Pitido</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n para activar la se&ntilde;al ac&uacute;stica del teclado.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-39">
    <title>Personalizaci&oacute;n de las combinaciones de teclas</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Combinaciones de teclas</secondary>
    </indexterm>
    <indexterm>
      <primary>combinaciones de teclas</primary>
      <secondary>configurar</secondary>
    </indexterm>
    <indexterm>
      <primary>combinaciones de teclas</primary>
      <secondary>configurar</secondary>
    </indexterm>
    <indexterm>
      <primary>teclas de acceso directo</primary>
      <secondary>configurar</secondary>
    </indexterm>
    <para>Las <firstterm>Combinaciones de teclas</firstterm> proporcionan una alternativa a los procedimientos est&aacute;ndar para ejecutar una acci&oacute;n. </para>
    <para>Use la herramienta de preferencias <application>Combinaciones de teclas</application> para ver las combinaciones de teclas predeterminadas. Se pueden personalizar las combinaciones de teclas predeterminadas seg&uacute;n sus necesidades. </para>
    <para>Tambi&eacute;n puede crear <firstterm>teclas de acceso directo</firstterm>. Una tecla de acceso directo es un atajo de teclado para iniciar aplicaciones. </para>
    <para>La <xref linkend="goscustdesk-TBL-3"/> enumera los valores de las combinaciones de teclas que se pueden personalizar.</para>
    <table frame="topbot" id="goscustdesk-TBL-3">
      <title>Valores predeterminados de combinaciones de teclas</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="36.11*"/>
        <colspec colname="colspec1" colwidth="63.89*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Opci&oacute;n</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Combinaciones de teclas para editar texto</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Seleccione uno de los siguientes valores:</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Predeterminado</guilabel>: este valor corresponde a las combinaciones de teclas est&aacute;ndar.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Emacs</guilabel>: este valor corresponde a las combinaciones de teclas de la aplicaci&oacute;n <application>Emacs</application>.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Combinaciones de teclas para el escritorio</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>En esta tabla se muestra una lista de combinaciones de teclas y sus acciones. </para>
              <para>Para cambiar la combinaci&oacute;n de teclas de una acci&oacute;n, haga clic en dicha acci&oacute;n para seleccionarla y a continuaci&oacute;n en la combinaci&oacute;n de teclas de la misma. Luego pulse las teclas que desea asociar con la acci&oacute;n.</para>
              <para>Para inhabilitar la combinaci&oacute;n de teclas de una acci&oacute;n, haga doble clic en dicha acci&oacute;n y a continuaci&oacute;n haga clic en la combinaci&oacute;n de teclas de la misma. Pulse <keycap>Retroceso</keycap>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Teclas de acceso directo personalizadas</guilabel>
              </para>
            </entry>
            <entry colname="colspec1">
              <para>Para agregar una tecla de acceso directo, siga estos pasos:</para>
              <orderedlist>
                <listitem>
                  <para>Haga clic en <guibutton>Nuevo</guibutton>. Aparece el cuadro de di&aacute;logo <guilabel>Atajo de teclado personalizado</guilabel>. Escriba el comando que se debe asociar con la tecla de acceso directo en el campo <guilabel>Nuevo Comando</guilabel>. Tambi&eacute;n puede buscar el comando con el bot&oacute;n <guibutton>Examinar</guibutton>. Cuando seleccione el comando, haga clic en <guibutton>Aceptar</guibutton>. El comando se agrega a la secci&oacute;n <guilabel>Teclas de acceso directo personalizadas</guilabel> en la tabla <guilabel>Teclas de acceso directo del escritorio</guilabel>.</para>
                </listitem>
                <listitem>
                  <para>Haga clic en la columna <guilabel>Acceso directo</guilabel> del comando en la secci&oacute;n <guilabel>Atajos de teclado personalizados</guilabel> de la tabla  <guilabel>Teclas de acceso directo del escritorio</guilabel>. Pulse la tecla o combinaci&oacute;n de teclas que desea asociar con el comando. </para>
                </listitem>
              </orderedlist>
              <para>Para editar una tecla de acceso directo, selecci&oacute;nela en la secci&oacute;n <guilabel>Teclas de acceso directo personalizadas</guilabel> de la tabla  <guilabel>Teclas de acceso directo del escritorio</guilabel> y, a continuaci&oacute;n, haga clic en <guibutton>Editar</guibutton>. Edite el comando en el cuadro de di&aacute;logo <guilabel>Atajo de teclado personalizado</guilabel>.</para>
              <para>Para quitar una tecla de acceso directo, selecci&oacute;nela en la secci&oacute;n <guilabel>Teclas de acceso directo personalizadas</guilabel> de la tabla  <guilabel>Teclas de acceso directo del escritorio</guilabel> y, a continuaci&oacute;n, haga clic en <guibutton>Quitar</guibutton>. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustuserinter-2">
    <title>Personalizaci&oacute;n de men&uacute;s y barras de herramientas en las aplicaciones</title>
    <indexterm>
      <primary>barras de herramientas, personalizaci&oacute;n del aspecto</primary>
    </indexterm>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Men&uacute;s y Barras de herramientas </secondary>
    </indexterm>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>de aplicaciones, personalizar el aspecto</secondary>
    </indexterm>
    <para>Se puede usar la herramienta de preferencia <application> Men&uacute;s y Barras de herramientas</application> para personalizar el aspecto de los men&uacute;s, barras de men&uacute; y barras de herramientas de las aplicaciones compatibles con GNOME.</para>
    <para>La <xref linkend="goscustuserinter-TBL-8"/> enumera los valores de la barra de men&uacute;s y de la barra de herramientas que se pueden personalizar en las aplicaciones compatibles con GNOME. </para>
    <table frame="topbot" id="goscustuserinter-TBL-8">
      <title>Personalizaci&oacute;n de aplicaciones</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Opci&oacute;n</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Botones</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione una de las siguientes opciones seg&uacute;n lo que se desea mostrar en las barras de herramientas de las aplicaciones compatibles con GNOME:</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Texto debajo de los iconos</guilabel>: seleccione esta opci&oacute;n para que aparezcan las barras de herramientas con texto as&iacute; como tambi&eacute;n un icono para cada bot&oacute;n. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Texto junto a los iconos</guilabel>: seleccione esta opci&oacute;n para mostrar las barras de herramientas con s&oacute;lo un icono en cada bot&oacute;n y, adem&aacute;s, texto en los botones m&aacute;s importantes.</para>
                </listitem>
                <listitem>
                  <para><guilabel>S&oacute;lo iconos</guilabel>: seleccione esta opci&oacute;n para mostrar las barras de herramientas con s&oacute;lo un icono en cada bot&oacute;n.</para>
                </listitem>
                <listitem>
                  <para><guilabel>S&oacute;lo texto</guilabel>: seleccione esta opci&oacute;n para mostrar las barras de herramientas con texto s&oacute;lo en cada bot&oacute;n.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Las barras de herramientas se pueden desprender y mover</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione esta opci&oacute;n si desea mover las barras de herramientas de las ventanas de las aplicaciones a cualquier ubicaci&oacute;n del escritorio. Si selecciona esta opci&oacute;n, se mostrar&aacute;n unas asas en la parte izquierda de las barras de herramientas de las aplicaciones. Para mover la barra de herramientas, haga clic y arrastre por el asa hasta la nueva ubicaci&oacute;n en el escritorio.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Mostrar iconos en los men&uacute;s</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione esta opci&oacute;n para mostrar un icono junto a cada elemento de los men&uacute;s. Algunos elementos de los men&uacute;s no tienen icono.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustperiph-5">
    <title>Configuraci&oacute;n del rat&oacute;n</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Rat&oacute;n</secondary>
    </indexterm>
    <indexterm>
      <primary>rat&oacute;n</primary>
      <secondary>configuraci&oacute;n</secondary>
    </indexterm>
    <para>Use la herramienta de preferencias <application>Rat&oacute;n</application> si desea configurar el uso del rat&oacute;n para usuarios diestros o zurdos. Tambi&eacute;n se puede indicar la velocidad y sensibilidad del movimiento del rat&oacute;n.</para>
    <para>Se puede personalizar la configuraci&oacute;n del <application>rat&oacute;n</application> en las siguientes &aacute;reas:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Botones</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Cursores</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Movimiento</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustdesk-55">
      <title>Configuraci&oacute;n de los botones</title>
      <para>Use la pesta&ntilde;a <guilabel>Botones</guilabel> para indicar si los botones del rat&oacute;n se configuran para zurdos. Tambi&eacute;n se puede indicar el lapso necesario entre dos pulsaciones que se interpretan como doble clic.</para>
      <para>La <xref linkend="goscustperiph-TBL-6"/> enumera los valores configurables de los botones.</para>
      <table frame="topbot" id="goscustperiph-TBL-6">
        <title>Configuraci&oacute;n de los botones del rat&oacute;n</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Rat&oacute;n zurdo</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para> Seleccione esta opci&oacute;n si desea configurar el rat&oacute;n para usuarios zurdos. Al configurar el rat&oacute;n para zurdos, las funciones del bot&oacute;n izquierdo y del derecho se intercambian.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Retraso</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para> Utilice este deslizador para especificar el tiempo que debe pasar entre dos clics de rat&oacute;n para hacer un doble clic. Si el tiempo transcurrido entre dos clics de rat&oacute;n es superior a este valor, la acci&oacute;n no se considera doble clic. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-54">
      <title>Configuraci&oacute;n del puntero</title>
      <para>La pesta&ntilde;a <guilabel>Cursores</guilabel> se utiliza para configurar las preferencias en los punteros del rat&oacute;n.</para>
      <para>La <xref linkend="goscustdesk-TBL-45"/> enumera los valores configurables del puntero del rat&oacute;n:</para>
      <table frame="topbot" id="goscustdesk-TBL-45">
        <title>Configuraci&oacute;n de los punteros del rat&oacute;n</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="50*"/>
          <colspec colname="colspec1" colwidth="50*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Tema de cursor</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Seleccione en la lista el dise&ntilde;o del cursor que prefiera. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <guilabel>Mostrar posici&oacute;n del cursor cuando se pulsa la tecla Control</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Seleccione esta opci&oacute;n para activar la animaci&oacute;n del puntero del rat&oacute;n al pulsar y soltar la tecla <keycap>Ctrl</keycap>. Esta funci&oacute;n permite localizar el puntero del rat&oacute;n.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-53">
      <title>Configuraci&oacute;n de movimiento</title>
      <para>En la pesta&ntilde;a <guilabel>Movimiento</guilabel> se puede configurar el movimiento del rat&oacute;n.</para>
      <para>La <xref linkend="goscustdesk-TBL-47"/> enumera los valores configurables del movimiento del rat&oacute;n</para>
      <table frame="topbot" id="goscustdesk-TBL-47">
        <title>Configuraci&oacute;n del movimiento del rat&oacute;n</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="30.10*"/>
          <colspec colwidth="69.90*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Valor</para>
              </entry>
              <entry valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Aceleraci&oacute;n</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Mediante este deslizador, seleccione la velocidad a la que desea que se mueva el puntero del rat&oacute;n.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Sensibilidad</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Mediante este deslizador, seleccione la sensibilidad del puntero a los movimientos del rat&oacute;n.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Umbral</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Mediante este deslizador, seleccione la distancia m&iacute;nima que se debe mover un objeto para que se considere un arrastre.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-50">
    <title>Configuraci&oacute;n del proxy de red</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Proxy de red</secondary>
    </indexterm>
    <indexterm>
      <primary>proxy de red</primary>
      <secondary>preferencias de configuraci&oacute;n</secondary>
    </indexterm>
    <indexterm>
      <primary>proxy</primary>
      <secondary> preferencias de configuraci&oacute;n</secondary>
    </indexterm>
    <para>La herramienta <application>Red</application> permite configurar la conexi&oacute;n del sistema a una red. Se puede configurar el escritorio para conectarse a un  <firstterm>servidor proxy</firstterm> e indicar los detalles correspondientes. Un servidor proxy es un servidor que acepta peticiones que van a otro servidor y las atiende si puede. Se puede indicar tanto el nombre del Servicio de nombres de dominio (DNS) como la direcci&oacute;n del Protocolo de Internet (IP) del servidor proxy. Un <firstterm>nombre DNS</firstterm> es un identificador alfab&eacute;tico exclusivo que identifica una computadora en una red. Una <firstterm>direcci&oacute;n IP</firstterm> es un identificador num&eacute;rico exclusivo que identifica una computadora en una red. </para>
    <para>La <xref linkend="goscustdesk-TBL-52"/> enumera los valores configurables del proxy de red.</para>
    <table frame="topbot" id="goscustdesk-TBL-52">
      <title>Configuraci&oacute;n del proxy de red</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec2" colwidth="35.09*"/>
        <colspec colname="colspec3" colwidth="64.91*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Opci&oacute;n</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Utilizar proxy HTTP</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Seleccione esta opci&oacute;n si desea usar un proxy para los servicios por HTTP.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Ubicaci&oacute;n</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Indique el nombre DNS o la direcci&oacute;n IP del servidor proxy que se utiliza para solicitar un servicio por HTTP.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Puerto</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Indique el n&uacute;mero de puerto del servicio por HTTP en el servidor proxy.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>El proxy requiere un nombre de usuario y contrase&ntilde;a</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>Seleccione esta opci&oacute;n si el servidor proxy necesita un nombre de usuario y una contrase&ntilde;a.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Guardar nombre de usuario y contrase&ntilde;a en disco</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>Seleccione esta opci&oacute;n para guardar el nombre de usuario y la contrase&ntilde;a.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Nombre de usuario</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>Escriba el nombre de usuario para el servidor proxy. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Contrase&ntilde;a</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Escriba la contrase&ntilde;a para el servidor proxy. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustmulti-2">
    <title>Configuraci&oacute;n del sonido</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Sonido</secondary>
    </indexterm>
    <indexterm>
      <primary>sonido</primary>
      <secondary>configurar preferencias </secondary>
    </indexterm>
    <indexterm>
      <primary>sonido</primary>
      <secondary>asociar eventos con sonidos</secondary>
    </indexterm>
    <indexterm>
      <primary>eventos, asociar sonidos con</primary>
    </indexterm>
    <indexterm>
      <primary>servidor de sonido</primary>
    </indexterm>
    <para>La herramienta de preferencias <application>Sonido</application> permite controlar cu&aacute;ndo se inicia el servidor de sonido de GNOME. Tambi&eacute;n se pueden configurar los sonidos asociados a un evento en particular.</para>
    <para>Se puede personalizar la herramienta de preferencias <application>Sonido</application> en las siguientes &aacute;reas:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>General</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Eventos de sonido</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustmulti-3">
      <title>Configuraci&oacute;n de General</title>
      <para>La pesta&ntilde;a <guilabel>General</guilabel> de la herramienta de preferencias <application>Sonido</application> permite especificar cu&aacute;ndo iniciar el servidor de sonido de GNOME. Se pueden habilitar tambi&eacute;n las funciones de eventos de sonido.</para>
      <para>La <xref linkend="goscustmulti-TBL-4"/> enumera los valores configurables del sonido.</para>
      <table frame="topbot" id="goscustmulti-TBL-4">
        <title>Configuraci&oacute;n del sonido</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Activar el lanzamiento del servidor de sonido</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para> Seleccione esta opci&oacute;n para iniciar el servidor de sonido de GNOME al iniciar una sesi&oacute;n. Cuando el servidor de sonido est&aacute; activo, el escritorio puede reproducir sonidos.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Sonidos para los eventos</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para> Seleccione esta opci&oacute;n para reproducir un sonido en concreto cuando se produce un evento en el escritorio. S&oacute;lo se puede seleccionar si se marca la opci&oacute;n <guilabel>Activar el lanzamiento del servidor de sonido</guilabel>.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-48">
      <title>Configuraci&oacute;n de los eventos de sonido</title>
      <para>La pesta&ntilde;a <guilabel>Eventos de sonido</guilabel> en la herramienta de preferencias <application>Sonido</application> se usa para asociar un sonido con un evento en particular. </para>
      <note>
        <para>Es necesario seleccionar las opciones <guilabel>Activar el lanzamiento del servidor de sonido</guilabel> y <guilabel>Sonidos para los eventos</guilabel> antes de poder acceder a la pesta&ntilde;a <guilabel>Eventos de sonido</guilabel>.</para>
      </note>
      <para>La <xref linkend="goscustmulti-TBL-6"/> enumera los valores configurables de los eventos de sonido.</para>
      <table frame="topbot" id="goscustmulti-TBL-6">
        <title>Configuraci&oacute;n de eventos de sonido</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>Tabla <guilabel>Sonidos </guilabel></para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Use la tabla <guilabel>Sonido</guilabel> para asociar un sonido con un evento en particular. </para>
                <para>La columna <guilabel>Evento</guilabel> muestra una lista jer&aacute;rquica de los eventos posibles. Para expandir una categor&iacute;a, haga clic en la flecha hacia abajo que aparece junto a cada categor&iacute;a.</para>
                <para>En la columna <guilabel>Archivo que se debe reproducir</guilabel> aparece el sonido asociado a cada evento.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guibutton>Reproducir </guibutton>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Haga clic en este bot&oacute;n para reproducir el sonido asociado al evento seleccionado. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>Cuadro de combinaci&oacute;n desplegable de archivos de sonido, <guibutton>Navegar</guibutton></para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Para asociar un sonido con un evento, selecci&oacute;nelo primero en la tabla <guilabel>Sonido</guilabel>. Escriba el nombre del archivo de sonido que desea asociar con el evento seleccionado en el cuadro de combinaci&oacute;n desplegable. Tambi&eacute;n puede hacer clic en <guibutton>Navegar</guibutton> para mostrar el cuadro de di&aacute;logo <guilabel>Seleccione un archivo de sonido</guilabel>. Use el cuadro de di&aacute;logo para indicar el archivo de sonido que desea asociar con el evento seleccionado.</para>
                <note>
                  <para>S&oacute;lo se pueden seleccionar archivos de formato <filename>.wav</filename>. </para>
                </note>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-12">
    <title>Configuraci&oacute;n de temas de escritorio</title>
    <indexterm>
      <primary>temas Gtk+</primary>
      <see>temas</see>
    </indexterm>
    <indexterm>
      <primary>temas</primary>
      <secondary>configurar temas del escritorio</secondary>
    </indexterm>
    <indexterm>
      <primary>temas</primary>
      <secondary>configurar temas del marco de ventana </secondary>
    </indexterm>
    <indexterm>
      <primary>ventanas</primary>
      <secondary>configurar temas del marco</secondary>
    </indexterm>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Tema</secondary>
    </indexterm>
    <para>La herramienta <application>Tema</application> permite seleccionar un tema para el escritorio y los marcos de las ventanas. Se puede personalizar la configuraci&oacute;n de la herramienta <application>Tema</application> en las siguientes &aacute;reas:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Tema del  Widget</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Marcos de ventana</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <para>Los temas del escritorio y del marco de la ventana no son los &uacute;nicos que permiten determinar el aspecto del escritorio. Por ejemplo, <application>Nautilus</application> incluye temas que se pueden usar para cambiar el aspecto de las ventanas de <application>Nautilus </application> y del fondo del escritorio. </para>
    <sect2 id="goscustdesk-56">
      <title>Configuraci&oacute;n de los temas del escritorio</title>
      <para>En la secci&oacute;n <guilabel>Tema del Widget</guilabel> de la herramienta de preferencias <application>Tema</application> se puede seleccionar un tema para el escritorio. El tema del escritorio determina el aspecto de los paneles, applets y ventanas. As&iacute; como el de los elementos de la interfaz de las aplicaciones compatibles con GNOME. Por ejemplo, el tema determina el aspecto de los botones, barras de desplazamiento, casillas de verificaci&oacute;n, etc.</para>
      <para>Pueden elegirse los temas disponibles o instalar otros nuevos. La lista de temas de escritorio disponibles incluye algunos adecuados para usuarios con problemas de accesibilidad.</para>
      <para>La <xref linkend="goscustlookandfeel-TBL-23"/> enumera los valores configurables de los temas.</para>
      <table frame="topbot" id="goscustlookandfeel-TBL-23">
        <title>Configuraci&oacute;n de temas de escritorio</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="40.81*"/>
          <colspec colwidth="59.19*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Temas disponibles</para>
              </entry>
              <entry valign="top">
                <para>Seleccione el tema que desee en la lista.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Instalar nuevo tema</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Puede a&ntilde;adir un nuevo tema a la lista de disponibles. El nuevo tema debe ser una carpeta no comprimida. </para>
                <para>Para agregar un tema a la lista de temas disponibles, haga clic en el bot&oacute;n <guibutton>Instalar nuevo tema</guibutton>. Se mostrar&aacute; un cuadro de di&aacute;logo. Escriba el nombre de la carpeta con el tema en el cuadro de combinaci&oacute;n desplegable. Tambi&eacute;n puede buscar la carpeta con el bot&oacute;n <guibutton>Examinar</guibutton>. Cuando seleccione la carpeta, haga clic en <guibutton>Aceptar</guibutton>.</para>
                <para>Puede encontrar muchos temas GTK en Internet.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Ir a la carpeta de temas</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Haga clic en este bot&oacute;n para abrir una ventana del administrador de archivos en la carpeta predeterminada de temas. En la ventana del gestor de archivos puede suprimir temas. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-57">
      <title>Configuraci&oacute;n de marcos de ventana</title>
      <para>En la secci&oacute;n <guilabel>Marcos de ventana</guilabel> de la herramienta de preferencias <application>Tema</application> se puede seleccionar un tema para los marcos de las ventanas. Pueden elegirse los temas disponibles o instalar otros nuevos. La lista de temas de escritorio disponibles incluye algunos adecuados para usuarios con problemas de accesibilidad.</para>
      <para>La <xref linkend="goscustdesk-TBL-2"/> enumera los valores configurables del marco de ventana.</para>
      <table frame="topbot" id="goscustdesk-TBL-2">
        <title>Configuraci&oacute;n de los temas para el marco de la ventana</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="40.81*"/>
          <colspec colwidth="59.19*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Temas disponibles</para>
              </entry>
              <entry valign="top">
                <para>Seleccione el tema que desee en la lista.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Instalar nuevo tema</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Puede a&ntilde;adir un nuevo tema a la lista de disponibles. El nuevo tema debe ser una carpeta no comprimida. </para>
                <para>Para agregar un tema a la lista de temas disponibles, haga clic en el bot&oacute;n <guibutton>Instalar nuevo tema</guibutton>. Se mostrar&aacute; un cuadro de di&aacute;logo. Escriba el nombre de la carpeta con el tema en el cuadro de combinaci&oacute;n desplegable. Tambi&eacute;n puede buscar la carpeta con el bot&oacute;n <guibutton>Examinar</guibutton>. Cuando seleccione la carpeta, haga clic en <guibutton>Aceptar</guibutton>.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Ir a la carpeta de temas</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Haga clic en este bot&oacute;n para abrir una ventana del administrador de archivos en la carpeta predeterminada de temas. En la ventana del gestor de archivos puede suprimir temas. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustwindows-2">
    <title>Personalizaci&oacute;n del foco</title>
    <indexterm>
      <primary>Gestor de ventanas Metacity </primary>
      <see>gestor de ventanas</see>
    </indexterm>
    <indexterm>
      <primary>gestor de ventanas</primary>
      <secondary>personalizar </secondary>
    </indexterm>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Foco de la ventana</secondary>
    </indexterm>
    <para>Use la herramienta de preferencias <application>Foco de la ventana</application> para personalizar el comportamiento del foco en el escritorio.</para>
    <para>La <xref linkend="goscustwindows-TBL-3"/> enumera los valores configurables del comportamiento del foco.</para>
    <table frame="topbot" id="goscustwindows-TBL-3">
      <title>Configuraci&oacute;n del foco de la ventana</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Opci&oacute;n</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Clic para dar el foco</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione esta opci&oacute;n para enfocar una ventana al hacer clic en ella. La ventana se mantiene enfocada hasta que se haga clic en otra.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0">
              <para>
                <guilabel>Punto para dar el foco</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0">
              <para>Seleccione esta opci&oacute;n para enfocar una ventana al apuntar a ella. La ventana se mantiene enfocada hasta que apunte a otra. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0">
              <para>
                <guilabel>Adelantar ventana al obtener el foco</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0">
              <para>Seleccione esta opci&oacute;n para situar las ventanas en el primer plano al enfocarlas.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
</chapter>
