<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustuserinter-1">
  <title>Uso de las herramientas de preferencias avanzadas</title>
  <highlights>
    <para>Las herramientas de preferencias <guilabel>Avanzadas</guilabel> permiten configurar: el comportamiento y la apariencia de las aplicaciones, paneles y otras interfaces del usuario;  los tipos de archivos, las aplicaciones predeterminadas y los paneles. Tambi&eacute;n se pueden utilizar para personalizar las sesiones y los programas de inicio. En este cap&iacute;tulo se describe el uso de las herramientas <guilabel> Avanzadas</guilabel> para personalizar el escritorio.</para>
  </highlights>
  <sect1 id="goscustlookandfeel-17">
    <title>Apertura de las herramientas de preferencias avanzadas</title>
    <para>Se puede abrir una herramienta de preferencias <guilabel>Avanzadas</guilabel> mediante alguno de los m&eacute;todos siguientes:</para>
    <itemizedlist>
      <listitem>
        <para>En el men&uacute; <guimenu>Preferencias</guimenu></para>
        <para>Elija <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu> Preferencias</guisubmenu><guimenuitem>Avanzadas</guimenuitem></menuchoice>. Elija la herramienta que necesite en el submen&uacute;. Se mostrar&aacute; el cuadro de di&aacute;logo de la herramienta.</para>
      </listitem>
      <listitem>
        <para>En <guilabel>Empezar aqu&iacute;</guilabel></para>
        <para>Abra la ventana de <application>Nautilus</application> y elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute;</guimenuitem></menuchoice>. Tambi&eacute;n, haga doble clic en el objeto <guilabel>Empezar aqu&iacute;</guilabel> del fondo del escritorio. Se mostrar&aacute; la ubicaci&oacute;n <guilabel>Empezar aqu&iacute;</guilabel>. Haga doble clic en el objeto <guilabel>Preferencias del escritorio</guilabel> en la ventana de <application>Nautilus</application> y haga doble clic en la carpeta <guilabel>Avanzadas</guilabel>. Se mostrar&aacute;n las herramientas de preferencias <guilabel>Avanzadas</guilabel>.</para>
        <para>Haga doble clic en la herramienta que desee. Se mostrar&aacute; el cuadro de di&aacute;logo de la herramienta.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustlookandfeel-39">
    <title>Configuraci&oacute;n de una base de datos de CD</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Base de datos en CD</secondary>
    </indexterm>
    <para>La herramienta de preferencias <application>Base de datos de CD</application> permite configurar una base de datos de CD que el sistema puede consultar. Una base de datos de CD contiene informaci&oacute;n acerca de un CD, como el nombre del artista, el t&iacute;tulo y la lista de pistas. Cuando una aplicaci&oacute;n reproduzca un CD, puede consultar la base de datos y mostrar la informaci&oacute;n all&iacute; guardada. </para>
    <para>La <xref linkend="goscustlookandfeel-TBL-40"/> describe los elementos de la herramienta de preferencias <application>Base de datos de CD</application>.</para>
    <table frame="topbot" id="goscustlookandfeel-TBL-40">
      <title>Configuraci&oacute;n de la base de datos de CD</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Elemento</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Descripci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>No enviar info</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione esta opci&oacute;n para que no se env&iacute;e ninguna informaci&oacute;n al servidor de la base de datos de CD.</para>
            </entry>
          </row>
          <row>
            <entry colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Enviar info real </guilabel>
              </para>
            </entry>
            <entry colsep="0" rowsep="0" valign="top">
              <para>Seleccione esta opci&oacute;n para enviar el nombre del usuario y del sistema al servidor de la base de datos del CD.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Enviar otra info</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione esta opci&oacute;n para enviar otro nombre de usuario y de sistema al servidor de la base de datos de CD. Escriba el nombre en el campo <guilabel>Nombre</guilabel>. Escriba el nombre del sistema en el campo <guilabel>Host</guilabel>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Servidor round robin del FreeDB</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>FreeDB es una base de datos de CD. El servidor round robin del FreeDB es una configuraci&oacute;n por compartici&oacute;n de carga de servidores FreeDB. Seleccione esta opci&oacute;n para acceder a la base de datos de CD de FreeDB desde este servidor.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Otro servidor FreeDB...</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Seleccione esta opci&oacute;n para acceder a la base de datos de CD de FreeDB desde otro servidor. Elija el servidor que desee en la tabla de servidores. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Actualizar lista de servidores</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Haga clic en este bot&oacute;n para actualizar la lista de servidores FreeDB disponibles en la tabla.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Otro servidor...</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para> Seleccione esta opci&oacute;n para utilizar otra base de datos de CD. Escriba el nombre del servidor en el que reside la base de datos en el campo <guilabel>Host</guilabel>, as&iacute; como el n&uacute;mero de puerto a trav&eacute;s del cual se accede a la base de datos en el campo<guilabel> Puerto</guilabel>.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustdoc-7">
    <title>Configuraci&oacute;n de Tipos de archivos y programas</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Tipos de archivos y programas </secondary>
    </indexterm>
    <indexterm>
      <primary>tipos de archivos</primary>
      <secondary>configurar</secondary>
    </indexterm>
    <para>La herramienta de preferencias  <application>Tipos de archivos y programas</application> se utiliza para indicar c&oacute;mo se crean, muestran y editan los diferentes tipos de archivos. Por ejemplo, se puede indicar que si un archivo es de texto, el escritorio lo abra con un editor de textos. </para>
    <para><application>Nautilus</application> y otras aplicaciones de GNOME comprueban el contenido del fichero para determinar su tipo. Si las primeras l&iacute;neas no indican el tipo de archivo, entonces la aplicaci&oacute;n comprueba la extensi&oacute;n.</para>
    <para>La <xref linkend="goscustdoc-TBL-8"/> describe los elementos de la herramienta de preferencias <application>Tipos de archivos y programas</application>. </para>
    <table frame="topbot" id="goscustdoc-TBL-8">
      <title>Elementos de la herramienta de preferencias Tipos de archivos y programas</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Elemento</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Descripci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>Tabla </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para> Para ver los contenidos de una categor&iacute;a de tipos de archivo, haga clic en la flecha hacia la derecha situada junto al nombre de la categor&iacute;a. La categor&iacute;a se expandir&aacute; y mostrar&aacute; una descripci&oacute;n de cada tipo de archivo y la extensi&oacute;n asociada. </para>
              <para>Para seleccionar el tipo de archivo con el que desea trabajar, haga clic en el tipo correspondiente.</para>
            </entry>
          </row>
          <row>
            <entry colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Agregar tipo de archivo</guibutton>
              </para>
            </entry>
            <entry colsep="0" rowsep="0" valign="top">
              <para> Haga clic en este bot&oacute;n para agregar un tipo de archivo. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="goscustlookandfeel-28"/>. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Agregar servicio</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para> Haga clic en este bot&oacute;n para agregar un servicio. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="goscustlookandfeel-30"/>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Editar</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <indexterm>
                <primary>tipo de archivo</primary>
                <secondary>editar</secondary>
              </indexterm>
              <indexterm>
                <primary>servicios</primary>
                <secondary>editar</secondary>
              </indexterm>
              <para>Para editar un tipo de archivo, un servicio o una categor&iacute;a de tipo, seleccione el elemento y, a continuaci&oacute;n, haga clic en <guibutton>Editar</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Quitar</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Para quitar un tipo de archivo o un servicio, selecci&oacute;nelo y haga clic en <guibutton>Quitar</guibutton>. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <sect2 id="goscustlookandfeel-28">
      <title>Para agregar un tipo de archivo</title>
      <indexterm>
        <primary>tipos de archivo</primary>
        <secondary>agregar</secondary>
      </indexterm>
      <para>Para agregar un tipo de archivo:</para>
      <orderedlist>
        <listitem>
          <para>Seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guisubmenu>Avanzadas</guisubmenu><guimenuitem>Tipos de archivos y programas</guimenuitem></menuchoice> para iniciar la herramienta de preferencias <application>Tipos de archivos y programas</application>.</para>
        </listitem>
        <listitem>
          <para>Haga clic en el bot&oacute;n <guibutton>Agregar tipo de archivo</guibutton>. Se muestra el cuadro de di&aacute;logo <guilabel>Agregar tipo de archivo</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Introduzca las propiedades del tipo de archivo en el cuadro de di&aacute;logo. A continuaci&oacute;n se describen los elementos del cuadro de di&aacute;logo que aparecen en <guilabel>Agregar tipo de archivo</guilabel>:</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="37.42*"/>
              <colspec colname="colspec1" colwidth="62.58*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Opci&oacute;n</para>
                  </entry>
                  <entry valign="top">
                    <para>Funci&oacute;n</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Sin icono</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Elija un icono para representar el tipo de archivo. Para seleccionar un icono, haga clic en el bot&oacute;n <guibutton>Sin icono</guibutton>. Se mostrar&aacute; un selector de iconos. Seleccione el icono deseado en el cuadro de di&aacute;logo. Alternativamente, para seleccionar el icono de otro directorio, haga clic en <guibutton>Buscar</guibutton>. Cuando haya seleccionado el icono, haga clic en el bot&oacute;n <guibutton>Aceptar</guibutton>. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Descripci&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Escriba la descripci&oacute;n del tipo de archivo.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Tipo MIME</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Escriba el tipo MIME del archivo. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Categor&iacute;a</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Escriba la categor&iacute;a a la cual desea que pertenezca el tipo de archivo en la herramienta de preferencias <application>Tipos de archivos y programas</application>. Haga clic en <guibutton>Elegir...</guibutton> para elegir una categor&iacute;a en el cuadro de di&aacute;logo <guilabel>Elija una categor&iacute;a de archivo</guilabel>.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Extensiones de nombres de archivo</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Escriba las extensiones de los nombres de los archivos que asociar con el tipo de archivo. Escriba una extensi&oacute;n de nombre de archivo en el campo de la izquierda y pulse <keycap>Intro</keycap>. Para suprimir una extensi&oacute;n de nombre de archivo, selecci&oacute;nela en el campo de la derecha y haga clic en el bot&oacute;n <guibutton>Eliminar</guibutton>. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Componente de visualizaci&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Informaci&oacute;n que se suministrar&aacute; en versiones futuras. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Acci&oacute;n predeterminada</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Informaci&oacute;n que se suministrar&aacute; en versiones futuras. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Programa que se debe ejecutar</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Indique el programa que se debe asociar al tipo de archivo. Escriba el comando para iniciar el programa en este campo. Otro modo de elegir un comando previamente introducido es hacer clic en el bot&oacute;n de flecha hacia abajo y elegir el comando.</para>
                    <para>Tambi&eacute;n se puede utilizar el bot&oacute;n <guibutton>Buscar </guibutton> para elegir el comando que ejecutar. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Ejecutar en terminal</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para ejecutar el programa en una ventana de terminal. Elija esta opci&oacute;n para programas que no crean una ventana en la que ejecutarse.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Haga clic en <guibutton>Aceptar</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goscustlookandfeel-30">
      <title>Para agregar un servicio</title>
      <indexterm>
        <primary>servicios</primary>
        <secondary>agregar</secondary>
      </indexterm>
      <para>Para agregar un servicio, siga estos pasos:</para>
      <orderedlist>
        <listitem>
          <para>Seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guisubmenu>Avanzadas</guisubmenu><guimenuitem>Tipos de archivos y programas</guimenuitem></menuchoice> para iniciar la herramienta de preferencias <application>Tipos de archivos y programas</application>.</para>
        </listitem>
        <listitem>
          <para>Haga clic en el bot&oacute;n <guibutton>Agregar servicio</guibutton>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Agregar servicio</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Escriba las propiedades del servicio en el cuadro de di&aacute;logo. A continuaci&oacute;n se describen los elementos del cuadro de di&aacute;logo que aparecen en <guilabel>Agregar servicio</guilabel>:</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="41.22*"/>
              <colspec colname="colspec1" colwidth="58.78*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Opci&oacute;n</para>
                  </entry>
                  <entry valign="top">
                    <para>Funci&oacute;n</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Descripci&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Escriba la descripci&oacute;n del servicio.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Protocolo</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Escriba el protocolo del servicio.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Programa</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Indique el programa que se debe asociar al servicio. Escriba el comando para iniciar el programa en este campo. Otro modo de elegir un comando previamente introducido es hacer clic en el bot&oacute;n de flecha hacia abajo y elegir el comando.</para>
                    <para>Tambi&eacute;n se puede utilizar el bot&oacute;n <guibutton>Buscar </guibutton> para elegir el comando que ejecutar. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Ejecutar en terminal</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para ejecutar el programa en una ventana de terminal. Elija esta opci&oacute;n para programas que no crean una ventana en la que ejecutarse.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Haga clic en <guibutton>Aceptar</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-10">
    <title>Personalizaci&oacute;n de los paneles</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Panel</secondary>
    </indexterm>
    <indexterm>
      <primary>paneles</primary>
      <secondary>personalizar comportamiento y apariencia</secondary>
    </indexterm>
    <para>La herramienta de preferencias <application>Panel</application> permite configurar el comportamiento de los paneles. Todo cambio realizado en la herramienta <application>Panel</application> tiene efecto sobre todos los paneles del escritorio.</para>
    <table frame="topbot" id="goscustlookandfeel-TBL-22">
      <title>Configuraci&oacute;n de los paneles</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colwidth="50*"/>
        <colspec colwidth="50*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Valor</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Cerrar caj&oacute;n al hacer clic en el lanzador</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Seleccione esta opci&oacute;n si desea que el caj&oacute;n de un panel se cierre al seleccionar un lanzador all&iacute; contenido. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Animaci&oacute;n</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Seleccione esta opci&oacute;n si desea que los paneles aparezcan y se oculten de forma animada.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Velocidad de animaci&oacute;n</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Seleccione la velocidad de la animaci&oacute;n en el panel de las listas desplegables.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustdoc-2">
    <title>Elecci&oacute;n de las aplicaciones preferidas</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Aplicaciones preferidas </secondary>
    </indexterm>
    <indexterm>
      <primary>aplicaciones predeterminadas</primary>
      <see>aplicaciones preferidas</see>
    </indexterm>
    <para>La herramienta de preferencias <application>Aplicaciones preferidas</application> se utiliza para indicar las aplicaciones que debe usar el escritorio cuando se le pide arrancar una aplicaci&oacute;n. Por ejemplo, se puede configurar <application>Xterm</application> como la aplicaci&oacute;n de terminal preferida. Al abrir el men&uacute; <guimenu>Fondo del escritorio</guimenu> y elegir <guimenuitem>Nuevo terminal</guimenuitem>, se inicia <application>Xterm</application>.</para>
    <para>Se pueden personalizar los siguientes valores de <application>Aplicaciones preferidas</application>:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Navegador de web</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Editor de texto</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Terminal</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustlookandfeel-32">
      <title>Configuraci&oacute;n del navegador de web</title>
      <indexterm>
        <primary>Aplicaciones preferidas</primary>
        <secondary>navegador de web </secondary>
      </indexterm>
      <indexterm>
        <primary>navegador de web, aplicaci&oacute;n preferida</primary>
      </indexterm>
      <para>La secci&oacute;n con pesta&ntilde;as <application>Navegador de web</application> se utiliza para configurar el navegador de web preferido. &Eacute;ste se abrir&aacute; al hacer clic en un URL; por ejemplo, al seleccionar un URL en una aplicaci&oacute;n o un lanzador de URL en el fondo del escritorio.</para>
      <para>La <xref linkend="goscustlookandfeel-TBL-37"/> enumera los valores configurables del navegador de web preferido.</para>
      <table frame="topbot" id="goscustlookandfeel-TBL-37">
        <title>Configuraci&oacute;n del navegador de web preferido</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Seleccione un navegador de web</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n si desea usar un navegador de web est&aacute;ndar. Utilice el cuadro de combinaci&oacute;n desplegable para seleccionar el navegador de web preferido.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Navegador de web personalizado</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n si desea usar un navegador de web personalizado. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Comando </guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para> Escriba el comando que se ejecutar&aacute; para iniciar el navegador personalizado. Para que el navegador muestre el URL en el que se ha hecho clic, debe incluir  <command>&ldquo;%s&rdquo; </command> despu&eacute;s del comando.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Iniciar en una terminal</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n para ejecutar el comando en una ventana de terminal. Elija esta opci&oacute;n para navegadores que no crean una ventana en la que ejecutarse.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustlookandfeel-31">
      <title>Configuraci&oacute;n del editor de textos</title>
      <indexterm>
        <primary>Aplicaciones preferidas</primary>
        <secondary>editor de texto </secondary>
      </indexterm>
      <indexterm>
        <primary>editor de texto, aplicaci&oacute;n preferida </primary>
      </indexterm>
      <para>Use la pesta&ntilde;a <application>Editor de texto</application> para configurar el editor preferido.</para>
      <para>La <xref linkend="goscustdoc-TBL-1"/> enumera los valores configurables del editor de textos preferido.</para>
      <table frame="topbot" id="goscustdoc-TBL-1">
        <title>Configuraci&oacute;n del editor de textos preferido</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Seleccione un editor</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n si desea usar un editor est&aacute;ndar de textos. Utilice el cuadro de combinaci&oacute;n desplegable
para indicar el editor preferido.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Editor personalizado</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n si desea usar un editor de texto personalizado. Aparecer&aacute; el cuadro di&aacute;logo <guilabel>Propiedades del editor personalizado</guilabel>. </para>
                <itemizedlist>
                  <listitem>
                    <para><guilabel>Nombre</guilabel>: escriba el nombre del editor de texto personalizado.</para>
                  </listitem>
                  <listitem>
                    <para><guilabel>Comando</guilabel>: escriba el comando que se ejecutar&aacute; para iniciar el editor de textos. </para>
                  </listitem>
                  <listitem>
                    <para><guilabel>Esta aplicaci&oacute;n puede abrir m&uacute;ltiples archivos</guilabel>: seleccione esta opci&oacute;n si el editor de textos predefinido puede abrir varios archivos.</para>
                  </listitem>
                  <listitem>
                    <para><guilabel>Se debe ejecutar esta aplicaci&oacute;n en un shell</guilabel>: seleccione esta opci&oacute;n para ejecutar el comando en una ventana de terminal. Elija esta opci&oacute;n si el editor no crea una ventana en la que ejecutarse.</para>
                  </listitem>
                </itemizedlist>
                <para>Despu&eacute;s de especificar un editor de texto personalizado, haga clic en el bot&oacute;n <guibutton>Propiedades</guibutton> para abrir el cuadro de di&aacute;logo <guilabel>Propiedades del editor personalizado</guilabel>. Utilice el cuadro de di&aacute;logo para modificar las propiedades del editor de textos personalizado. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Usar este editor para abrir archivos de texto en el gestor de archivos</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Seleccione esta opci&oacute;n si desea que el administrador de archivos inicie el editor de textos personalizado para ver archivos de texto.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustlookandfeel-34">
      <title>Configuraci&oacute;n del terminal</title>
      <indexterm>
        <primary>Aplicaciones preferidas</primary>
        <secondary>terminal</secondary>
      </indexterm>
      <indexterm>
        <primary>terminal, aplicaciones preferidas</primary>
      </indexterm>
      <para>Use la pesta&ntilde;a <application>Terminal</application> para configurar el terminal preferido.</para>
      <para>La <xref linkend="goscustlookandfeel-TBL-35"/> enumera los valores configurables del terminal preferido.</para>
      <table frame="topbot" id="goscustlookandfeel-TBL-35">
        <title>Configuraci&oacute;n del terminal preferido</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Seleccione un terminal</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para> Elija esta opci&oacute;n si desea usar un terminal est&aacute;ndar. Utilice el cuadro de combinaci&oacute;n desplegable
para indicar el terminal preferido. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Terminal personalizado</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para> Seleccione esta opci&oacute;n si desea utilizar un terminal personalizado. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Comando </guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para> Escriba el comando que se ejecutar&aacute; para iniciar el terminal. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Bandera de ejecuci&oacute;n</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para> Escriba la opci&oacute;n <command>exec</command> que se debe usar con el comando.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustsession-5">
    <title>Configuraci&oacute;n de sesiones</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>Sesiones</secondary>
    </indexterm>
    <indexterm>
      <primary>sesiones</primary>
      <secondary>preferencias</secondary>
    </indexterm>
    <indexterm>
      <primary>aplicaciones de inicio</primary>
      <secondary>personalizar</secondary>
    </indexterm>
    <para>La herramienta de preferencias <application>Sesiones</application> permite gestionar las sesiones. Se pueden configurar las preferencias de cada sesi&oacute;n y las aplicaciones que se iniciar&aacute;n. Se pueden configurar las sesiones para guardar el estado de las aplicaciones en un escritorio y restaurar los valores al iniciar otra sesi&oacute;n. Tambi&eacute;n se puede utilizar esta herramienta para gestionar varias sesiones de GNOME.</para>
    <para>Se pueden configurar las sesiones en las siguientes &aacute;reas:</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Propiedades de sesi&oacute;n</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Sesi&oacute;n actual</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Programas de inicio</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustsession-16">
      <title>Configuraci&oacute;n de las propiedades de sesi&oacute;n</title>
      <indexterm>
        <primary>sesiones</primary>
        <secondary>configurar opciones</secondary>
      </indexterm>
      <para>Use la pesta&ntilde;a <guilabel>Propiedades de sesi&oacute;n</guilabel> para gestionar varias sesiones y configurar los valores de la actual. </para>
      <para>La <xref linkend="goscustsession-TBL-11"/> enumera los valores configurables de Propiedades de sesi&oacute;n.</para>
      <table frame="topbot" id="goscustsession-TBL-11">
        <title>Configuraci&oacute;n de Propiedades de sesi&oacute;n</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Mostrar pantalla incial al iniciar sesi&oacute;n</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para> Seleccione esta opci&oacute;n para ver una pantalla de presentaci&oacute;n al iniciar una sesi&oacute;n. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Preguntar al cerrar sesi&oacute;n</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para> Seleccione esta opci&oacute;n para ver un cuadro de di&aacute;logo de confirmaci&oacute;n al cerrar la sesi&oacute;n. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Guardar autom&aacute;ticamente los cambios efectuados en la sesi&oacute;n </guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <indexterm>
                  <primary>aplicaciones de inicio</primary>
                  <secondary>gestionadas por sesi&oacute;n</secondary>
                </indexterm>
                <para>Seleccione esta opci&oacute;n para que el administrador de sesiones guarde el estado actual de la sesi&oacute;n. El administrador guardar&aacute; las aplicaciones gestionadas por la sesi&oacute;n que est&aacute;n abiertas y sus valores de configuraci&oacute;n asociados. La pr&oacute;xima vez que se inicia la sesi&oacute;n, las aplicaciones se inician autom&aacute;ticamente con los valores de configuraci&oacute;n guardados.</para>
                <para>Si no se selecciona esta opci&oacute;n, al finalizar una sesi&oacute;n aparecer&aacute; el cuadro de di&aacute;logo <guilabel>Confirmar salida</guilabel> mostrando la opci&oacute;n <guilabel>Guardar configuraci&oacute;n actual</guilabel>.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Sesiones</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Use este &aacute;rea del cuadro de di&aacute;logo para gestionar varias sesiones en el escritorio:</para>
                <itemizedlist>
                  <listitem>
                    <para>Para crear una sesi&oacute;n nueva, haga clic en el bot&oacute;n <guibutton>A&ntilde;adir...</guibutton>. Aparecer&aacute; el cuadro de di&aacute;logo <guilabel>Agregar una sesi&oacute;n nueva</guilabel>. Utilice este cuadro de di&aacute;logo para indicar el nombre de la sesi&oacute;n.</para>
                  </listitem>
                  <listitem>
                    <para>Para cambiar el nombre de una sesi&oacute;n, selecci&oacute;nela en la tabla <guilabel>Elegir sesi&oacute;n actual</guilabel>. Haga clic en el bot&oacute;n <guibutton>Editar</guibutton>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Editar nombre de la sesi&oacute;n</guilabel>. Escriba un nuevo nombre para la sesi&oacute;n.</para>
                  </listitem>
                  <listitem>
                    <para>Para suprimir una sesi&oacute;n, selecci&oacute;nela en la tabla <guilabel> Elegir sesi&oacute;n actual</guilabel>. Haga clic en el bot&oacute;n <guibutton>Suprimir</guibutton>.</para>
                  </listitem>
                </itemizedlist>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustlookandfeel-27">
      <title>Configuraci&oacute;n de las Propiedades de sesi&oacute;n</title>
      <indexterm>
        <primary>aplicaciones de inicio</primary>
        <secondary>gestionadas por sesi&oacute;n </secondary>
      </indexterm>
      <indexterm>
        <primary>sesiones</primary>
        <secondary>configurar propiedades</secondary>
      </indexterm>
      <para>Use la pesta&ntilde;a <guilabel>Sesi&oacute;n actual</guilabel> para indicar los valores del orden de inicio y los estilos de reinicio de las aplicaciones gestionadas por la sesi&oacute;n actual. </para>
      <para>La <xref linkend="sessprop01"/> enumera los valores configurables de la sesi&oacute;n. </para>
      <table frame="topbot" id="sessprop01">
        <title>Propiedades de sesi&oacute;n</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Orden</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>El valor de configuraci&oacute;n <guilabel>Orden</guilabel> indica el orden en el que el administrador de sesiones inicia las aplicaciones de inicio gestionadas por sesi&oacute;n. El administrador de sesiones inicia en primer lugar las aplicaciones con los valores m&aacute;s bajos. El valor predeterminado es 50.</para>
                <para>Para especificar el orden de inicio de una aplicaci&oacute;n, selecci&oacute;nela en la tabla. Use el cuadro de desplazamiento <guilabel>Orden</guilabel> para indicar el orden de inicio.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Estilo</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>El valor de configuraci&oacute;n <guilabel>Estilo</guilabel> determina el estilo de reinicio de una aplicaci&oacute;n. Para seleccionar el estilo de reinicio, elija la aplicaci&oacute;n de la tabla y, a continuaci&oacute;n, elija uno de los siguientes estilos:</para>
                <itemizedlist>
                  <listitem>
                    <para>
                      <guilabel>Normal</guilabel>
                    </para>
                    <para>Arranca autom&aacute;ticamente al iniciar la sesi&oacute;n de GNOME. Use el comando <command>kill</command> para terminar las aplicaciones al reiniciar con este estilo.</para>
                  </listitem>
                  <listitem>
                    <para>
                      <guilabel>Reiniciar</guilabel>
                    </para>
                    <para>Reinicia autom&aacute;ticamente siempre que se cierre o termine una aplicaci&oacute;n. Se debe elegir este valor si la aplicaci&oacute;n debe ejecutarse de forma continua durante la sesi&oacute;n. Para terminar una aplicaci&oacute;n con este estilo, seleccione la aplicaci&oacute;n de la tabla y, a continuaci&oacute;n, haga clic en el bot&oacute;n <guibutton>Quitar</guibutton>.</para>
                  </listitem>
                  <listitem>
                    <para>
                      <guilabel>Papelera</guilabel>
                    </para>
                    <para>No se arranca al iniciar una sesi&oacute;n de GNOME.</para>
                  </listitem>
                  <listitem>
                    <para>
                      <guilabel>Configuraci&oacute;n</guilabel>
                    </para>
                    <para>Arranca autom&aacute;ticamente al iniciar la sesi&oacute;n. Las aplicaciones con este estilo suelen tener un orden de inicio bajo y guardan los valores de configuraci&oacute;n de GNOME y las aplicaciones gestionadas por sesi&oacute;n</para>
                  </listitem>
                </itemizedlist>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guibutton>Quitar</guibutton>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Haga clic en el bot&oacute;n <guibutton>Quitar</guibutton>  para borrar la aplicaci&oacute;n seleccionada en la lista. La aplicaci&oacute;n se elimina del administrador de sesiones y se cierra. Las aplicaciones suprimidas no se arrancar&aacute;n la pr&oacute;xima vez en que se inicie la sesi&oacute;n.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0">
                <para>
                  <guibutton>Aplicar</guibutton>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0">
                <para> Haga clic en el bot&oacute;n <guibutton>Aplicar</guibutton> para aplicar los cambios en el orden de inicio y en el estilo de reinicio.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustsession-12">
      <title>Configuraci&oacute;n de aplicaciones de inicio</title>
      <indexterm>
        <primary>aplicaciones de inicio</primary>
        <secondary>no gestionadas por sesi&oacute;n</secondary>
      </indexterm>
      <para>En la secci&oacute;n <guilabel>Programas de inicio</guilabel> de la herramienta de preferencias <application>Sesiones</application>, se pueden especificar  las <firstterm>aplicaciones de inicio</firstterm> no gestionadas por sesi&oacute;n. Las aplicaciones de inicio son aquellas que se arrancan autom&aacute;ticamente al iniciar una sesi&oacute;n. En la pesta&ntilde;a <guilabel>Programas de inicio</guilabel> se pueden indicar los comandos que ejecutan las aplicaciones no gestionadas por sesi&oacute;n. Estos comandos se ejecutan autom&aacute;ticamente al iniciar la sesi&oacute;n.</para>
      <para>Tambi&eacute;n se pueden arrancar autom&aacute;ticamente las aplicaciones gestionadas por sesi&oacute;n. Para obtener m&aacute;s informaci&oacute;n, consulte <xref linkend="goscustsession-16"/>.</para>
      <para>La <xref linkend="goscustsession-TBL-19"/> enumera los valores configurables de las aplicaciones de inicio.</para>
      <table frame="topbot" id="goscustsession-TBL-19">
        <title>Configuraci&oacute;n de Programas de inicio</title>
        <tgroup cols="2">
          <colspec colname="col1" colwidth="18.86*"/>
          <colspec colname="col2" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colname="col1" colsep="0" valign="top">
                <para>Opci&oacute;n</para>
              </entry>
              <entry colname="col2" colsep="0" valign="top">
                <para>Funci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="col1" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Programas de inicio adicionales</guilabel>
                </para>
              </entry>
              <entry colname="col2" colsep="0" rowsep="0" valign="top">
                <para>Esta tabla se utiliza para administrar las aplicaciones de inicio no gestionadas por la sesi&oacute;n seg&uacute;n se indica a continuaci&oacute;n:</para>
                <itemizedlist>
                  <listitem>
                    <para>Para a&ntilde;adir una aplicaci&oacute;n de inicio, haga clic en el bot&oacute;n <guibutton>A&ntilde;adir</guibutton>. Aparecer&aacute; el cuadro de di&aacute;logo <guilabel>A&ntilde;adir programa de inicio</guilabel>. Introduzca el comando para iniciar la aplicaci&oacute;n en el campo <guilabel>Comando de inicio</guilabel>. </para>
                    <para>Si se indica m&aacute;s de una aplicaci&oacute;n de inicio, utilice el cuadro de desplazamiento  <guilabel>Prioridad</guilabel> para indicar el orden de inicio de cada aplicaci&oacute;n. El orden de inicio es el orden predeterminado de arranque de las aplicaciones al iniciar la sesi&oacute;n.</para>
                  </listitem>
                  <listitem>
                    <para>Para editar una aplicaci&oacute;n de inicio, selecci&oacute;nela y haga clic en el bot&oacute;n <guibutton>Editar</guibutton>. Aparecer&aacute; el cuadro de di&aacute;logo <guilabel>Propiedades de sesi&oacute;n</guilabel>, donde puede modificar el comando y el orden de inicio de una aplicaci&oacute;n.</para>
                  </listitem>
                  <listitem>
                    <para>Para suprimir una aplicaci&oacute;n de inicio, selecci&oacute;nela y haga clic en el bot&oacute;n <guilabel>Borrar</guilabel>.</para>
                  </listitem>
                </itemizedlist>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
</chapter>
