<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosdeskback-1">
  <title>Uso del fondo del escritorio</title>
  <highlights>
    <para>La aplicaci&oacute;n predeterminada que gestiona el fondo del escritorio es el gestor de archivos <application>Nautilus</application>. Si no utiliza <application>Nautilus</application> para gestionar el fondo del escritorio, no lea este cap&iacute;tulo, que describe el uso de <application>Nautilus</application> para gestionar el fondo del escritorio.</para>
  </highlights>
  <sect1 id="gosdeskback-21">
    <title>Introducci&oacute;n al fondo del escritorio</title>
    <indexterm>
      <primary>fondo del escritorio</primary>
      <secondary>introducci&oacute;n</secondary>
    </indexterm>
    <para>El fondo del escritorio se sit&uacute;a detr&aacute;s del resto de componentes del escritorio. Es un componente activo de la interfaz del usuario. En &eacute;l se pueden realizar las siguientes tareas:</para>
    <itemizedlist>
      <listitem>
        <para>Iniciar las aplicaciones y abrir archivos o carpetas. </para>
        <para>Pueden a&ntilde;adirse objetos al fondo del escritorio para facilitar el acceso a los archivos, carpetas y aplicaciones que se usen frecuentemente. Por ejemplo, se puede a&ntilde;adir el lanzador de una aplicaci&oacute;n. Puede crear un enlace simb&oacute;lico a un archivo que se utilice con frecuencia y a&ntilde;adirlo al escritorio. Tambi&eacute;n pueden almacenarse archivos y carpetas.</para>
      </listitem>
      <listitem>
        <para>Abra el men&uacute; <guimenu>Fondo del escritorio</guimenu>.</para>
        <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en el fondo del escritorio para abrir el men&uacute; <guimenu>Fondo del escritorio</guimenu> que <guimenu/>permite realizar acciones en el fondo del escritorio.</para>
      </listitem>
      <listitem>
        <para>Trabajar con la <guilabel>Papelera</guilabel>.</para>
        <para>Se pueden desplazar objetos a la  <guilabel>Papelera</guilabel> y vaciarla.</para>
      </listitem>
      <listitem>
        <para>Personalizar el fondo del escritorio.</para>
        <para>Se pueden personalizar los colores del fondo del escritorio.</para>
      </listitem>
    </itemizedlist>
    <para>De manera predeterminada, el fondo del escritorio contiene tres objetos. </para>
    <para>La <xref linkend="gosdeskback-TBL-84"/> describe las funciones de los objetos predeterminados del fondo del escritorio.</para>
    <table frame="topbot" id="gosdeskback-TBL-84">
      <title>Funciones de los objetos predeterminados del fondo del escritorio</title>
      <tgroup cols="3" colsep="0" rowsep="0">
        <colspec colname="colspec2" colwidth="35.94*"/>
        <colspec colname="colspec0" colwidth="35.94*"/>
        <colspec colname="colspec1" colwidth="64.06*"/>
        <thead>
          <row rowsep="1">
            <entry colname="colspec2" valign="top">
              <para>Objeto</para>
            </entry>
            <entry valign="top">
              <para>Componente</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_home_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icono de la dirección de inicio de Nautilus.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry valign="top">
              <para>
                <guilabel> Inicio</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Abre una ventana de <application>Nautilus</application> y muestra la ubicaci&oacute;n inicial en el panel de visualizaci&oacute;n.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_starthere_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icono Empezar aquí de Nautilus.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Empezar aqu&iacute;</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Proporciona un punto de acceso a algunas de las funciones clave del escritorio de GNOME. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_overview_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icono de Información general de GNOME.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel> Informaci&oacute;n general de GNOME</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Abre una ventana del navegador de ayuda que muestra informaci&oacute;n general acerca del escritorio de GNOME.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_trash_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icono de Papelera de Nautilus.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry valign="top">
              <para>
                <guilabel>Papelera</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Abre una ventana de <application> Nautilus</application> y muestra la<guilabel> Papelera </guilabel> en el panel de visualizaci&oacute;n.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="gosdeskback-22">
    <title>Inicio del fondo del escritorio</title>
    <indexterm>
      <primary>fondo del escritorio</primary>
      <secondary>inicio</secondary>
    </indexterm>
    <para>Si <application>Nautilus</application> no gestiona el fondo del escritorio, los objetos predeterminados no aparecer&aacute;n. En ese caso, puede que sea necesario reiniciar el fondo del escritorio. Si los objetos predeterminados no aparecen en el fondo del escritorio, puede ser debido a que:</para>
    <itemizedlist>
      <listitem>
        <para>Las preferencias de <application>Nautilus</application> est&aacute;n configuradas de forma que &eacute;ste no gestiona el fondo del escritorio. Para reiniciar el fondo del escritorio, debe configurarse <application>Nautilus</application> de forma que &eacute;ste gestione el fondo del escritorio.</para>
      </listitem>
      <listitem>
        <para>Se ha cortado un proceso del fondo del escritorio inadvertidamente. Para reiniciar el fondo del escritorio, debe configurarse <application>Nautilus</application> de forma que &eacute;ste gestione el fondo del escritorio.</para>
      </listitem>
      <listitem>
        <para>Se ha eliminado el directorio <filename>/.nautilus</filename>. Para reiniciar el fondo del escritorio, debe configurarse <application>Nautilus</application> de forma que &eacute;ste gestione el fondo del escritorio. </para>
      </listitem>
    </itemizedlist>
    <para>Para configurar las preferencias de modo que <application>Nautilus</application> gestione el fondo del escritorio:</para>
    <orderedlist>
      <listitem>
        <para>Seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem>Carpeta Inicio</guimenuitem></menuchoice>. Se mostrar&aacute; la ventana de <application>Nautilus</application>. </para>
      </listitem>
      <listitem>
        <para>Seleccione <menuchoice><guimenu>Editar</guimenu><guimenuitem> Preferencias</guimenuitem></menuchoice>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Preferencias</guilabel>. Elija <guilabel>Escritorio y Papelera</guilabel> en el cuadro de di&aacute;logo <guilabel>Preferencias</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Seleccione la opci&oacute;n <guilabel>Usar Nautilus para dibujar el escritorio</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Haga clic en <guibutton>Cerrar</guibutton> para cerrar el cuadro de di&aacute;logo.</para>
      </listitem>
    </orderedlist>
    <para>Para configurar <application>Nautilus</application> de modo que gestione el fondo del escritorio:</para>
    <orderedlist>
      <listitem>
        <para>Seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem>Carpeta Inicio</guimenuitem></menuchoice>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Primera configuraci&oacute;n de Nautilus</guilabel>.</para>
      </listitem>
      <listitem>
        <para>El cuadro de di&aacute;logo <guilabel>Primera configuraci&oacute;n de Nautilus</guilabel> permite personalizar el entorno de <application>Nautilus</application>. Siga las instrucciones del cuadro de di&aacute;logo <guilabel>Primera configuraci&oacute;n de Nautilus</guilabel>. En la pantalla <guilabel>Transici&oacute;n de GMC a Nautilus</guilabel>, seleccione la opci&oacute;n <guilabel>Utilizar Nautilus para dibujar el escritorio</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Cuando llegue a la pantalla <guilabel>Finalizado</guilabel>, haga clic en el bot&oacute;n <guibutton>Finalizar</guibutton>.</para>
      </listitem>
    </orderedlist>
  </sect1>
  <sect1 id="gosdeskback-2">
    <title>Objetos del fondo del escritorio</title>
    <indexterm>
      <primary>fondo del escritorio</primary>
      <secondary>objetos del fondo del escritorio</secondary>
    </indexterm>
    <para>Un objeto del fondo del escritorio es un icono que se utiliza para abrir archivos, carpetas y aplicaciones. Todos estos objetos se encuentran en el directorio correspondiente al fondo del escritorio. Al mover objetos al fondo del escritorio, &eacute;stos se trasladan a este directorio. Se puede utilizar la carpeta de inicio como directorio del fondo del escritorio. </para>
    <para>De manera predeterminada, el fondo del escritorio contiene tres objetos. Se pueden a&ntilde;adir objetos para facilitar el acceso a los archivos, carpetas y aplicaciones que se utilizan m&aacute;s frecuentemente. Por ejemplo, se puede a&ntilde;adir una lanzadera para abrir una aplicaci&oacute;n que se usa a menudo. </para>
    <para>La <xref linkend="gosdeskback-TBL-86"/> describe los tipos de objeto que se pueden agregar al fondo del escritorio.</para>
    <table frame="topbot" id="gosdeskback-TBL-86">
      <title>Tipos de objetos del fondo del escritorio</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="30.23*"/>
        <colspec colname="colspec1" colwidth="69.77*"/>
        <thead>
          <row rowsep="1">
            <entry colname="colspec0" valign="top">
              <para>Tipo de objeto</para>
            </entry>
            <entry valign="top">
              <para>Descripci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Enlace simb&oacute;lico</para>
            </entry>
            <entry valign="top">
              <para>Un enlace simb&oacute;lico es un objeto que designa a otro fichero o carpeta. Al hacer clic en uno de estos enlaces, se abre el archivo o carpeta al cual designa. Estos enlaces pueden moverse o copiarse al fondo del escritorio.</para>
              <para>Los enlaces simb&oacute;licos se identifican f&aacute;cilmente con un emblema predefinido en forma de flecha que aparece en todos ellos. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Lanzador</para>
            </entry>
            <entry valign="top">
              <para>Se pueden a&ntilde;adir los siguientes tipos de lanzadores:</para>
              <itemizedlist>
                <listitem>
                  <para>Aplicaci&oacute;n: inicia una determinada aplicaci&oacute;n.</para>
                </listitem>
                <listitem>
                  <para>Enlace: enlaza con un archivo determinado o un URL.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Archivo</para>
            </entry>
            <entry valign="top">
              <para>Pueden a&ntilde;adirse archivos al fondo del escritorio. Los archivos del fondo del escritorio residen en el directorio del fondo del escritorio. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Carpeta </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Se pueden mover y crear carpetas en el fondo del escritorio. Las carpetas del fondo del escritorio residen en el directorio del fondo del escritorio. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Se pueden efectuar los siguientes cambios en los objetos del fondo del escritorio:</para>
    <itemizedlist>
      <listitem>
        <para>Ver las propiedades del objeto.</para>
      </listitem>
      <listitem>
        <para>Renombrar el objeto.</para>
      </listitem>
      <listitem>
        <para>Cambiar los permisos del objeto.</para>
      </listitem>
      <listitem>
        <para>Cambiar el icono que representa al objeto.</para>
      </listitem>
      <listitem>
        <para>Redimensionar el icono que representa al objeto.</para>
      </listitem>
      <listitem>
        <para>Agregar un emblema al objeto.</para>
      </listitem>
    </itemizedlist>
    <para>En las siguientes secciones se describe c&oacute;mo trabajar con los objetos del fondo del escritorio.</para>
    <sect2 id="gosdeskback-30">
      <title>Para seleccionar objetos del fondo del escritorio</title>
      <indexterm>
        <primary>fondo del escritorio</primary>
        <secondary>seleccionar objetos</secondary>
      </indexterm>
      <indexterm>
        <primary>objetos del fondo del escritorio</primary>
        <secondary>seleccionar</secondary>
      </indexterm>
      <para>Para seleccionar un objeto del fondo del escritorio, haga clic en el objeto. Para seleccionar m&uacute;ltiples objetos, mantenga pulsada la tecla <keycap> Ctrl</keycap> y, a continuaci&oacute;n, haga clic en los objetos que desea seleccionar.</para>
      <para>Se puede marcar un &aacute;rea del escritorio para seleccionar todos los objetos que est&eacute;n dentro de ella. Mantenga pulsado el bot&oacute;n izquierdo del rat&oacute;n. A continuaci&oacute;n seleccione el &aacute;rea que contiene los objetos que desea seleccionar. Al mantener pulsado el bot&oacute;n izquierdo del rat&oacute;n, aparece un rect&aacute;ngulo gris que marca el &aacute;rea de selecci&oacute;n.</para>
      <para>Para seleccionar m&uacute;ltiples &aacute;reas, mantenga pulsada la tecla <keycap>Ctrl</keycap> y, a continuaci&oacute;n, seleccione las &aacute;reas. </para>
    </sect2>
    <sect2 id="gosdeskback-29">
      <title>Para abrir un objeto del fondo del escritorio</title>
      <indexterm>
        <primary>fondo del escritorio</primary>
        <secondary>abrir objetos</secondary>
      </indexterm>
      <indexterm>
        <primary>objetos del fondo del escritorio</primary>
        <secondary>abrir</secondary>
      </indexterm>
      <para>Para abrir un objeto del fondo del escritorio, haga doble clic en el objeto. Tambi&eacute;n puede hacer clic con el bot&oacute;n derecho del rat&oacute;n en el objeto y seleccionar <guimenuitem>Abrir</guimenuitem>. Al abrir un objeto, se ejecuta la acci&oacute;n predeterminada para el objeto. Por ejemplo, si el objeto es un archivo de texto, &eacute;ste se abre en una ventana de <application>Nautilus</application>. Las acciones predeterminadas para los tipos de archivos est&aacute;n especificadas en la herramienta de preferencias de escritorio <application>Tipos de archivos y programas</application>.</para>
      <para>Para ejecutar una acci&oacute;n que no sea la predeterminada, haga clic con el bot&oacute;n derecho del rat&oacute;n y seleccione <guimenuitem>Abrir con</guimenuitem>. Elija la acci&oacute;n en el submen&uacute; <guisubmenu>Abrir con</guisubmenu>. </para>
      <para>Los elementos del submen&uacute; <guimenuitem>Abrir con</guimenuitem> se corresponden con los siguientes apartados de la herramienta de preferencias de escritorio <application>Tipos de archivos y programas</application>:</para>
      <itemizedlist>
        <listitem>
          <para>Lista desplegable <guilabel>Acci&oacute;n predeterminada</guilabel> del cuadro di&aacute;logo <guilabel>Editar tipo de archivo</guilabel></para>
        </listitem>
        <listitem>
          <para>Lista desplegable <guilabel>Componente de visualizaci&oacute;n</guilabel> del cuadro di&aacute;logo <guilabel>Editar tipo de archivo </guilabel></para>
        </listitem>
      </itemizedlist>
      <para>Pueden configurarse las preferencias en una ventana de <application>Nautilus</application> de modo que s&oacute;lo sea necesario un &uacute;nico clic para ejecutar la acci&oacute;n predeterminada.</para>
    </sect2>
    <sect2 id="gosdeskback-3">
      <title>Para agregar un lanzador al fondo del escritorio</title>
      <indexterm>
        <primary>fondo del escritorio</primary>
        <secondary>agregar lanzadores</secondary>
      </indexterm>
      <indexterm>
        <primary>objetos del fondo del escritorio</primary>
        <secondary>lanzadores</secondary>
      </indexterm>
      <para>Un lanzador en el fondo del escritorio puede iniciar una aplicaci&oacute;n o enlazar con un determinado archivo, carpeta o sitio FTP. </para>
      <para>Para agregar un lanzador al fondo del escritorio:</para>
      <orderedlist>
        <listitem>
          <para>Haga clic con el bot&oacute;n de la derecha en el fondo del escritorio y seleccione <guimenuitem>Nuevo lanzador</guimenuitem>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Crear un lanzador</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Para obtener m&aacute;s informaci&oacute;n acerca de c&oacute;mo introducir las propiedades del lanzador en el cuadro de di&aacute;logo <guilabel>Crear lanzador</guilabel>, consulte el cap&iacute;tulo <emphasis>C&oacute;mo trabajar con paneles</emphasis>. </para>
          <para>El comando que se introduzca para la lanzadera es el comando que se ejecutar&aacute; autom&aacute;ticamente al utilizar el objeto. En la siguiente tabla se muestran algunos comandos de ejemplo y las acciones que realizan.</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="47.36*"/>
              <colspec colname="colspec1" colwidth="52.64*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Comando de ejemplo</para>
                  </entry>
                  <entry valign="top">
                    <para>Acci&oacute;n</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0" valign="top">
                    <para>
                      <command>gedit</command>
                    </para>
                  </entry>
                  <entry colname="colspec1" valign="top">
                    <para>Inicia la aplicaci&oacute;n <application>gedit</application>.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <command>gedit /usuario123/miarchivo.txt</command>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Abre el archivo <filename>/usuario123/miarchivo.txt </filename> en la aplicaci&oacute;n <application>gedit</application>.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0" valign="top">
                    <para>
                      <command>nautilus /usuario123/Proyectos </command>
                    </para>
                  </entry>
                  <entry colname="colspec1" valign="top">
                    <para>Abre la carpeta <filename>/usuario123/Proyectos</filename> en una ventana de <application>Nautilus</application>.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gosdeskback-20">
      <title>Para agregar un enlace simb&oacute;lico al fondo del escritorio</title>
      <indexterm>
        <primary>fondo del escritorio</primary>
        <secondary>agregar enlaces simb&oacute;licos</secondary>
      </indexterm>
      <indexterm>
        <primary>objetos del fondo del escritorio</primary>
        <secondary>enlaces simb&oacute;licos</secondary>
      </indexterm>
      <para>Se pueden crear enlaces simb&oacute;licos en el fondo del escritorio para: </para>
      <itemizedlist>
        <listitem>
          <para>Abrir un archivo con una aplicaci&oacute;n en particular.</para>
        </listitem>
        <listitem>
          <para>Abrir una carpeta en una ventana de <application>Nautilus</application>.</para>
        </listitem>
        <listitem>
          <para>Ejecutar un archivo binario o un gui&oacute;n.</para>
        </listitem>
      </itemizedlist>
      <para>Para crear un enlace simb&oacute;lico en el fondo del escritorio:</para>
      <orderedlist>
        <listitem>
          <para>Muestre el archivo o carpeta para el cual desea crear el enlace en una ventana de <application>Nautilus</application>.</para>
        </listitem>
        <listitem>
          <para>Cree el enlace simb&oacute;lico para este archivo o carpeta. Para crear un enlace, seleccione el objeto en primer lugar. Seleccione <menuchoice><guimenu>Editar</guimenu><guimenuitem>Crear enlace</guimenuitem></menuchoice>. Se crear&aacute; un enlace para el archivo o carpeta en el directorio actual. Los enlaces simb&oacute;licos se identifican f&aacute;cilmente con un emblema predefinido en forma de flecha que aparece en todos ellos. A continuaci&oacute;n se muestra un enlace simb&oacute;lico de un archivo:</para>
          <screenshot>
            <mediaobject>
              <imageobject>
                <imagedata fileref="figures/naut_samplesymlink_icon.png" format="PNG"/>
              </imageobject>
              <textobject>
                <phrase>Icono de archivo con el emblema de enlace simbólico.</phrase>
              </textobject>
            </mediaobject>
          </screenshot>
        </listitem>
        <listitem>
          <para>Arrastre el enlace simb&oacute;lico al fondo del escritorio. El objeto se traslada al fondo del escritorio. </para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gosdeskback-16">
      <title>Agregaci&oacute;n de un archivo o carpeta al fondo del escritorio</title>
      <indexterm>
        <primary>fondo del escritorio</primary>
        <secondary>agregar archivos o carpetas</secondary>
      </indexterm>
      <indexterm>
        <primary>objetos del fondo del escritorio</primary>
        <secondary>archivos y carpetas</secondary>
      </indexterm>
      <para>A continuaci&oacute;n se muestra c&oacute;mo agregar archivos y carpetas al fondo del escritorio.</para>
      <sect3 id="gosdeskback-18">
        <title>Para mover un archivo o carpeta al fondo del escritorio</title>
        <indexterm>
          <primary>fondo del escritorio</primary>
          <secondary>mover un archivo o carpeta a</secondary>
        </indexterm>
        <para>Se puede mover un archivo o carpeta de una ventana de <application>Nautilus</application> al fondo del escritorio. Para hacerlo: </para>
        <orderedlist>
          <listitem>
            <para>Abra una ventana de <application>Nautilus</application>. </para>
          </listitem>
          <listitem>
            <para>En el panel de visualizaci&oacute;n, muestre el archivo o carpeta que desea mover.</para>
          </listitem>
          <listitem>
            <para>Arrastre el archivo o carpeta al fondo del escritorio. El icono se traslada al fondo del escritorio. El archivo o carpeta se traslada al directorio del fondo del escritorio.</para>
            <para>Tambi&eacute;n puede seleccionar el archivo o carpeta y, a continuaci&oacute;n, seleccionar <menuchoice><guimenu>Editar</guimenu><guimenuitem>Cortar archivos</guimenuitem></menuchoice>. Haga clic con el bot&oacute;n derecho del rat&oacute;n en cualquier objeto del fondo del escritorio y, a continuaci&oacute;n, escoja <guimenuitem>Pegar archivos</guimenuitem>. </para>
          </listitem>
        </orderedlist>
<!--<para><emphasis>Question</emphasis>: Do we need to document To Move a File or Folder>>From&lt;&lt; the Desktop Background? (with cut file and paste file)</para>
<para>What about Cut, Copy and Paste solely in reference to the desktop background.
Eg, to create a copy of a file by copying it from the desktop background,
then pasting it?</para>-->
      </sect3>
      <sect3 id="gosdeskback-17">
        <title>Para copiar un archivo o carpeta al fondo del escritorio</title>
        <indexterm>
          <primary>fondo del escritorio</primary>
          <secondary>copiar un archivo o carpeta a</secondary>
        </indexterm>
        <para>Se puede copiar un archivo o carpeta de una ventana de <application>Nautilus</application> al fondo del escritorio. Para copiar un archivo o carpeta al fondo del escritorio: </para>
        <orderedlist>
          <listitem>
            <para>Abra una ventana de <application>Nautilus</application>. </para>
          </listitem>
          <listitem>
            <para>En el panel de visualizaci&oacute;n, muestre el archivo o carpeta que desea mover.</para>
          </listitem>
          <listitem>
            <para>Mantenga pulsado <keycap>Ctrl</keycap> y, a continuaci&oacute;n, arrastre el archivo o carpeta al fondo del escritorio. Se crea el icono correspondiente en el fondo del escritorio. Se copia el archivo o carpeta al directorio del fondo del escritorio.</para>
            <para>Tambi&eacute;n puede seleccionar el archivo o carpeta y, a continuaci&oacute;n, seleccionar <menuchoice><guimenu>Editar</guimenu><guimenuitem>Cortar archivos</guimenuitem></menuchoice>. Haga clic con el bot&oacute;n derecho del rat&oacute;n en cualquier objeto del fondo del escritorio y, a continuaci&oacute;n, escoja <guimenuitem>Pegar archivos</guimenuitem>. </para>
          </listitem>
        </orderedlist>
      </sect3>
      <sect3 id="gosdeskback-19">
        <title>Para crear una carpeta en el fondo del escritorio</title>
        <indexterm>
          <primary>fondo del escritorio</primary>
          <secondary>crear una carpeta en</secondary>
        </indexterm>
        <para>Para crear una carpeta, haga clic con el bot&oacute;n derecho del rat&oacute;n en el fondo para abrir el men&uacute; <guimenu>Fondo del escritorio</guimenu>. Elija <guimenuitem>Nueva carpeta</guimenuitem>. Se crear&aacute; una carpeta <guilabel>sin t&iacute;tulo</guilabel>  en el fondo del escritorio. Escriba el nombre de la nueva carpeta y, a continuaci&oacute;n, pulse <keycap>Intro</keycap>. Se mostrar&aacute; la carpeta con el nuevo nombre. La nueva carpeta reside en el directorio del fondo del escritorio.</para>
      </sect3>
    </sect2>
    <sect2 id="gosdeskback-25">
      <title>Para quitar un objeto del fondo del escritorio</title>
      <indexterm>
        <primary>fondo del escritorio</primary>
        <secondary>quitar un objeto de</secondary>
      </indexterm>
      <indexterm>
        <primary>objetos del fondo del escritorio</primary>
        <secondary>quitar</secondary>
      </indexterm>
      <para>Para quitar un objeto del fondo del escritorio, haga clic con el bot&oacute;n derecho del rat&oacute;n sobre el objeto y, a continuaci&oacute;n, elija <guimenuitem>Mover a la papelera</guimenuitem>. Tambi&eacute;n puede arrastrar el objeto a la <guilabel>Papelera</guilabel>.</para>
    </sect2>
    <sect2 id="gosdeskback-86">
      <title>Para eliminar un objeto del fondo del escritorio</title>
      <indexterm>
        <primary>fondo del escritorio</primary>
        <secondary>eliminar un objeto de</secondary>
      </indexterm>
      <indexterm>
        <primary>objetos del fondo del escritorio</primary>
        <secondary>eliminar</secondary>
      </indexterm>
      <para>Cuando elimina un objeto del fondo del escritorio, no lo mueve a la <guilabel> Papelera</guilabel>, sino que lo elimina por completo. El elemento de men&uacute; <guimenuitem>Eliminar</guimenuitem> s&oacute;lo est&aacute; disponible si previamente se ha seleccionado la opci&oacute;n <guilabel>Incluir a una orden Borrar que ignore la Papelera</guilabel> en <application>Nautilus</application>, en el cuadro de di&aacute;logo <guilabel>Preferencias</guilabel>. </para>
      <para>Para eliminar un objeto del fondo del escritorio, haga clic con el bot&oacute;n derecho del rat&oacute;n sobre el objeto y, a continuaci&oacute;n, seleccione <guimenuitem>Eliminar</guimenuitem>. </para>
    </sect2>
  </sect1>
  <sect1 id="gosdeskback-8">
    <title>Uso de la papelera en el fondo del escritorio</title>
    <indexterm>
      <primary>fondo del escritorio</primary>
      <secondary>usar Papelera</secondary>
    </indexterm>
    <indexterm>
      <primary>Papelera</primary>
      <secondary>usar en fondo del escritorio</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_trash_launcher.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icono de Papelera de Nautilus.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Puede mover los siguientes elementos a la <guilabel>Papelera</guilabel>:</para>
    <itemizedlist>
      <listitem>
        <para>Archivos</para>
      </listitem>
      <listitem>
        <para>Carpetas</para>
      </listitem>
      <listitem>
        <para>Objetos del fondo del escritorio</para>
      </listitem>
    </itemizedlist>
    <para>Si desea recuperar un archivo de la  <guilabel>Papelera</guilabel>, &aacute;brala y s&aacute;quelo de ella. Al vaciar la <guilabel>Papelera</guilabel>, se eliminan permanentemente sus elementos. </para>
    <sect2 id="gosdeskback-44">
      <title>Para mostrar la Papelera</title>
      <indexterm>
        <primary>Papelera</primary>
        <secondary>mostrar</secondary>
      </indexterm>
      <para>Puede mostrar el contenido de la <guilabel>Papelera</guilabel> de las siguientes maneras:</para>
      <itemizedlist>
        <listitem>
          <para>Desde el fondo del escritorio</para>
          <para>Haga doble clic en el objeto <guilabel>Papelera</guilabel> del fondo del escritorio. El contenido de la <guilabel>Papelera</guilabel> se muestra en una ventana de <application>Nautilus</application>.</para>
        </listitem>
        <listitem>
          <para>En una ventana de <application>Nautilus</application></para>
          <para>Elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Papelera</guimenuitem></menuchoice>. El contenido de la <guilabel>Papelera</guilabel> se muestra en la ventana.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosdeskback-10">
      <title>Para vaciar la Papelera</title>
      <indexterm>
        <primary>Papelera</primary>
        <secondary>vaciar</secondary>
      </indexterm>
      <para>Puede vaciar el contenido de la <guilabel>Papelera</guilabel> de las siguientes maneras:</para>
      <itemizedlist>
        <listitem>
          <para>Desde el fondo del escritorio</para>
          <para>Haga clic con el bot&oacute;n de la derecha sobre el objeto <guilabel>Papelera</guilabel> y, a continuaci&oacute;n, <guimenuitem>Vaciar papelera</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>En una ventana de <application>Nautilus</application></para>
          <para>Elija <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Vaciar papelera</guimenuitem></menuchoice>. </para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosdeskback-9">
    <title>Uso del men&uacute; Fondo del escritorio</title>
    <indexterm>
      <primary>fondo del escritorio</primary>
      <secondary>uso del men&uacute; Fondo del escritorio</secondary>
    </indexterm>
    <indexterm>
      <primary>men&uacute; Fondo del escritorio</primary>
      <secondary>descripci&oacute;n</secondary>
    </indexterm>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>men&uacute; Fondo del escritorio</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/file_manager_menu.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Menú Fondo del escritorio. El contexto describe el gráfico.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>men&uacute; Fondo del escritorio</primary>
      <secondary>ilustraci&oacute;n</secondary>
    </indexterm>
    <para>Para abrir el men&uacute; <guimenu>Fondo del escritorio</guimenu> haga clic con el bot&oacute;n de la derecha en un sitio vac&iacute;o del escritorio. que <guimenu/>permite realizar acciones en el fondo del escritorio.</para>
    <para>La <xref linkend="gosdeskback-TBL-85"/> describe los elementos del men&uacute; <guimenu>Fondo del escritorio</guimenu>.</para>
    <table frame="topbot" id="gosdeskback-TBL-85">
      <title>Elementos del men&uacute; Fondo del escritorio</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="35.94*"/>
        <colspec colname="colspec1" colwidth="64.06*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Elemento de men&uacute;</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Nueva ventana</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Abre una ventana <application> Nautilus</application> que muestra el directorio de inicio.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nueva carpeta</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Crea una nueva carpeta en el fondo del escritorio. &Eacute;sta se crea en el directorio del fondo del escritorio.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nuevo terminal</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Inicia un <application>Terminal de GNOME</application>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nuevo lanzador</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Crea un lanzador en el fondo del escritorio. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="gosdeskback-3"/>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guisubmenu>Secuencias</guisubmenu>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Abre un submen&uacute; de secuencias que se pueden ejecutar. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Reordenar por nombre</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Ordena alfab&eacute;ticamente los objetos del fondo del escritorio.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Cortar archivos</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Elimina los objetos seleccionados de la carpeta o del fondo del escritorio y los almacena en el buffer.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Copiar archivos</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Copia los archivos seleccionados de la carpeta o fondo del escritorio y los almacena en el buffer.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Pegar archivos</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Coloca los archivos del buffer en la carpeta seleccionada o el fondo del escritorio.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Discos</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Permite montar disquetes y otros soportes extra&iacute;bles.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Cambiar fondo del escritorio</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Inicia la herramienta de preferencias de escritorio  <application>Fondo</application> para cambiar el aspecto de &eacute;ste.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Utilizar fondo predeterminado</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Restaura el fondo del escritorio al &uacute;ltimo valor escogido en el cuadro de di&aacute;logo <guilabel>Fondos y emblemas</guilabel>. Puede acceder al cuadro de di&aacute;logo <guilabel>Fondos y emblemas</guilabel> desde <application>Nautilus</application>.</para>
<!--<para><emphasis>Comment:</emphasis> It does not reset the last color that you chose from the <guilabel>Backgrounds and Emblems</guilabel> dialog.</para>-->
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="gosdeskback-12">
    <title>Cambiar el patr&oacute;n o el color del fondo del escritorio</title>
    <indexterm>
      <primary>fondo del escritorio</primary>
      <secondary>cambiar el patr&oacute;n o color</secondary>
    </indexterm>
    <indexterm>
      <primary>fondos</primary>
      <secondary>cambiar el fondo del escritorio</secondary>
    </indexterm>
    <para>Puede cambiarse el patr&oacute;n o color del fondo del escritorio seg&uacute;n las preferencias del usuario. <application>Nautilus</application> incluye patrones de fondo y colores que se pueden utilizar para cambiar la apariencia del fondo del escritorio. </para>
    <para>Se puede cambiar el patr&oacute;n o el color del fondo del escritorio de las siguientes maneras:</para>
    <itemizedlist>
      <listitem>
        <para>Arrastrando un patr&oacute;n o color de otra ventana o cuadro de di&aacute;logo al fondo del escritorio. </para>
        <para>Si el fondo del escritorio es un color, se puede crear un efecto de fundido. Un efecto de fundido es un efecto visual en el que un color se transforma gradualmente en otro. Para crearlo en el escritorio, arrastre un color diferente al del fondo a uno de los extremos de la pantalla. El color se mezclar&aacute; con el otro gradualmente, avanzando desde el lado de la pantalla en que lo haya arrastrado hasta el otro extremo.</para>
        <para>Antes de arrastrar un color a un extremo de la pantalla, compruebe si hay un panel lateral en ese lado. Si all&iacute; hubiera un panel lateral, deber&aacute; ocultarlo antes de arrastrar el color.</para>
      </listitem>
      <listitem>
        <para>Utilice la herramienta de preferencias del escritorio <application>Fondo</application>. </para>
      </listitem>
      <listitem>
        <para>Escoja un patr&oacute;n o color para el fondo en el cuadro de di&aacute;logo <guilabel>Fondos y Emblemas</guilabel>. Para cambiar el patr&oacute;n o color del fondo del escritorio:</para>
        <orderedlist>
          <listitem>
            <para>Abra una ventana de <application>Nautilus</application>.</para>
          </listitem>
          <listitem>
            <para>Elija <menuchoice><guimenu>Editar</guimenu><guimenuitem>Fondos y emblemas</guimenuitem></menuchoice>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Fondos y emblemas</guilabel>. </para>
          </listitem>
          <listitem>
            <para>Para mostrar la lista de patrones disponibles, haga clic en el bot&oacute;n <guibutton>Patrones</guibutton>. Para mostrar la lista de colores disponibles, haga clic en el bot&oacute;n <guibutton>Colores</guibutton>.</para>
          </listitem>
          <listitem>
            <para>Para que el fondo del escritorio sea a un patr&oacute;n, arrastre el patr&oacute;n al fondo. Para que el fondo del escritorio sea un color, arrastre el color al fondo. </para>
          </listitem>
          <listitem>
            <para>Haga clic en <guibutton>Cerrar</guibutton> para cerrar el cuadro de di&aacute;logo.</para>
          </listitem>
        </orderedlist>
      </listitem>
    </itemizedlist>
  </sect1>
</chapter>
