<?xml version="1.0" encoding="utf-8"?>
<chapter id="goseditmainmenu-1">
  <title>C&oacute;mo trabajar con men&uacute;s</title>
  <highlights>
    <para>En este cap&iacute;tulo se describe c&oacute;mo trabajar con los men&uacute;s en el escritorio. </para>
  </highlights>
  <sect1 id="goseditmainmenu-2">
    <title>Introducci&oacute;n a los men&uacute;s</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>introducci&oacute;n</secondary>
    </indexterm>
    <para>Se puede acceder a todas las funciones del escritorio mediante los men&uacute;s. El Panel de men&uacute; contiene men&uacute;s, de modo que se puede utilizar tanto los men&uacute;s como los paneles para realizar cualquier tarea. Se pueden tambi&eacute;n realizar diversos tipos de acciones con los men&uacute;s propios, como copiar elementos a los paneles.</para>
    <para>A trav&eacute;s del escritorio se accede a los siguientes men&uacute;s:</para>
    <itemizedlist>
      <listitem>
        <para>Men&uacute; <guimenu>Aplicaciones</guimenu>: mediante el men&uacute; <guimenu>Aplicaciones</guimenu> se puede acceder a la mayor&iacute;a de aplicaciones, comandos y opciones de configuraci&oacute;n del escritorio. Tambi&eacute;n se puede acceder a las preferencias de escritorio a trav&eacute;s del men&uacute; <guimenu>Aplicaciones</guimenu>. </para>
      </listitem>
      <listitem>
        <para>Men&uacute; <guimenu>Acciones</guimenu>: mediante el men&uacute; <guimenu>Acciones</guimenu> se puede acceder a varios comandos que permiten ejecutar tareas de escritorio. Por ejemplo, se puede iniciar la aplicaci&oacute;n <application>Herramienta de b&uacute;squeda</application> o finalizar la sesi&oacute;n. </para>
      </listitem>
      <listitem>
        <para><guimenu>Men&uacute; de GNOME</guimenu>: tambi&eacute;n se puede acceder a los elementos de los men&uacute;s <guimenu>Aplicaciones</guimenu> y <guimenu>Acciones</guimenu> desde el <guimenu>Men&uacute; de GNOME</guimenu>. Puede haber muchos botones del <guimenu>Men&uacute; de GNOME </guimenu> en los paneles. </para>
      </listitem>
    </itemizedlist>
    <para>Se puede hacer clic con el bot&oacute;n derecho en el fondo del escritorio para abrir el men&uacute; <guimenu>Fondo del escritorio</guimenu> que se utiliza para ejecutar acciones en el fondo del escritorio. </para>
    <para>Todos estos men&uacute;s proporcionan m&uacute;ltiples maneras de realizar tareas y permiten al usuario trabajar como desee.</para>
  </sect1>
  <sect1 id="goseditmainmenu-5">
    <title>Caracter&iacute;sticas de los men&uacute;s</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>caracter&iacute;sticas</secondary>
    </indexterm>
    <para>Los men&uacute;s pueden contener los siguientes elementos: </para>
    <itemizedlist>
      <listitem>
        <para>Submen&uacute;s</para>
      </listitem>
      <listitem>
        <para>Lanzadores o elementos de men&uacute;</para>
      </listitem>
    </itemizedlist>
    <para>Una flecha situada a la derecha de un elemento de men&uacute; indica que se trata de un submen&uacute;. Al apuntar al submen&uacute;, &eacute;ste se abre. Se pueden seleccionar los elementos del submen&uacute;. </para>
    <para>Al seleccionar un lanzador, &eacute;ste arranca una aplicaci&oacute;n o ejecuta un comando. Tambi&eacute;n se puede hacer clic con el bot&oacute;n derecho del rat&oacute;n sobre un lanzador para abrir un men&uacute; emergente. El men&uacute; emergente permite a&ntilde;adir el elemento al panel, as&iacute; como realizar otras tareas. Para obtener m&aacute;s informaci&oacute;n acerca del men&uacute; emergente, consulte la siguiente secci&oacute;n. </para>
    <para>La apariencia de la sesi&oacute;n configura tambi&eacute;n el aspecto de los men&uacute;s. Para cambiar la apariencia, seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guimenuitem> Tema</guimenuitem></menuchoice>.</para>
    <sect2 id="goseditmainmenu-11">
      <title>Men&uacute; emergente de elemento de men&uacute;</title>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>men&uacute; emergente de elemento de men&uacute;</secondary>
      </indexterm>
      <indexterm>
        <primary>men&uacute; emergente de elemento de men&uacute;</primary>
        <secondary>descripci&oacute;n</secondary>
      </indexterm>
      <para>Los elementos de los men&uacute;s llevan asociado un men&uacute; emergente que permite realizar las tareas relacionadas. Al hacer clic con el bot&oacute;n derecho en un elemento de un menu se abre el men&uacute; emergente asociado al mismo. El men&uacute; emergente contiene adem&aacute;s un submen&uacute; que permite realizar tareas relacionadas con el men&uacute;. </para>
      <para>El men&uacute; emergente del elemento de men&uacute; se utiliza para realizar las siguientes tareas: </para>
      <itemizedlist>
        <listitem>
          <para>Agregar elementos de men&uacute; a paneles en forma de lanzadores. </para>
        </listitem>
        <listitem>
          <para>Quitar elementos de men&uacute;s.</para>
        </listitem>
        <listitem>
          <para>Abrir el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel> con el comando elemento de men&uacute;.</para>
        </listitem>
        <listitem>
          <para>Agregar men&uacute;s a los paneles. Puede agregarse un men&uacute; como objeto de men&uacute; o como objeto caj&oacute;n. </para>
        </listitem>
        <listitem>
          <para>Agregar nuevos elementos a los men&uacute;s.</para>
        </listitem>
        <listitem>
          <para>Cambiar las propiedades de los submen&uacute;s y elementos de men&uacute;.</para>
        </listitem>
      </itemizedlist>
      <para>La <xref linkend="goseditmainmenu-FIG-39"/> muestra el men&uacute; emergente.</para>
      <indexterm>
        <primary>men&uacute; emergente de elemento de men&uacute;</primary>
        <secondary>ilustraci&oacute;n</secondary>
      </indexterm>
      <figure id="goseditmainmenu-FIG-39">
        <title>Men&uacute; emergente de elemento de men&uacute;</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/launcher_popup.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Menú emergente de elemento de menú. El contexto describe el gráfico.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>La <xref linkend="goseditmainmenu-TBL-30"/> describe los men&uacute;s emergentes de elemento de men&uacute;. <indexterm><primary>lanzadores</primary><secondary>a&ntilde;adir al panel </secondary></indexterm></para>
      <table frame="topbot" id="goseditmainmenu-TBL-30">
        <title>Men&uacute;s emergentes de elemento de men&uacute;</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="42.71*"/>
          <colspec colname="colspec1" colwidth="57.29*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Elemento</para>
              </entry>
              <entry valign="top">
                <para>Descripci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guimenuitem>A&ntilde;adir este lanzador al panel</guimenuitem>
                </para>
              </entry>
              <entry valign="top">
                <para>Agrega el lanzador al panel desde el cual se ha abierto el men&uacute;.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <guimenuitem>Quitar este elemento</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Elimina el lanzador del men&uacute;.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guimenuitem>Poner en el formulario de ejecuci&oacute;n</guimenuitem>
                </para>
              </entry>
              <entry valign="top">
                <para>Muestra el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel> con el comando del campo <guilabel>Comando</guilabel> del lanzador en el campo de comandos del cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <guimenuitem>Ayuda sobre <replaceable>nombre_aplicaci&oacute;n </replaceable></guimenuitem>
                </para>
              </entry>
              <entry colname="colspec1">
                <para> Abre la ayuda en l&iacute;nea de la aplicaci&oacute;n.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <guimenuitem>Propiedades</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Muestra un cuadro de di&aacute;logo que permite editar las propiedades del lanzador.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <menuchoice>
                    <guimenu>Men&uacute; completo</guimenu>
                    <guimenuitem>A&ntilde;adir este caj&oacute;n al panel</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para> Agrega el submen&uacute; como caj&oacute;n al panel desde el cual se ha abierto el men&uacute;.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <menuchoice>
                    <guimenu>Men&uacute; completo</guimenu>
                    <guimenuitem>A&ntilde;adir este men&uacute; al panel</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para> Agrega el submen&uacute; como objeto de men&uacute; al panel desde el cual se ha abierto el men&uacute;. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <menuchoice>
                    <guimenu>Men&uacute; completo</guimenu>
                    <guimenuitem>A&ntilde;adir este nuevo elemento a este men&uacute;</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Permite a&ntilde;adir un elemento al submen&uacute;. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <menuchoice>
                    <guimenu>Men&uacute; completo</guimenu>
                    <guimenuitem>Propiedades</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Muestra un cuadro de di&aacute;logo que permite editar las propiedades del submen&uacute;.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>a&ntilde;adir al panel</secondary>
      </indexterm>
    </sect2>
  </sect1>
  <sect1 id="goseditmainmenu-8">
    <title>Men&uacute; Aplicaciones</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>men&uacute; Aplicaciones </secondary>
    </indexterm>
    <para>El men&uacute; <guimenu>Aplicaciones</guimenu> est&aacute; formado por una jerarqu&iacute;a de submen&uacute;s, a partir de la cual se pueden iniciar las aplicaciones est&aacute;ndar de GNOME y las herramientas de preferencias. El men&uacute; <guimenu>Aplicaciones</guimenu> contiene el submen&uacute; <guimenu>Preferencias</guimenu>. Las herramientas de preferencias del escritorio se utilizan para configurar casi todas sus funciones. El men&uacute; <guimenu>Aplicaciones</guimenu> tambi&eacute;n incluye el gestor de archivos y el navegador de la ayuda.</para>
    <para>Ubicaci&oacute;n del men&uacute; <guimenu>Aplicaciones</guimenu>: </para>
    <itemizedlist>
      <listitem>
        <para>Panel de men&uacute;</para>
      </listitem>
      <listitem>
        <para><guilabel>Empezar aqu&iacute;</guilabel> en <application>Nautilus</application></para>
      </listitem>
      <listitem>
        <para>
          <guimenu>Men&uacute; de GNOME</guimenu>
        </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goseditmainmenu-51">
    <title>Men&uacute; Acciones</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>men&uacute; Acciones</secondary>
    </indexterm>
    <para>El men&uacute; <guimenu>Acciones</guimenu> contiene varios comandos que permiten ejecutar tareas de escritorio. La <xref linkend="goseditmainmenu-TBL-52"/> describe los comandos del men&uacute; <guimenu>Acciones</guimenu>.</para>
    <table frame="topbot" id="goseditmainmenu-TBL-52">
      <title>Comandos del men&uacute; Acciones </title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colwidth="38.48*"/>
        <colspec colwidth="61.52*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Elemento de men&uacute;</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Ejecutar programa</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Abre el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel>. El cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel> se utiliza para ejecutar comandos. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="gospanel-23"/>.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Buscar archivos</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Inicia la aplicaci&oacute;n <application>Herramienta de b&uacute;squeda</application>. Para obtener m&aacute;s informaci&oacute;n, consulte el manual de la <citetitle>Herramienta de b&uacute;squeda</citetitle>.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Captura de pantalla</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Realiza una captura de pantalla del escritorio y abre el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel>. El cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel> se utiliza para guardar la captura.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Bloquear la pantalla</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Bloquea la pantalla. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Terminar sesi&oacute;n</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Permite finalizar la sesi&oacute;n actual. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Ubicaci&oacute;n del men&uacute; <guimenu>Acciones</guimenu>: </para>
    <itemizedlist>
      <listitem>
        <para>Panel de men&uacute;. </para>
      </listitem>
      <listitem>
        <para><guimenu>Men&uacute; de GNOME</guimenu>. Los elementos del men&uacute; <guimenu> Acciones</guimenu> est&aacute;n situados en el nivel superior del <guimenu>Men&uacute; de GNOME</guimenu>. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gospanel-23">
      <title>Uso del cuadro de di&aacute;logo Ejecutar programa</title>
      <indexterm>
        <primary>cuadro de di&aacute;logo Ejecutar programa, uso</primary>
      </indexterm>
      <para> El cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel> proporciona acceso a la l&iacute;nea de comandos. Al ejecutar un comando en el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel>, no se recibe la salida de &eacute;ste.</para>
      <para>Para ejecutar un comando desde la l&iacute;nea de comandos efect&uacute;e los siguientes pasos: </para>
      <orderedlist>
        <listitem>
          <para>Abra el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel>. Puede abrir el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel> de diversas maneras:<itemizedlist><listitem><para>Desde el Panel de men&uacute;</para><para>Seleccione <menuchoice><guimenu>Acciones</guimenu><guimenuitem>Ejecutar programa</guimenuitem></menuchoice>.</para></listitem><listitem><para>Desde el <guimenu>Men&uacute; de GNOME</guimenu></para><para>Abra el <guimenu>Men&uacute; de GNOME</guimenu> y, a continuaci&oacute;n, seleccione <guimenuitem>Ejecutar programa</guimenuitem>.</para></listitem><listitem><para>Utilice combinaciones de teclas</para><para>La combinaci&oacute;n de teclas predeterminada para mostrar el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel> es <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo>. Esta combinaci&oacute;n se puede cambiar con la herramienta de preferencias <application>Accesos directos del teclado</application>. Para ello, seleccione <menuchoice><guimenu> Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guimenuitem>Accesos directos del teclado</guimenuitem></menuchoice>.</para></listitem><listitem><para>Desde un men&uacute; emergente de elemento de men&uacute;</para><para>Haga clic con el bot&oacute;n de la derecha del rat&oacute;n sobre un elemento del men&uacute; y, a continuaci&oacute;n, seleccione <guilabel>Poner en el formulario de ejecuci&oacute;n</guilabel> en el men&uacute; emergente. El cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel> se abrir&aacute; con el correspondiente comando.</para></listitem></itemizedlist></para>
          <para>Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Ejecutar programa</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Introduzca el comando que desea ejecutar en el campo en blanco. Para elegir un comando previamente introducido, haga clic en el bot&oacute;n de flecha hacia abajo situado junto al campo y, a continuaci&oacute;n, elija el comando que desea ejecutar.</para>
          <para>Tambi&eacute;n puede hacer clic en  el bot&oacute;n <guibutton>Aplicaciones conocidas</guibutton> para que se muestre una lista de las aplicaciones disponibles.</para>
          <para>Tambi&eacute;n se puede utilizar el bot&oacute;n <guibutton>A&ntilde;adir archivo</guibutton> para elegir un archivo que desea a&ntilde;adir a la l&iacute;nea de comandos. Por ejemplo, puede introducir <application>emacs</application> como comando y, a continuaci&oacute;n, el archivo que desea editar.</para>
          <para>Seleccione la opci&oacute;n <guilabel>Ejecutar en terminal</guilabel> para ejecutar la aplicaci&oacute;n o el comando en una ventana de terminal. Se debe seleccionar esta opci&oacute;n para el caso de aplicaciones o comandos que no crean una ventana en la que ejecutarse. </para>
        </listitem>
        <listitem>
          <para>Haga clic en el bot&oacute;n <guibutton>Ejecutar</guibutton> en el cuadro de di&aacute;logo <guilabel> Ejecutar programa</guilabel>. </para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goseditmainmenu-53">
      <title>Para hacer una captura de pantalla</title>
      <indexterm>
        <primary>capturas de pantalla, realizar</primary>
      </indexterm>
      <para>Se puede capturar la pantalla de diversas maneras:</para>
      <itemizedlist>
        <listitem>
          <para>Mediante el men&uacute; <guimenu>Acciones</guimenu></para>
          <para>Para capturar toda la pantalla, seleccione <menuchoice><guimenu> Acciones</guimenu><guimenuitem>Captura de pantalla</guimenuitem></menuchoice>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel>. Para guardar la captura, seleccione la opci&oacute;n <guilabel>Guardar captura de pantalla en archivo</guilabel>. Indique la ruta de acceso y nombre del fichero de la captura en la casilla de combinaci&oacute;n desplegable. Para grabar la captura en otro directorio, haga clic en  <guibutton>Buscar</guibutton>. Una vez haya seleccionado el directorio, haga clic en  <guibutton>Aceptar</guibutton>. </para>
          <para>Tambi&eacute;n puede guardarse la captura en el fondo del escritorio. Para grabar la captura en el fondo del escritorio, seleccione la opci&oacute;n <guilabel>Guardar captura de pantalla en escritorio</guilabel>. </para>
        </listitem>
        <listitem>
          <para>Utilice combinaciones de teclas</para>
          <para>Para hacer una captura de pantalla, se puede utilizar la siguiente combinaci&oacute;n de teclas:</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="35.67*"/>
              <colspec colname="colspec1" colwidth="64.33*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para> Combinaciones de teclas predeterminadas</para>
                  </entry>
                  <entry valign="top">
                    <para>Funci&oacute;n</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <keycap>Impr Pant</keycap>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Captura la pantalla por completo y muestra el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel>. Utilice el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel> para guardar la captura.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para><keycombo><keycap>Alt</keycap><keycap>Impr Pant</keycap></keycombo></para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Captura s&oacute;lo la ventana que est&aacute; activa y muestra el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel>. Utilice el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel> para guardar la captura. </para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
          <para>Puede utilizar la herramienta de preferencias <application>Accesos directos del teclado</application> para cambiar los valores predefinidos de las combinaciones de teclas. </para>
        </listitem>
        <listitem>
          <para>Mediante un comando</para>
          <para>Se puede utilizar el comando  <command>gnome-panel-screenshot</command> para capturar la pantalla. El comando <command>gnome-panel-screenshot</command> captura la pantalla por completo y muestra el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel>. Utilice el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel> para guardar la captura. </para>
          <para>El comando  <command>gnome-panel-screenshot</command> dispone de las siguientes opciones:  </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="35.67*"/>
              <colspec colname="colspec1" colwidth="64.33*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Opci&oacute;n</para>
                  </entry>
                  <entry valign="top">
                    <para>Funci&oacute;n</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <command>--window</command>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Captura s&oacute;lo la ventana que est&aacute; activa y muestra el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel>. Utilice el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel> para guardar la captura. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <command>--delay=<replaceable>segundos </replaceable></command>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Realiza la captura de pantalla una vez transcurridos los segundos indicados y muestra el cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel>. El cuadro de di&aacute;logo <guilabel>Captura de pantalla</guilabel> se utiliza para guardar la captura.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <command>--help</command>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Muestra las opciones del comando.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="goseditmainmenu-7">
    <title>Men&uacute; de GNOME</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>Men&uacute; de GNOME</secondary>
      <see> Men&uacute; de GNOME</see>
    </indexterm>
    <indexterm>
      <primary>Men&uacute; de GNOME</primary>
      <secondary> introducci&oacute;n</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/open_main_menu.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Menú de GNOME desplegado. Elementos del menú: Aplicaciones, Menú de CDE, Ejecutar programa, Buscar archivos, Captura de pantalla, Bloquear pantalla, Terminar sesión.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Mediante el <guimenu>Men&uacute; de GNOME</guimenu> se puede acceder a la mayor&iacute;a de aplicaciones est&aacute;ndar, comandos y opciones de configuraci&oacute;n. </para>
    <para>El <guimenu>Men&uacute; de GNOME</guimenu> contiene los siguientes men&uacute;s y elementos especiales: </para>
    <itemizedlist>
      <listitem>
        <para><guimenu>Aplicaciones</guimenu>: contiene todas las aplicaciones y herramientas de preferencias. Este men&uacute; tambi&eacute;n incluye el gestor de archivos y el navegador de ayuda.</para>
      </listitem>
      <listitem>
        <para><guimenu>Acciones</guimenu>: contiene comandos que permiten ejecutar tareas de escritorio, como <guimenuitem>Bloquear pantalla</guimenuitem> y <guimenuitem>Terminar sesi&oacute;n</guimenuitem>. Los elementos del men&uacute; <guimenu> Acciones</guimenu> est&aacute;n situados en el nivel superior del <guimenu>Men&uacute; de GNOME</guimenu>. </para>
      </listitem>
    </itemizedlist>
    <para>Pueden agregarse botones del <guimenu>Men&uacute; de GNOME</guimenu> a los paneles. De manera predeterminada, el <guimenu>Men&uacute; de GNOME</guimenu> se representa en los paneles mediante un icono con forma de huella estilizada, como se muestra a continuaci&oacute;n:</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icono del Menú de GNOME.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <sect2 id="goseditmainmenu-15">
      <title>Para abrir el Men&uacute; de GNOME</title>
      <indexterm>
        <primary>Men&uacute; de GNOME</primary>
        <secondary>abrir</secondary>
      </indexterm>
      <para>Puede abrir el <guimenu>Men&uacute; de GNOME</guimenu> de las siguientes maneras: </para>
      <itemizedlist>
        <listitem>
          <para>En un panel que tenga el <guimenu>Men&uacute; de GNOME</guimenu></para>
          <para>Haga clic en el <guimenu>Men&uacute; de GNOME</guimenu>. </para>
        </listitem>
        <listitem>
          <para>Utilice combinaciones de teclas</para>
          <para>Tambi&eacute;n puede abrir el <guimenu>Men&uacute; de GNOME</guimenu> mediante una combinaci&oacute;n de teclas. Al utilizar una combinaci&oacute;n de teclas para abrir el <guimenu>Men&uacute; de GNOME</guimenu>, aparecer&aacute; el  <guimenu> Men&uacute; de GNOME</guimenu> en el puntero del rat&oacute;n. </para>
          <para>La combinaci&oacute;n de teclas predefinida para abrir el  <guimenu>Men&uacute; de GNOME</guimenu> es <keycombo><keycap>Alt</keycap><keycap>F1</keycap></keycombo>. Para cambiar la combinaci&oacute;n de teclas que abre el <guimenu>Men&uacute; de GNOME</guimenu>, seleccione <menuchoice><guimenu> Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guimenuitem>Accesos directos de teclado</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="goseditmainmenu-29">
      <title>Para agregar un Men&uacute; de GNOME a un panel</title>
      <indexterm>
        <primary>Men&uacute; de GNOME</primary>
        <secondary>a&ntilde;adir al panel</secondary>
      </indexterm>
      <para>Se pueden a&ntilde;adir tantos botones del <guimenu>Men&uacute; de GNOME</guimenu> a los paneles como se desee. Para agregar un <guimenu>Men&uacute; de GNOME</guimenu> a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel. Seleccione <menuchoice><guimenu> A&ntilde;adir al panel</guimenu><guimenuitem>Men&uacute; de GNOME</guimenuitem></menuchoice>. </para>
    </sect2>
  </sect1>
  <sect1 id="goseditmainmenu-54">
    <title>Personalizaci&oacute;n de los men&uacute;s</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>personalizar</secondary>
    </indexterm>
    <para>Se puede modificar el contenido de los siguientes men&uacute;s:</para>
    <itemizedlist>
      <listitem>
        <para>Men&uacute; <guimenu>Aplicaciones</guimenu></para>
      </listitem>
      <listitem>
        <para>Men&uacute; <guimenu>Preferencias</guimenu></para>
      </listitem>
    </itemizedlist>
    <para>Para personalizar los men&uacute;s se puede usar los siguientes componentes del escritorio:</para>
    <itemizedlist>
      <listitem>
        <para>Men&uacute;s o paneles</para>
      </listitem>
      <listitem>
        <para>Gestor de archivos <application>Nautilus</application></para>
      </listitem>
    </itemizedlist>
    <para>Cuando se usan los paneles para personalizar los men&uacute;s, el men&uacute; emergente del elemento de men&uacute; es la herramienta apropiada. Para obtener m&aacute;s informaci&oacute;n, consulte <xref linkend="goseditmainmenu-11"/>.</para>
    <para>Si se usa  <application>Nautilus</application> para personalizar los men&uacute;s, se debe acceder a los men&uacute;s <guimenu>Aplicaciones</guimenu> o <guimenu>Preferencias</guimenu> dentro de <application>Nautilus</application>. Para acceder a los men&uacute;s <guimenu>Aplicaciones</guimenu> o <guimenu>Preferencias</guimenu>, abra una ventana de <application>Nautilus</application>. Elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute;</guimenuitem></menuchoice>. Haga doble clic en los objetos <guilabel>Aplicaciones</guilabel> o <guilabel>Preferencias</guilabel>. Para obtener m&aacute;s informaci&oacute;n sobre <application>Nautilus</application>, consulte <emphasis>Gestor de archivos Nautilus</emphasis>.</para>
    <sect2 id="goseditmainmenu-61">
      <title>Para a&ntilde;adir un men&uacute;</title>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>a&ntilde;adir</secondary>
      </indexterm>
      <para>Para agregar un men&uacute;, siga estos pasos:</para>
      <orderedlist>
        <listitem>
          <para>En la ventana de <application>Nautilus</application>, acceda a la ubicaci&oacute;n donde desea agregar el men&uacute;. Por ejemplo, para agregar un men&uacute; a <guimenu>Aplicaciones</guimenu>, elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute;</guimenuitem></menuchoice>, a continuaci&oacute;n haga doble clic en el objeto <guilabel>Aplicaciones</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Elija <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Nueva carpeta</guimenuitem></menuchoice>. Aparecer&aacute; una carpeta sin t&iacute;tulo en el panel de vista. El nombre aparecer&aacute; seleccionado.</para>
        </listitem>
        <listitem>
          <para>Escriba el nombre de la carpeta y, a continuaci&oacute;n, pulse <keycap>Intro</keycap>. </para>
        </listitem>
      </orderedlist>
      <para>La pr&oacute;xima vez que se inicie una sesi&oacute;n, el men&uacute; se encontrar&aacute; en la ubicaci&oacute;n asignada.</para>
    </sect2>
    <sect2 id="goseditmainmenu-55">
      <title>Para a&ntilde;adir un lanzador a un men&uacute;</title>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>a&ntilde;adir lanzadores a</secondary>
      </indexterm>
      <para>Para a&ntilde;adir un lanzador a un men&uacute;: </para>
      <orderedlist>
        <listitem>
          <para>Haga clic con el bot&oacute;n derecho sobre cualquier elemento en el que desee a&ntilde;adir un lanzador.</para>
        </listitem>
        <listitem>
          <para>Elija <menuchoice><guimenu>Men&uacute; completo</guimenu><guimenuitem>A&ntilde;adir nuevo elemento a este men&uacute;</guimenuitem></menuchoice>. Se mostrar&aacute; un cuadro de di&aacute;logo <guilabel>Crear un lanzador</guilabel>. </para>
        </listitem>
        <listitem>
          <para>Introduzca las propiedades del lanzador en el cuadro de di&aacute;logo. Para obtener m&aacute;s informaci&oacute;n sobre los elementos del cuadro de di&aacute;logo  <guilabel>Crear un lanzador</guilabel>, consulte  <emphasis>C&oacute;mo trabajar con paneles</emphasis>. </para>
        </listitem>
        <listitem>
          <para>Haga clic en <guibutton>Aceptar</guibutton>.</para>
        </listitem>
      </orderedlist>
      <sect3 id="goseditmainmenu-63">
        <title>Para agregar un lanzador a un men&uacute; vac&iacute;o</title>
        <para>Para agregar un lanzador a un men&uacute; vac&iacute;o:</para>
        <orderedlist>
          <listitem>
            <para>Abra la ventana de <application>Nautilus</application> y elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute;</guimenuitem></menuchoice>. Tambi&eacute;n, haga doble clic en el objeto <guilabel>Empezar aqu&iacute;</guilabel> del fondo del escritorio. Se mostrar&aacute; la ubicaci&oacute;n <guilabel>Empezar aqu&iacute;</guilabel>. </para>
          </listitem>
          <listitem>
            <para>En la ventana de <application>Nautilus</application>, haga doble clic sobre el objeto que representa el men&uacute; en el que desea a&ntilde;adir el lanzador. </para>
          </listitem>
          <listitem>
            <para>Elija <menuchoice><guimenu>Archivo</guimenu><guimenuitem>Nuevo lanzador</guimenuitem></menuchoice>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Crear un lanzador</guilabel>.</para>
          </listitem>
          <listitem>
            <para>Introduzca las propiedades del lanzador en el cuadro de di&aacute;logo. Para obtener m&aacute;s informaci&oacute;n sobre los elementos del cuadro de di&aacute;logo  <guilabel>Crear un lanzador</guilabel>, consulte  <emphasis>C&oacute;mo trabajar con paneles</emphasis>. </para>
          </listitem>
          <listitem>
            <para>Haga clic en <guibutton>Aceptar</guibutton>.</para>
          </listitem>
        </orderedlist>
      </sect3>
    </sect2>
    <sect2 id="goseditmainmenu-56">
      <title>Para copiar un lanzador en un men&uacute;</title>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>copiar lanzadores en</secondary>
      </indexterm>
      <para>Para copiar un lanzador en un men&uacute;:</para>
      <orderedlist>
        <listitem>
          <para>En la ventana de <application>Nautilus</application>, acceda a la ubicaci&oacute;n desde la que desea copiar el men&uacute;. Por ejemplo, para copiar un lanzador desde el men&uacute; <guimenu>Aplicaciones</guimenu>, elija <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute;</guimenuitem></menuchoice>, a continuaci&oacute;n haga doble clic en el objeto <guilabel>Aplicaciones</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Seleccione el lanzador que desea copiar y, a continuaci&oacute;n, <menuchoice><guimenu>Editar</guimenu><guimenuitem>Copiar archivo</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>En la ventana de <application>Nautilus</application>, acceda a la ubicaci&oacute;n desde la que desea copiar el lanzador. </para>
        </listitem>
        <listitem>
          <para>Seleccione <menuchoice><guimenu>Editar</guimenu><guimenuitem>Pegar archivos</guimenuitem></menuchoice>. Se a&ntilde;adir&aacute; el lanzador a la nueva ubicaci&oacute;n. </para>
        </listitem>
      </orderedlist>
      <para>Tambi&eacute;n puede arrastrar el lanzador de una ubicaci&oacute;n a otra. </para>
      <para>La pr&oacute;xima vez que se inicie una sesi&oacute;n, el lanzador se encontrar&aacute; en la nueva ubicaci&oacute;n.</para>
    </sect2>
    <sect2 id="goseditmainmenu-62">
      <title>Para editar las propiedades de un men&uacute;</title>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>editar propiedades</secondary>
      </indexterm>
      <para>Para editar las propiedades de un men&uacute;:</para>
      <orderedlist>
        <listitem>
          <para>Haga clic con el bot&oacute;n derecho en cualquier elemento del men&uacute; que desea editar. </para>
        </listitem>
        <listitem>
          <para>Elija <menuchoice><guimenu>Men&uacute; completo</guimenu><guimenuitem>Propiedades</guimenuitem></menuchoice>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Propiedades del lanzador</guilabel>.</para>
        </listitem>
        <listitem>
          <para>En este cuadro de di&aacute;logo puede modificar las propiedades que desee. Para obtener m&aacute;s informaci&oacute;n sobre los elementos del cuadro de di&aacute;logo  <guilabel>Propiedades del lanzador</guilabel>, consulte  <emphasis>C&oacute;mo trabajar con paneles</emphasis>. </para>
        </listitem>
        <listitem>
          <para>Haga clic en <guibutton>Aceptar</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goseditmainmenu-57">
      <title>Para editar un elemento de men&uacute;</title>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>editar elementos de men&uacute;s</secondary>
      </indexterm>
      <para>Para editar un elemento de men&uacute;:</para>
      <orderedlist>
        <listitem>
          <para>Hacer clic con el bot&oacute;n derecho en el elemento que desea editar.</para>
        </listitem>
        <listitem>
          <para>Seleccione <guimenuitem>Propiedades</guimenuitem>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Propiedades del lanzador</guilabel>.</para>
        </listitem>
        <listitem>
          <para>En este cuadro de di&aacute;logo puede modificar las propiedades que desee. Para obtener m&aacute;s informaci&oacute;n sobre los elementos del cuadro de di&aacute;logo  <guilabel>Propiedades del lanzador</guilabel>, consulte  <emphasis>C&oacute;mo trabajar con paneles</emphasis>. </para>
        </listitem>
        <listitem>
          <para>Haga clic en <guibutton>Aceptar</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goseditmainmenu-58">
      <title>Para suprimir un elemento de men&uacute;</title>
      <indexterm>
        <primary>men&uacute;s</primary>
        <secondary>suprimir elementos de men&uacute;s</secondary>
      </indexterm>
      <para>Para suprimir un elemento de men&uacute;, use el men&uacute; emergente del elemento de men&uacute;. Para suprimir un elemento de men&uacute;:</para>
      <orderedlist>
        <listitem>
          <para>Hacer clic con el bot&oacute;n derecho en el elemento que desea suprimir.</para>
        </listitem>
        <listitem>
          <para>Elija <guimenuitem>Quitar este elemento</guimenuitem>. </para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
</chapter>
