<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosoverview-1">
  <title>Visi&oacute;n general del escritorio</title>
  <highlights>
    <para>Este cap&iacute;tulo contiene informaci&oacute;n acerca de los componentes y funciones principales del escritorio de GNOME. Antes de empezar a trabajar con el escritorio, conviene leer y familiarizarse con las diversas caracter&iacute;sticas y funcionamiento de los componentes del escritorio. El escritorio ofrece muchas posibilidades de configuraci&oacute;n, as&iacute; que este cap&iacute;tulo trata s&oacute;lo de la configuraci&oacute;n predeterminada t&iacute;pica. Se tratar&aacute;n los temas siguientes: </para>
  </highlights>
  <sect1 id="gosoverview-5">
    <title>Introducci&oacute;n a los componentes del Escritorio</title>
    <indexterm>
      <primary>componentes del escritorio, introducci&oacute;n</primary>
    </indexterm>
    <para>Al iniciar por primera vez la sesi&oacute;n en el escritorio, se ver&aacute; la pantalla de arranque predeterminada, con paneles, ventanas y diversos iconos. La <xref linkend="gosoverview-FIG-1"/> muestra un escritorio t&iacute;pico. </para>
    <figure id="gosoverview-FIG-1">
      <title>Un escritorio t&iacute;pico</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/typical_anno_desktop.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Escritorio típico. Leyendas: Menú, Panel de menú, Fondo del escritorio, Ventanas, aplique Lista de ventanas, Panel del borde inferior, aplique Conmutador de áreas de trabajo.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <para>Los componentes principales del escritorio son: <itemizedlist><listitem><para>Paneles</para><para>Los paneles son &aacute;reas del escritorio en las cuales se puede acceder a todas las aplicaciones del sistema y los men&uacute;s. Los paneles ofrecen muchas posibilidades de configuraci&oacute;n. Un panel particularmente importante es el Panel de men&uacute; (<xref linkend="gosoverview-FIG-1"/>) , que ocupa el ancho del borde superior del escritorio. El Panel de men&uacute; tiene dos men&uacute;s especiales:</para><itemizedlist><listitem><para>Men&uacute; <guimenu>Aplicaciones</guimenu>: contiene todas las aplicaciones y las herramientas de preferencias. Este men&uacute; tambi&eacute;n incluye el gestor de archivos y el navegador de ayuda.</para></listitem><listitem><para>Men&uacute; <guimenu>Acciones</guimenu>: contiene varios comandos que permiten ejecutar funciones de escritorio, como <guimenuitem>Bloquear pantalla</guimenuitem> y <guimenuitem>Terminar sesi&oacute;n</guimenuitem>. </para></listitem></itemizedlist><para>Haga clic en el icono en el extremo derecho del Panel de men&uacute; para mostrar una lista de todas las ventanas abiertas.</para></listitem><listitem><para>Men&uacute;s</para><para>Se puede acceder a todas las funciones del escritorio mediante los men&uacute;s. El Panel de men&uacute; contiene men&uacute;s, de modo que se puede utilizar tanto los men&uacute;s como los paneles para realizar cualquier tarea. Los men&uacute;s <guimenu>Aplicaciones</guimenu> y <guimenu>Acciones</guimenu> se utilizan para acceder a la mayor&iacute;a de aplicaciones est&aacute;ndar, comandos y opciones de configuraci&oacute;n. </para><para>Mediante el <guimenu>Men&uacute; de GNOME</guimenu> tambi&eacute;n se puede acceder a la mayor&iacute;a de aplicaciones est&aacute;ndar, comandos y opciones de configuraci&oacute;n. Se puede acceder a los elementos de los men&uacute;s <guimenu>Aplicaciones</guimenu> y <guimenu>Acciones</guimenu> en el <guimenu>Men&uacute; de GNOME</guimenu>. Se puede agregar el <guimenu>Men&uacute; de GNOME</guimenu> a los paneles en forma de bot&oacute;n.</para></listitem><listitem><para>Ventanas</para><para>Se pueden mostrar varias ventanas al mismo tiempo y  en cada una de ellas se pueden ejecutar diferentes aplicaciones. El gestor de ventanas proporciona marcos y botones para cada ventana y permite que se ejecuten acciones est&aacute;ndar, como mover, cerrar y redimensionar ventanas. </para></listitem><listitem><para>&Aacute;reas de trabajo</para><para>El escritorio se puede subdividir en diferentes <firstterm>&aacute;reas de trabajo</firstterm>. Un &aacute;rea de trabajo es un &aacute;rea definida del escritorio en la que se trabaja. Se puede especificar el n&uacute;mero de &aacute;reas de trabajo del escritorio. Se puede cambiar a un &aacute;rea de trabajo diferente, pero s&oacute;lo puede mostrarse una cada vez por pantalla. </para></listitem><listitem><para>Gestor de archivos <application>Nautilus</application></para><para>El administrador de archivos <application>Nautilus</application> proporciona un punto de acceso integrado a los archivos y aplicaciones. Se puede visualizar el contenido de los archivos mediante una ventana de  <application>Nautilus</application> o abrir archivos con la aplicaci&oacute;n correcta desde el propio  <application>Nautilus</application>. El gestor de archivos de <application>Nautilus</application> tambi&eacute;n se utiliza para administrar los archivos y carpetas. </para></listitem><listitem><para>Fondo del escritorio</para><para>El fondo del escritorio se sit&uacute;a detr&aacute;s del resto de componentes del escritorio. Es un componente activo de la interfaz del usuario. Se puede a&ntilde;adir objetos para facilitar el acceso a los archivos, carpetas y aplicaciones que se utilizan m&aacute;s frecuentemente. Tambi&eacute;n se puede hacer clic con el bot&oacute;n derecho del rat&oacute;n sobre un lanzador para abrir un men&uacute;. </para></listitem><listitem><para>Ubicaci&oacute;n <guilabel>Empezar aqu&iacute;</guilabel></para><para><guilabel>Empezar aqu&iacute;</guilabel> es el punto de acceso a algunas de las funciones claves del escritorio de GNOME. <guilabel>Empezar aqu&iacute;</guilabel> permite acceder a las aplicaciones y herramientas de configuraci&oacute;n de GNOME. Tambi&eacute;n permite acceder a los programas que configuran el sistema como un servidor u otros valores de configuraci&oacute;n.</para></listitem><listitem><para>Preferencias</para><para>El escritorio de GNOME contiene <firstterm>herramientas de preferencias</firstterm> espec&iacute;ficas. Cada herramienta controla un aspecto particular del comportamiento del escritorio. Para iniciar una herramienta de preferencias, seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice>. Seleccione el elemento que desee configurar en los submen&uacute;s.</para></listitem></itemizedlist></para>
    <para>Las caracter&iacute;sticas m&aacute;s importantes del escritorio son su alto grado de configurabilidad y las m&uacute;ltiples maneras que ofrece para ejecutar tareas.</para>
    <para>El escritorio proporciona interoperabilidad entre sus componentes. Por lo general, una misma acci&oacute;n se puede ejecutar de m&aacute;s de una manera. Por ejemplo, se pueden iniciar aplicaciones desde paneles, men&uacute;s o el fondo del escritorio. </para>
    <para>El administrador del sistema puede realizar cambios en la configuraci&oacute;n para adaptar el sistema, con lo que el escritorio puede no ser igual al descrito en este cap&iacute;tulo. De cualquier modo, este cap&iacute;tulo proporciona una gu&iacute;a &uacute;til y r&aacute;pida de c&oacute;mo trabajar con el escritorio. </para>
  </sect1>
  <sect1 id="gosoverview-502">
    <title>Paneles</title>
    <indexterm>
      <primary>paneles</primary>
      <secondary>informaci&oacute;n general</secondary>
    </indexterm>
    <para>Se pueden a&ntilde;adir y suprimir paneles cuando se desee. Al iniciar una sesi&oacute;n por primera vez, el escritorio suele contener al menos dos paneles: </para>
    <itemizedlist>
      <listitem>
        <para>Panel de men&uacute;</para>
      </listitem>
      <listitem>
        <para>El panel de borde del fondo del escritorio</para>
      </listitem>
    </itemizedlist>
    <para>Acciones que se pueden realizar con los paneles:</para>
    <itemizedlist>
      <listitem>
        <para>Crear paneles.</para>
      </listitem>
      <listitem>
        <para>Suprimir paneles.</para>
      </listitem>
      <listitem>
        <para>Ocultar paneles.</para>
      </listitem>
      <listitem>
        <para>A&ntilde;adir objetos a los paneles.</para>
      </listitem>
      <listitem>
        <para>Manipular objetos de un panel.</para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosoverview-26">
      <title>Para crear paneles</title>
      <para>Para crear paneles: </para>
      <orderedlist>
        <listitem>
          <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en cualquier panel y, a continuaci&oacute;n, seleccione <guimenuitem>Nuevo panel</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>Seleccione el tipo de panel que desea crear en el submen&uacute;. Se a&ntilde;adir&aacute; el panel al escritorio.</para>
        </listitem>
      </orderedlist>
      <para>Se pueden crear tantos paneles como se desee. No obstante, s&oacute;lo se puede crear un Panel de men&uacute;. Pueden crearse diferentes tipos de paneles seg&uacute;n sean necesarios. Se puede personalizar el aspecto y el comportamiento de los paneles. Por ejemplo, se les puede cambiar el fondo.</para>
    </sect2>
    <sect2 id="gosoverview-508">
      <title>Para suprimir paneles</title>
      <para>Para suprimir un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n sobre &eacute;l y, a continuaci&oacute;n, seleccione <guimenuitem>Suprimir este panel</guimenuitem>.</para>
    </sect2>
    <sect2 id="gosoverview-24">
      <title>Para ocultar paneles</title>
      <para>Excepto el Panel de men&uacute; los paneles pueden tener botones de ocultaci&oacute;n a cada lado. Haciendo clic sobre ellos, se oculta o se vuelve a mostrar el panel.</para>
    </sect2>
    <sect2 id="gosoverview-4">
      <title>Para a&ntilde;adir objetos a los paneles</title>
      <para>Un panel puede contener diferentes tipos de objetos. El panel en la <xref linkend="gosoverview-FIG-28"/> contiene cada tipo de objeto de panel posible. </para>
      <figure id="gosoverview-FIG-28">
        <title>Un panel con los diferentes tipos de objetos</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/sample_anno_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Panel con diferentes tipos de objetos. Leyendas: lanzador de calculadora, Menú, aplique del lector de CD, Cajón, Bloquear la pantalla.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Puede a&ntilde;adir cualquiera de los siguientes objetos a todos los tipos de paneles:</para>
      <itemizedlist>
        <listitem>
          <para>Apliques</para>
          <indexterm>
            <primary>apliques</primary>
            <secondary>visi&oacute;n general</secondary>
          </indexterm>
          <para>Los <glossterm>apliques</glossterm> son aplicaciones, peque&ntilde;as e interactivas que residen en un panel, por ejemplo el <application>Lector de CD</application> en la <xref linkend="gosoverview-FIG-28"/>. Cada aplique dispone de una interfaz simple de usuario con la que se puede trabajar mediante el rat&oacute;n o el teclado. A continuaci&oacute;n, se muestran los apliques predeterminados en los paneles:</para>
          <itemizedlist>
            <listitem>
              <para><application>Lista de ventanas</application>: muestra un bot&oacute;n para cada ventana abierta. Se puede hacer clic en un bot&oacute;n de esta lista para minimizar y restaurar ventanas. De manera predeterminada, la <application>Lista de ventanas</application> aparece en el panel del borde inferior del escritorio.</para>
            </listitem>
            <listitem>
              <para><application>Conmutador de &aacute;reas de trabajo</application>: muestra una representaci&oacute;n visual de las &aacute;reas de trabajo. El <application>Conmutador de &aacute;reas de trabajo</application> permite cambiar entre las diferentes &aacute;reas de trabajo. De manera predeterminada, el <application>Conmutador de &aacute;reas de trabajo</application> aparece en el panel del borde inferior del escritorio.</para>
            </listitem>
          </itemizedlist>
          <para>Para a&ntilde;adir un aplique a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel y, a continuaci&oacute;n, seleccione <guimenuitem>Agregar al panel</guimenuitem>. Seleccione el aplique deseado de uno de los siguientes submen&uacute;s:</para>
          <itemizedlist>
            <listitem>
              <para>Accesorios</para>
            </listitem>
            <listitem>
              <para>Entretenimientos</para>
            </listitem>
            <listitem>
              <para>Red</para>
            </listitem>
            <listitem>
              <para>Multimedia</para>
            </listitem>
            <listitem>
              <para>Utilidad</para>
            </listitem>
          </itemizedlist>
        </listitem>
        <listitem>
          <para>Lanzadores</para>
          <para>Un <firstterm>lanzador</firstterm> inicia una aplicaci&oacute;n en particular, ejecuta un comando o abre un archivo. El icono de la calculadora (<xref linkend="gosoverview-FIG-28"/>) es un lanzador de la aplicaci&oacute;n <application>Calculadora</application>. Puede residir en un panel o en un men&uacute;. Haga clic en el lanzador para ejecutar la acci&oacute;n asociada.</para>
          <para>Se pueden crear lanzadores propios para las aplicaciones. Por ejemplo, se puede crear un lanzador para un procesador de texto usado habitualmente y situarlo en un panel para facilitar su acceso. Para a&ntilde;adir un nuevo lanzador a un panel, haga clic con el bot&oacute;n derecho en un espacio vac&iacute;o del panel y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Lanzador</guimenuitem></menuchoice>. </para>
          <para>Alternativamente, haga clic con el bot&oacute;n derecho en un espacio vac&iacute;o del panel y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Lanzador desde men&uacute;</guimenuitem></menuchoice>. Seleccione el lanzador que se debe a&ntilde;adir en los submen&uacute;s.</para>
        </listitem>
        <listitem>
          <para>Men&uacute;s</para>
          <para>Se puede acceder a todas las funciones del escritorio mediante los men&uacute;s. Los paneles predeterminados contienen men&uacute;s, de modo que se puede utilizar tanto los men&uacute;s como los paneles para realizar cualquier tarea. Para abrir un men&uacute; en un panel, haga clic en el icono que lo representa. Para abrir un men&uacute; en el Panel de men&uacute;, haga clic en el texto que lo representa. </para>
          <para>Los men&uacute;s que se a&ntilde;aden a los paneles se representan con un icono con una flecha. La flecha indica que el icono corresponde a un men&uacute;. El icono de la <xref linkend="gosoverview-FIG-28"/> es el que se muestra al a&ntilde;adir el men&uacute; <guimenuitem>Preferencias</guimenuitem> a un panel.</para>
          <para>Tambi&eacute;n se puede a&ntilde;adir el <guimenu>Men&uacute; de GNOME</guimenu> a cualquier panel. Para a&ntilde;adir el <guimenu>Men&uacute; de GNOME</guimenu> a un panel, haga clic con el bot&oacute;n derecho en un espacio vac&iacute;o y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Men&uacute; de GNOME</guimenuitem></menuchoice>.</para>
        </listitem>
        <listitem>
          <para>Cajones</para>
          <para>Los <firstterm>cajones</firstterm> son extensiones deslizantes de un panel que se pueden o abrir mediante un icono de caj&oacute;n, como se muestra en la <xref linkend="gosoverview-FIG-28"/>. Los cajones permiten organizar el trabajo al trabajar con m&uacute;ltiples aplicaciones simult&aacute;neamente. Se puede colocar los mismos elementos funcionales en un caj&oacute;n que en cualquier otro tipo de panel. </para>
          <para>Para a&ntilde;adir un caj&oacute;n a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Caj&oacute;n</guimenuitem></menuchoice>. </para>
          <para>Para abrir un caj&oacute;n, haga clic sobre &eacute;l. Para cerrarlo, vuelva a hacer clic.</para>
        </listitem>
        <listitem>
          <para>Botones <guibutton>Bloquear</guibutton> y <guibutton>Terminar sesi&oacute;n</guibutton></para>
          <para>El bot&oacute;n <guibutton>Bloquear</guibutton> permite bloquear la pantalla. El icono de un candado (<xref linkend="gosoverview-FIG-28"/>) es el bot&oacute;n Bloquear. El bot&oacute;n <guibutton>Terminar sesi&oacute;n</guibutton> permite finalizar la sesi&oacute;n. </para>
          <para>Para a&ntilde;adir botones a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel y, a continuaci&oacute;n, seleccione <guimenuitem>Agregar al panel</guimenuitem>. A continuaci&oacute;n, elija el bot&oacute;n que desee. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosoverview-21">
      <title>Para manipular objetos de un panel</title>
      <para>Se pueden manipular los objetos de un panel de las siguientes maneras:</para>
      <itemizedlist>
        <listitem>
          <para>Mover los objetos dentro del panel o a otro panel.</para>
          <para>Pueden moverse los objetos a otra ubicaci&oacute;n en el mismo panel. Tambi&eacute;n se pueden mover a otro panel. Utilice el bot&oacute;n intermedio del rat&oacute;n para arrastrar el objeto de panel a la nueva ubicaci&oacute;n.</para>
        </listitem>
        <listitem>
          <para>Copiar elementos del men&uacute; a un panel</para>
          <para>Arrastre el elemento del men&uacute; al panel. Si, en cambio,  el elemento es un lanzador, haga clic con el bot&oacute;n derecho sobre &eacute;l y, a continuaci&oacute;n, seleccione<guimenuitem> A&ntilde;adir este lanzador al panel</guimenuitem>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-42">
    <title>Men&uacute;s</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>visi&oacute;n general</secondary>
    </indexterm>
    <para>Se puede acceder a todas las funciones del escritorio mediante los men&uacute;s. Los paneles predeterminados contienen men&uacute;s, de modo que se puede utilizar tanto los men&uacute;s como los paneles para realizar cualquier tarea. El Panel de men&uacute; contiene los men&uacute;s  <guimenu>Aplicaciones</guimenu> y <guimenu> Acciones</guimenu>. Tambi&eacute;n se puede a&ntilde;adir el <guimenu>Men&uacute; de GNOME</guimenu> a cualquier panel. </para>
    <para>Los men&uacute;s <guimenu>Aplicaciones</guimenu> y <guimenu>Acciones</guimenu> se utilizan para acceder a la mayor&iacute;a de aplicaciones est&aacute;ndar, comandos y opciones de configuraci&oacute;n. Tambi&eacute;n se puede acceder a los elementos de los men&uacute;s <guimenu>Aplicaciones</guimenu> y <guimenu>Acciones</guimenu> en el <guimenu>Men&uacute; de GNOME</guimenu>. Los elementos del men&uacute; <guimenu> Acciones</guimenu> est&aacute;n situados en el nivel superior del <guimenu>Men&uacute; de GNOME</guimenu>. </para>
    <para>Para a&ntilde;adir el <guimenu>Men&uacute; de GNOME</guimenu> a un panel, haga clic con el bot&oacute;n derecho en un espacio vac&iacute;o y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Men&uacute; de GNOME</guimenuitem></menuchoice>. El <guimenu>Men&uacute; de GNOME</guimenu> se representa con una huella estilizada, como se muestra a continuaci&oacute;n:</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icono del Menú de GNOME.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Haga clic en el bot&oacute;n de <guibutton>Men&uacute; de GNOME</guibutton> en un panel para abrir el <guimenu>Men&uacute; de GNOME</guimenu>. </para>
    <para>Se pueden a&ntilde;adir tantos men&uacute;s como se desee a cualquier panel del escritorio. Para abrir un men&uacute; en un panel, haga clic en el icono que lo representa. Se puede, tambi&eacute;n, realizar diversos tipos de acciones con los propios men&uacute;s, como copiar elementos de men&uacute; a los paneles. </para>
  </sect1>
  <sect1 id="gosoverview-18">
    <title>Ventanas del escritorio</title>
    <indexterm>
      <primary>ventanas</primary>
      <secondary>visi&oacute;n general</secondary>
    </indexterm>
    <para>En el escritorio se pueden abrir diversas ventanas a la vez, Cada ventana tiene un marco que incluye los elementos de control activos que se utilizan para trabajar con ella.</para>
    <sect2 id="gosoverview-16">
      <title>Tipos de ventana</title>
      <para>El escritorio posee los siguientes tipos de ventanas:</para>
      <itemizedlist>
        <listitem>
          <para>Ventanas de aplicaci&oacute;n </para>
          <para>Al ejecutar una aplicaci&oacute;n en el escritorio, aparece en una ventana normalmente rodeada de un marco cuyo borde superior contiene una barra de t&iacute;tulos que incluye los botones que se utilizan para trabajar con la ventana. Los botones de una ventana de aplicaci&oacute;n permiten realizar acciones como abrir el <guimenu>Men&uacute; de la ventana</guimenu> o cerrar la ventana. El <guimenu>Men&uacute; de la ventana</guimenu> proporciona un determinado n&uacute;mero de acciones que se pueden ejecutar en la ventana. </para>
        </listitem>
        <listitem>
          <para>Ventanas de cuadro de di&aacute;logo</para>
          <para>Las ventanas de cuadro de di&aacute;logo se asocian con procesos interactivos del escritorio. Una ventana de cuadro de di&aacute;logo est&aacute; formada por un marco y un &uacute;nico panel interactivo que proporciona informaci&oacute;n y controles al usuario. En este manual se utiliza el cuadro de di&aacute;logo para referirse a la parte interactiva de la ventana de cuadro de di&aacute;logo. El marco de una ventana de aplicaci&oacute;n contiene botones que permiten realizar acciones como abrir el <guimenu>Men&uacute; de la ventana </guimenu> o cerrar la ventana. </para>
        </listitem>
      </itemizedlist>
<!--<para>To change the theme of your window frames, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Desktop Preferences</guisubmenu><guisubmenu>Advanced</guisubmenu><guimenuitem>FIXME</guimenuitem></menuchoice>, then choose the theme that you require. </para>-->
    </sect2>
    <sect2 id="gosoverview-32">
      <title>Para manipular ventanas</title>
      <para>El marco de una ventana de aplicaci&oacute;n o de cuadro de di&aacute;logo se utiliza para ejecutar diversas acciones sobre ella. La mayor&iacute;a de los elementos de control est&aacute;n situados en el borde superior del marco. La <xref linkend="gosoverview-FIG-33"/> muestra el borde superior del marco de una ventana t&iacute;pica de aplicaci&oacute;n.</para>
      <figure id="gosoverview-FIG-33">
        <title>Borde superior del marco de una ventana t&iacute;pica de aplicaci&oacute;n</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/titlebar_anno_window.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Borde superior de un marco de ventana de aplicación. Leyendas: botones de Menú de la ventana, Minimizar, Maximizar y Cerrar ventana; Barra de título.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Los controles activos del marco de una ventana son los siguientes: </para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="41.65*"/>
          <colspec colname="colspec1" colwidth="58.35*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Elemento de control</para>
              </entry>
              <entry valign="top">
                <para>Descripci&oacute;n </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Bot&oacute;n <guibutton>Men&uacute; de la ventana</guibutton></para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Haga clic en el bot&oacute;n <guibutton>Men&uacute; de la ventana</guibutton> para abrir el <guimenu>Men&uacute; de la ventana</guimenu>. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Barra de t&iacute;tulo</para>
              </entry>
              <entry valign="top">
                <para> Se utiliza para mover y plegar la ventana. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Bot&oacute;n <guibutton>Minimizar</guibutton></para>
              </entry>
              <entry valign="top">
                <para>Haga clic en el bot&oacute;n <guibutton>Minimizar</guibutton> para minimizar la ventana. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Bot&oacute;n <guibutton>Maximizar</guibutton></para>
              </entry>
              <entry valign="top">
                <para>El bot&oacute;n <guibutton>Maximizar</guibutton> se utiliza para maximizar y restaurar ventanas.</para>
                <para>Haga clic en el bot&oacute;n <guibutton>Maximizar</guibutton> para maximizar la ventana. Haga otra vez clic en el bot&oacute;n <guibutton>Maximizar</guibutton> para restaurar la ventana. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Bot&oacute;n <guibutton>Cerrar la ventana</guibutton></para>
              </entry>
              <entry valign="top">
                <para>Haga clic en el bot&oacute;n <guibutton>Cerrar ventana</guibutton> para cerrar la ventana. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>Borde</para>
              </entry>
              <entry colname="colspec1">
                <para>Para abrir el <guimenu>Men&uacute; de la ventana</guimenu>, haga clic con el bot&oacute;n derecho del rat&oacute;n en el borde de la ventana.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Para cambiar el tama&ntilde;o de una ventana, arrastre desde el borde pero no desde la barra de t&iacute;tulo. Arr&aacute;strela hasta obtener el tama&ntilde;o deseado. </para>
    </sect2>
    <sect2 id="gosoverview-20">
      <title>Para dirigir el foco a una ventana</title>
      <para>Las ventanas que est&aacute;n enfocadas reciben la informaci&oacute;n de entrada del rat&oacute;n y el teclado. S&oacute;lo se puede enfocar una ventana a la vez. La ventana a la cual est&aacute; dirigido el foco tiene un aspecto diferente al del resto de ventanas. </para>
      <para>Se pueden utilizar los siguientes elementos para dirigir el foco a una ventana:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="33.62*"/>
          <colspec colname="colspec1" colwidth="66.38*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Elemento</para>
              </entry>
              <entry valign="top">
                <para>Acci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Rat&oacute;n</para>
              </entry>
              <entry valign="top">
                <para> Al hacer clic en la ventana, &eacute;sta se hace visible. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Teclas de acceso directo</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Utilice las teclas de acceso directo para cambiar entre las ventanas abiertas. Para dirigir el foco a una ventana, suelte las teclas. Las teclas de acceso directo predeterminadas para cambiar entre ventanas es <keycombo><keycap>Alt</keycap><keycap> Tab</keycap></keycombo>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Lista de ventanas </application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Haga clic en el bot&oacute;n que representa la ventana en la <application>Lista de ventanas</application>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Conmutador de &aacute;reas de trabajo</application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Haga clic en la ventana a la que desea dirigir el foco en el <application>Conmutador de &aacute;reas de trabajo</application>. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-39">
    <title>&Aacute;reas de trabajo</title>
    <indexterm>
      <primary>&aacute;reas de trabajo</primary>
      <secondary>visi&oacute;n general</secondary>
    </indexterm>
    <para>En el escritorio se pueden abrir diversas ventanas a la vez, que se muestran en subdivisiones del escritorio llamadas &aacute;reas de trabajo. Un &aacute;rea de trabajo es un &aacute;rea discreta en la que se puede trabajar. </para>
    <para>Cada &aacute;rea de trabajo contiene el mismo fondo de escritorio, los mismos paneles y los mismos men&uacute;s. No obstante, se pueden ejecutar diversas aplicaciones y abrir ventanas en cada &aacute;rea de trabajo. Se puede mostrar s&oacute;lo un &aacute;rea de trabajo a la vez en el escritorio, pero pueden abrirse m&uacute;ltiples ventanas en otras &aacute;reas de trabajo. </para>
    <para>Las &aacute;reas de trabajo permiten organizar el escritorio al ejecutar m&aacute;s de una aplicaci&oacute;n simult&aacute;neamente. Al llenar el &aacute;rea de trabajo con diversas ventanas, se puede seguir trabajando en una nueva &aacute;rea. Se puede tambi&eacute;n cambiar a otra &aacute;rea de trabajo y iniciar m&aacute;s aplicaciones.</para>
    <para>Las &aacute;reas de trabajo se muestran en el aplique <application>Conmutador de &aacute;reas de trabajo</application>. En la <xref linkend="gosoverview-FIG-42"/>, el <application>Conmutador de &aacute;reas de trabajo</application> tiene cuatro &aacute;reas de trabajo. Las primeras tres contienen ventanas abiertas. La &uacute;ltima no contiene ninguna activa. </para>
    <figure id="gosoverview-FIG-42">
      <title>&Aacute;reas de trabajo que aparecen en el Conmutador de &aacute;reas de trabajo</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/workspace_switcher_applet.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Conmutador de áreas de trabajo. El contexto describe el gráfico.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <sect2 id="gosoverview-41">
      <title>Para cambiar entre &aacute;reas de trabajo</title>
      <indexterm>
        <primary>&aacute;reas de trabajo</primary>
        <secondary>cambiar entre</secondary>
      </indexterm>
      <para>Puede cambiar entre &aacute;reas de trabajo de la siguiente forma: </para>
      <itemizedlist>
        <listitem>
          <para>Haga clic en el &aacute;rea de trabajo a la que desea pasar en el <application>Conmutador de &aacute;reas de trabajo</application>.</para>
        </listitem>
        <listitem>
          <para>Presione <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap> flecha derecha </keycap></keycombo> para cambiar al &aacute;rea de trabajo situada a la derecha de la actual.</para>
        </listitem>
        <listitem>
          <para>Presione <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap> flecha izquierda </keycap></keycombo> para cambiar al &aacute;rea de trabajo situada a la izquierda de la actual.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosoverview-40">
      <title>Para agregar &aacute;reas de trabajo</title>
      <indexterm>
        <primary>&aacute;reas de trabajo</primary>
        <secondary>indicar n&uacute;mero de</secondary>
      </indexterm>
      <para>Para a&ntilde;adir &aacute;reas de trabajo al escritorio, haga clic con el bot&oacute;n de la derecha en el aplique <application>Conmutador de &aacute;reas de trabajo</application> y, a continuaci&oacute;n, seleccione <guimenuitem>Preferencias</guimenuitem>. Se mostrar&aacute; el cuadro de di&aacute;logo <guilabel>Preferencias del  conmutador de &aacute;reas de trabajo</guilabel>. Utilice el cuadro de deslizamiento <guilabel>N&uacute;mero de &aacute;reas de trabajo</guilabel> para indicar el n&uacute;mero de &aacute;reas de trabajo que se desee. </para>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-56">
    <title>Gestor de archivos Nautilus</title>
    <indexterm>
      <primary>gestor de archivos Nautilus</primary>
      <see>gestor de archivos</see>
    </indexterm>
    <indexterm>
      <primary>gestor de archivos</primary>
      <secondary>visi&oacute;n general </secondary>
    </indexterm>
    <para>El gestor de archivos <application>Nautilus</application> proporciona un punto de acceso integrado a los archivos,  aplicaciones e Internet. Para abrir una ventana de <application>Nautilus</application> , seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem>Carpeta de inicio</guimenuitem></menuchoice>. A continuaci&oacute;n se muestra un ejemplo de <application>Nautilus</application> que muestra los contenidos de una carpeta.</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_iconview_window.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Ejemplo de ventana de Nautilus. El contexto describe el gráfico.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Una ventana de <application>Nautilus</application> contiene los siguientes paneles:</para>
    <itemizedlist>
      <listitem>
        <para>Panel lateral</para>
        <para>Permite navegar entre los archivos. Este panel tambi&eacute;n muestra informaci&oacute;n acerca del fichero o carpeta actual. El panel lateral se encuentra en la parte izquierda de la ventana.</para>
      </listitem>
      <listitem>
        <para>Panel de vista</para>
        <para>Muestra el contenido de archivos y carpetas. El panel de vista se encuentra en la parte derecha de la ventana.</para>
      </listitem>
    </itemizedlist>
    <para><application>Nautilus</application> permite: </para>
    <itemizedlist>
      <listitem>
        <para>Visualizar archivos y carpetas</para>
        <para>Se pueden visualizar los archivos y carpetas como iconos o en una lista. Se pueden ver los contenidos de algunos tipos de archivos en una ventana de <application>Nautilus</application>. Estos archivos tambi&eacute;n se pueden abrir desde <application>Nautilus</application> con la aplicaci&oacute;n adecuada. </para>
      </listitem>
      <listitem>
        <para>Administrar archivos y carpetas</para>
        <para><application>Nautilus</application> se puede utilizar para crear, mover, copiar, renombrar y eliminar archivos y carpetas.</para>
      </listitem>
      <listitem>
        <para>Ejecutar secuencias</para>
        <para>Pueden ejecutarse secuencias desde <application>Nautilus</application> y se pueden seleccionar los archivos y carpetas que se deben ejecutar con ellas.</para>
      </listitem>
      <listitem>
        <para>Personalizar archivos y carpetas</para>
        <para>Se pueden a&ntilde;adir emblemas a los archivos y carpetas para indicar estados concretos. Por ejemplo, se puede a&ntilde;adir un emblema de Importante a un archivo para resaltar su importancia. Tambi&eacute;n se pueden personalizar las carpetas de las siguientes maneras: <itemizedlist><listitem><para>A&ntilde;adir una nota a una carpeta.</para></listitem><listitem><para>Especificar un patr&oacute;n de fondo personalizado.</para></listitem><listitem><para>Especificar un valor de zoom.</para></listitem></itemizedlist></para>
      </listitem>
    </itemizedlist>
    <para><application>Nautilus</application> tambi&eacute;n crea el fondo del escritorio. </para>
    <sect2 id="gosoverview-58">
      <title>Para abrir archivos en el gestor de archivos Nautilus</title>
      <para>Para navegar hasta la carpeta donde est&aacute; situado el archivo que desea abrir, haga doble clic en los iconos de las carpetas en el panel de vista. Cuando lo encuentre, haga doble clic en el icono del archivo para abrirlo. </para>
    </sect2>
    <sect2 id="gosoverview-57">
      <title>Para mover archivos entre carpetas</title>
      <para>Se pueden mover archivos entre diferentes carpetas abriendo dos o m&aacute;s ventanas de <application>Nautilus</application>. Abra una carpeta diferente en cada ventana y arrastre los archivos de una carpeta a otra. </para>
    </sect2>
  </sect1>
  <sect1 id="gosgetstarted-11">
    <title>Fondo del escritorio</title>
    <indexterm>
      <primary>Fondo del escritorio de Nautilus </primary>
      <see>fondo del escritorio </see>
    </indexterm>
    <indexterm>
      <primary>fondo del escritorio</primary>
      <secondary>visi&oacute;n general</secondary>
    </indexterm>
    <para>El fondo del escritorio es un componente activo del escritorio. Usos del fondo del escritorio:</para>
    <itemizedlist>
      <listitem>
        <para>Iniciar las aplicaciones y abrir archivos o carpetas. </para>
        <para>Pueden a&ntilde;adirse objetos al fondo del escritorio para facilitar el acceso a los archivos, carpetas y aplicaciones que se usen frecuentemente. Por ejemplo, se puede a&ntilde;adir el lanzador de una aplicaci&oacute;n que se usa habitualmente</para>
      </listitem>
      <listitem>
        <para>Abra el men&uacute; <guimenu>Fondo del escritorio</guimenu>.</para>
        <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en el fondo del escritorio para abrir el men&uacute; <guimenu>Fondo del escritorio</guimenu> que <guimenu/>permite realizar acciones en el fondo del escritorio.</para>
      </listitem>
    </itemizedlist>
    <para>El gestor de archivos <application>Nautilus</application> administra el fondo del escritorio.</para>
    <sect2 id="gosoverview-29">
      <title>Para abrir objetos del fondo del escritorio</title>
      <para>Para abrir un objeto del fondo del escritorio, haga doble clic en el objeto. Pueden configurarse las preferencias en una ventana de <application>Nautilus</application> de modo que s&oacute;lo sea necesario un &uacute;nico clic sobre un objeto para ejecutar la acci&oacute;n predeterminada.</para>
    </sect2>
    <sect2 id="gosoverview-19">
      <title>Para a&ntilde;adir un objeto al fondo del escritorio</title>
      <para>Pueden a&ntilde;adirse objetos al fondo del escritorio para facilitar el acceso a los archivos, carpetas y aplicaciones que se usen frecuentemente. Maneras de a&ntilde;adir objetos al fondo del escritorio:</para>
      <itemizedlist>
        <listitem>
          <para>Utilice el men&uacute; <guimenu>Fondo de escritorio </guimenu> para a&ntilde;adir un lanzador al fondo del escritorio.</para>
        </listitem>
        <listitem>
          <para>Arrastre un objeto de una ventana del gestor de archivos al fondo del escritorio. Por ejemplo, puede crear un enlace simb&oacute;lico a un archivo que se utilice con frecuencia y a&ntilde;adirlo al fondo del escritorio. El icono del enlace se mueve al fondo del escritorio. Para abrir el archivo, haga doble clic sobre &eacute;l. Tambi&eacute;n se pueden arrastrar archivos y carpetas al fondo del escritorio. </para>
        </listitem>
        <listitem>
          <para>Arrastre un lanzador de aplicaci&oacute;n de un men&uacute; al fondo del escritorio. Por ejemplo, se puede abrir un men&uacute; que contenga un lanzador de una aplicaci&oacute;n utilizada habitualmente y arrastrarlo al fondo del escritorio. </para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-509">
    <title>La ubicaci&oacute;n Empezar aqu&iacute;</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_starthere_launcher.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icono Empezar aquí.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>ubicaci&oacute;n Empezar aqu&iacute; </primary>
      <secondary>visi&oacute;n general</secondary>
    </indexterm>
    <indexterm>
      <primary>gestor de archivos</primary>
      <secondary>ubicaci&oacute;n Empezar aqu&iacute; </secondary>
      <see>ubicaci&oacute;n Empezar aqu&iacute; </see>
    </indexterm>
    <para>La ubicaci&oacute;n <guilabel> Empezar aqu&iacute;</guilabel> proporciona acceso a las siguientes funciones del escritorio: </para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Aplicaciones</guilabel>
        </para>
        <para>Haga doble clic en <guilabel>Aplicaciones</guilabel> para acceder a las aplicaciones clave de GNOME. Tambi&eacute;n se puede acceder al men&uacute; <guimenu>Aplicaciones</guimenu> a trav&eacute;s del <guimenu>Men&uacute; de GNOME</guimenu> y del Panel de men&uacute;.</para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Preferencias</guilabel>
        </para>
        <para>Haga doble clic en <guilabel>Preferencias</guilabel> para personalizar el escritorio. </para>
      </listitem>
      <listitem>
        <para>Tambi&eacute;n permite acceder a los programas que configuran el sistema como servidor u otros valores de configuraci&oacute;n.</para>
      </listitem>
    </itemizedlist>
    <para>Puede acceder a <guilabel>Empezar aqu&iacute;</guilabel> como sigue:</para>
    <itemizedlist>
      <listitem>
        <para>En una ventana de <application>Nautilus</application></para>
        <para>Seleccione <menuchoice><guimenu>Ir a</guimenu><guimenuitem>Empezar aqu&iacute; </guimenuitem></menuchoice>. Se mostrar&aacute;n los contenidos de la ubicaci&oacute;n <guilabel>Empezar aqu&iacute;</guilabel> en la ventana.</para>
      </listitem>
      <listitem>
        <para>Desde el fondo del escritorio</para>
        <para>Haga doble clic en el objeto <guilabel>Empezar aqu&iacute;</guilabel> del fondo del escritorio. Se mostrar&aacute;n los contenidos de la ubicaci&oacute;n <guilabel>Empezar aqu&iacute;</guilabel> en una ventana de <application>Nautilus</application>.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-55">
    <title>Preferencias</title>
    <indexterm>
      <primary>herramientas de preferencias</primary>
      <secondary>visi&oacute;n general</secondary>
    </indexterm>
    <para>Las herramientas de preferencias del escritorio se utilizan para configurar casi todas sus funciones. Cada herramienta controla un aspecto particular del comportamiento del escritorio. Por ejemplo, se puede utilizar una de estas herramientas para seleccionar un tema de escritorio. Un <firstterm>tema</firstterm> es un conjunto de valores coordinados que configuran el aspecto visual de la interfaz. </para>
    <para>Para mayor comodidad, estas herramientas se agrupan como: </para>
    <itemizedlist>
      <listitem>
        <para>B&aacute;sicas</para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Accesibilidad</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Avanzadas</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <para>Las herramientas de preferencias del escritorio se pueden abrir de diversas maneras:</para>
    <itemizedlist>
      <listitem>
        <para>Seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice>. Seleccione la herramienta que necesite en el submen&uacute; </para>
      </listitem>
      <listitem>
        <para>Haga doble clic en el objeto <guilabel>Empezar aqu&iacute;</guilabel> del fondo del escritorio. Se abrir&aacute; una ventana de <application>Nautilus</application> que mostrar&aacute; el contenido de <guilabel>Empezar aqu&iacute;</guilabel>. Haga doble clic en el objeto <guilabel>Preferencias</guilabel> en la ventana <application>Nautilus</application> para ver las herramientas de preferencias. Haga doble clic en el elemento que desee. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-54">
    <title>Aplicaciones</title>
    <indexterm>
      <primary>aplicaciones</primary>
      <secondary>visi&oacute;n general</secondary>
    </indexterm>
    <para>Las aplicaciones suministradas con el escritorio de GNOME comparten diversas caracter&iacute;sticas. Por ejemplo, las aplicaciones tienen un aspecto similar. Las caracter&iacute;sticas son iguales porque se comparten las mismas bibliotecas de programaci&oacute;n. Una aplicaci&oacute;n que utiliza las bibliotecas est&aacute;ndar de GNOME se llama <firstterm>aplicaci&oacute;n compatible con GNOME</firstterm>. Por ejemplo, <application>Nautilus</application> y el editor de texto <application>gedit</application> son aplicaciones compatibles con GNOME.</para>
    <para>GNOME suministra librer&iacute;as propias, adem&aacute;s de las del sistema operativo, que permiten a GNOME ejecutar las aplicaciones ya existentes y, adem&aacute;s, las compatibles con GNOME. Por ejemplo, si el sistema operativo del sistema est&aacute; basado en UNIX, pueden ejecutarse las aplicaciones X11 y Motif en el escritorio de GNOME.</para>
    <para>Algunas caracter&iacute;sticas de las aplicaciones compatibles con GNOME son las siguientes: </para>
    <itemizedlist>
      <listitem>
        <para>Aspecto coherente</para>
        <para>Las aplicaciones compatibles con GNOME tienen un aspecto similar, ya que utilizan el del tema seleccionado en las herramientas de preferencias del escritorio. Para cambiar el aspecto de las aplicaciones compatibles con GNOME:<itemizedlist><listitem><para><menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu> Preferencias</guisubmenu><guimenuitem>Men&uacute;s y barras de herramientas </guimenuitem></menuchoice></para></listitem><listitem><para><menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu> Preferencias</guisubmenu><guimenuitem>Tema</guimenuitem></menuchoice></para></listitem></itemizedlist></para>
      </listitem>
      <listitem>
        <para>Barras de men&uacute;, de herramientas y de estado.</para>
        <para>La mayor&iacute;a de las aplicaciones compatibles con GNOME poseen una barra de men&uacute;, una de herramientas y una de estado. La barra de men&uacute; siempre contiene un men&uacute; <guimenu>Archivo</guimenu> y uno de <guimenu> Ayuda</guimenu>. El men&uacute; <guimenu>Archivo</guimenu> siempre contiene el elemento <guimenuitem>Salir</guimenuitem> y el de <guimenu>Ayuda</guimenu> siempre contiene el elemento <guimenuitem>Acerca de</guimenuitem>.</para>
        <para>La <firstterm>barra de herramientas</firstterm> es una barra que aparece debajo de la de men&uacute;; contiene los botones de los comandos utilizados habitualmente. La <firstterm>barra de estado</firstterm> est&aacute; situada en la parte inferior de una aplicaci&oacute;n y muestra el estado de lo que se ve en la ventana. Las aplicaciones compatibles con GNOME pueden tener otras barras. Por ejemplo, <application>Nautilus </application> contiene una barra de ubicaci&oacute;n.</para>
        <para>Algunas barras de las aplicaciones compatibles con GNOME se pueden quitar. Esto es, la barra tiene un asa que se puede agarrar para poder arrastrarla a otra ubicaci&oacute;n. Puede arrastrarse esta barra para situarla en otra parte de la ventana o del escritorio. Por ejemplo, las barras de men&uacute;, herramientas y direcci&oacute;n del gestor de archivos <application>Nautilus</application> se pueden quitar. </para>
      </listitem>
      <listitem>
        <para>Combinaciones de teclas predeterminadas</para>
        <para>Las aplicaciones compatibles con GNOME utilizan una misma combinaci&oacute;n de teclas para realizar una misma acci&oacute;n. Por ejemplo, para salir de una aplicaci&oacute;n compatible con GNOME, pulse <keycombo><keycap>Ctrl</keycap><keycap>Q</keycap></keycombo>. Para deshacer una acci&oacute;n, pulse <keycombo><keycap>Ctrl</keycap><keycap>Z</keycap></keycombo>. </para>
      </listitem>
      <listitem>
        <para>Arrastrar y soltar</para>
        <para>Las aplicaciones compatibles con GNOME utilizan el mismo protocolo para implementar las operaciones de arrastrar y soltar. Por tanto, las aplicaciones compatibles con GNOME proporcionan una respuesta similar al arrastrar y soltar elementos.</para>
        <para>Al utilizar el mismo protocolo, las aplicaciones compatibles con GNOME poseen un alto grado de interoperabilidad. Por ejemplo, las aplicaciones compatibles con GNOME reconocen el formato de los elementos arrastrados. Al arrastrar un archivo HTML de una ventana de  <application>Nautilus</application> a un navegador, el archivo se visualiza en el formato HTML. No obstante, al arrastrar el mismo archivo a un editor de texto, &eacute;ste se mostrar&aacute; en formato de texto plano. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-12">
    <title>Para profundizar m&aacute;s</title>
    <indexterm>
      <primary>ayuda</primary>
      <secondary>c&oacute;mo encontrar</secondary>
    </indexterm>
    <para>El escritorio ofrece ayuda adicional si desea ampliar sus conocimientos acerca de las &aacute;reas siguientes: </para>
    <itemizedlist>
      <listitem>
        <para>Temas de ayuda del escritorio</para>
      </listitem>
      <listitem>
        <para>Apliques</para>
      </listitem>
      <listitem>
        <para>Aplicaciones</para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosoverview-31">
      <title>Para profundizar m&aacute;s acerca de los temas de ayuda del escritorio</title>
      <indexterm>
        <primary>ayuda</primary>
        <secondary>iniciar el sistema de ayuda</secondary>
      </indexterm>
      <indexterm>
        <primary>ayuda</primary>
        <secondary>temas de ayuda del escritorio</secondary>
      </indexterm>
      <para>Puede profundizar m&aacute;s acerca de un tema de ayuda del escritorio en el sistema de ayuda integrado <application>Yelp</application>. Para iniciar el sistema de ayuda <application> Yelp</application>, seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem>Ayuda</guimenuitem></menuchoice>. </para>
    </sect2>
    <sect2 id="gosgetstarted-33">
      <title>Para profundizar m&aacute;s acerca de los apliques</title>
      <indexterm>
        <primary>apliques</primary>
        <secondary>obtener ayuda</secondary>
      </indexterm>
      <indexterm>
        <primary>ayuda</primary>
        <secondary>apliques</secondary>
      </indexterm>
      <para>Para profundizar m&aacute;s acerca de un aplique, haga clic con el bot&oacute;n derecho sobre &eacute;l y, a continuaci&oacute;n, seleccione <guimenuitem>Ayuda</guimenuitem>. </para>
    </sect2>
    <sect2 id="gosgetstarted-35">
      <title>Para profundizar m&aacute;s acerca de las aplicaciones</title>
      <indexterm>
        <primary>aplicaciones</primary>
        <secondary>ayuda</secondary>
      </indexterm>
      <indexterm>
        <primary>ayuda</primary>
        <secondary>aplicaciones</secondary>
      </indexterm>
      <para>Para profundizar m&aacute;s acerca de una aplicaci&oacute;n espec&iacute;fica, inicie la aplicaci&oacute;n y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Ayuda</guimenu><guimenuitem>Contenido</guimenuitem></menuchoice>. Tambi&eacute;n puede iniciar la aplicaci&oacute;n y, a continuaci&oacute;n, presionar  <keycap>F1</keycap>.</para>
    </sect2>
  </sect1>
</chapter>
