<?xml version="1.0" encoding="utf-8"?>
<chapter id="gospanel-1">
  <title>C&oacute;mo trabajar con paneles</title>
  <highlights>
    <para>La informaci&oacute;n de este cap&iacute;tulo describe el uso de los paneles. </para>
  </highlights>
  <sect1 id="gospanel-2">
    <title>Introducci&oacute;n a los paneles</title>
    <indexterm>
      <primary>paneles</primary>
      <secondary>introducci&oacute;n</secondary>
    </indexterm>
    <para>El panel es un &aacute;rea del escritorio en el que se pueden ejecutar aplicaciones y apliques, adem&aacute;s de realizar otras tareas. Al iniciar una sesi&oacute;n por primera vez, el escritorio contiene los siguientes paneles: </para>
    <itemizedlist>
      <listitem>
        <para>Panel de men&uacute;</para>
      </listitem>
      <listitem>
        <para>El panel de borde del fondo del escritorio</para>
      </listitem>
    </itemizedlist>
    <para>Las siguientes secciones describen estos paneles.</para>
    <sect2 id="gospanel-6">
      <title>Panel de men&uacute;</title>
      <indexterm>
        <primary>panel de men&uacute;</primary>
        <secondary>introducci&oacute;n</secondary>
      </indexterm>
      <indexterm>
        <primary>paneles</primary>
        <secondary>panel de men&uacute;</secondary>
        <see>panel de men&uacute;</see>
      </indexterm>
      <para>El Panel de men&uacute; se extiende a lo ancho del borde superior de la pantalla. El Panel de men&uacute; incluye men&uacute;s de texto, en vez de gr&aacute;ficos. La <xref linkend="gospanel-FIG-60"/> muestra el Panel de men&uacute;. El administrador del sistema puede haber modificado el Panel de men&uacute; predeterminado para adaptar el sistema a sus necesidades, as&iacute; que ciertos aspectos quiz&aacute;s no coincidan con los descritos aqu&iacute;.</para>
      <figure id="gospanel-FIG-60">
        <title>Panel de men&uacute; t&iacute;pico</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/menu_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Panel de menú predeterminado. El contexto describe el gráfico.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <indexterm>
        <primary>Panel de men&uacute;</primary>
        <secondary>contenido predeterminado</secondary>
      </indexterm>
      <para>Un Panel de men&uacute; t&iacute;pico contiene los siguientes elementos: </para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec3" colwidth="30.95*"/>
          <colspec colname="colspec4" colwidth="69.05*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Objeto</para>
              </entry>
              <entry valign="top">
                <para>Descripci&oacute;n </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Men&uacute; <guimenu>Aplicaciones</guimenu></para>
              </entry>
              <entry valign="top">
                <para>El men&uacute; <guimenu>Aplicaciones</guimenu> contiene las aplicaciones est&aacute;ndar de GNOME.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Men&uacute; <guimenu>Acciones</guimenu></para>
              </entry>
              <entry valign="top">
                <para>El men&uacute; <guimenu>Acciones</guimenu> contiene varios comandos que permiten ejecutar tareas de escritorio. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3">
                <para>Lanzador de la carpeta de inicio</para>
              </entry>
              <entry colname="colspec4">
                <para>Haga clic en este lanzador para abrir la carpeta de inicio de la ventana del gestor de archivos <application>Nautilus</application>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3">
                <para>Lanzador <application>Terminal</application></para>
              </entry>
              <entry colname="colspec4">
                <para>Haga clic en este lanzador para iniciar la aplicaci&oacute;n <application>Terminal</application>. <application>Terminal</application> proporciona acceso a la l&iacute;nea de comandos de UNIX.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3" valign="top">
                <para>Aplique <application>Control de volumen</application></para>
              </entry>
              <entry colname="colspec4" valign="top">
                <para><application> Control de volumen</application> permite controlar el volumen del altavoz del sistema.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Aplique <application>Reloj</application></para>
              </entry>
              <entry valign="top">
                <para><application>Reloj</application> muestra la hora actual. Haga clic en el reloj para mostrar los comandos de men&uacute; correspondientes.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3" valign="top">
                <indexterm>
                  <primary>Panel de men&uacute; </primary>
                  <secondary>icono de lista de ventanas</secondary>
                </indexterm>
                <para>Icono de lista de ventanas</para>
              </entry>
              <entry colname="colspec4" valign="top">
                <para>La lista de ventana enumera todas las ventanas abiertas. Para dirigir el foco a una ventana, haga clic en el icono situado en la parte inferior derecha del Panel de men&uacute; y, a continuaci&oacute;n, seleccione la ventana. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>A diferencia de otros tipos de panel, s&oacute;lo puede haber un Panel de men&uacute; abierto a la vez en el escritorio.</para>
    </sect2>
    <sect2 id="gospanel-3">
      <title>Panel del borde inferior</title>
      <indexterm>
        <primary>paneles</primary>
        <secondary>panel del borde inferior</secondary>
        <see>panel del borde inferior</see>
      </indexterm>
      <indexterm>
        <primary>panel del borde inferior </primary>
        <secondary>introducci&oacute;n</secondary>
      </indexterm>
      <para>Al iniciar sesi&oacute;n, el panel del borde se expande a lo ancho de la parte inferior del escritorio. La <xref linkend="gospanel-FIG-58"/> muestra un panel del borde inferior t&iacute;pico. El administrador del sistema puede haber modificado el men&uacute; del panel para adaptar el sistema a sus necesidades, as&iacute; que ciertos aspectos quiz&aacute;s no coincidan con los descritos aqu&iacute;. </para>
      <figure id="gospanel-FIG-58">
        <title>Panel del borde inferior t&iacute;pico</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/gnome_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Panel del borde inferior. El contexto describe el gráfico.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <indexterm>
        <primary>panel del borde inferior</primary>
        <secondary>contenido predeterminado </secondary>
      </indexterm>
      <para>El panel del borde inferior contiene los siguientes apliques:</para>
      <itemizedlist>
        <listitem>
          <para><application>Lista de ventanas</application>: muestra un bot&oacute;n para cada ventana abierta. La <application>Lista de ventanas</application> permite minimizar y restaurar ventanas.</para>
        </listitem>
        <listitem>
          <para><application>Conmutador de &aacute;reas de trabajo</application>: permite la navegaci&oacute;n entre &aacute;reas de trabajo.</para>
        </listitem>
      </itemizedlist>
      <para>Puede cambiarse tanto el aspecto como el comportamiento del panel del borde inferior para satisfacer las necesidades del usuario. Tambi&eacute;n se pueden a&ntilde;adir o suprimir objetos del panel del borde inferior. Se pueden crear m&uacute;ltiples paneles y seleccionar diferentes propiedades, objetos y fondos para cada uno de ellos. Tambi&eacute;n se pueden ocultar los paneles.</para>
    </sect2>
  </sect1>
  <sect1 id="gospanel-5">
    <title>Gesti&oacute;n de los paneles</title>
    <indexterm>
      <primary>paneles</primary>
      <secondary>gestionar</secondary>
    </indexterm>
    <para>La informaci&oacute;n de esta secci&oacute;n describe c&oacute;mo gestionar los paneles. </para>
    <sect2 id="gospanel-10">
      <title>Para agregar un nuevo panel</title>
      <indexterm>
        <primary>paneles</primary>
        <secondary>agregar nuevo</secondary>
      </indexterm>
      <para>Pueden agregarse diferentes tipos de paneles al escritorio. La <xref linkend="gospanel-TBL-47"/> enumera los tipos de paneles que se pueden agregar y sus caracter&iacute;sticas. </para>
      <table frame="topbot" id="gospanel-TBL-47">
        <title>Tipos de panel</title>
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="24.28*"/>
          <colspec colname="colspec1" colwidth="37.36*"/>
          <colspec colname="colspec2" colwidth="37.36*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Tipo de panel</para>
              </entry>
              <entry valign="top">
                <para>Alineaci&oacute;n </para>
              </entry>
              <entry valign="top">
                <para> Tama&ntilde;o</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Panel de esquina</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Se alinea con uno de los bordes de la pantalla pero s&oacute;lo al centro o a una esquina. </para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>Se expande tanto como sea necesario para mostrar los objetos en el panel.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Panel lateral</para>
              </entry>
              <entry valign="top">
                <para> Se alinea con uno de los bordes de la pantalla. El panel de inicio en la parte inferior del escritorio es un ejemplo de panel lateral. </para>
              </entry>
              <entry valign="top">
                <para> Se expande tanto como el borde al que el panel se alinea.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Panel flotante</para>
              </entry>
              <entry valign="top">
                <para> No se puede alinear. Un panel flotante se puede situar en cualquier parte del escritorio.</para>
              </entry>
              <entry valign="top">
                <para>Se expande tanto como sea necesario para mostrar los objetos en el panel.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Panel deslizante</para>
              </entry>
              <entry valign="top">
                <para> Se alinea con uno de los bordes de la pantalla, en cualquier punto del borde. </para>
              </entry>
              <entry valign="top">
                <para>Se expande tanto como sea necesario para mostrar los objetos en el panel.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Panel de men&uacute;</para>
              </entry>
              <entry colname="colspec1">
                <para> Se alinea con el borde superior de la pantalla. El Panel de men&uacute; no se puede mover.</para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>Se expande tanto como la longitud total del borde superior de la pantalla. S&oacute;lo puede haber un Panel de men&uacute; en el escritorio.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
      <para>Para agregar un panel, siga estos pasos:</para>
      <orderedlist>
        <listitem>
          <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en cualquier panel y, a continuaci&oacute;n, seleccione <guimenuitem>Panel nuevo</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>Seleccione el tipo de panel que desea agregar. Se a&ntilde;adir&aacute; el panel nuevo al escritorio. El panel nuevo no contendr&aacute; ning&uacute;n objeto, excepto el Panel de men&uacute;. </para>
          <para>Puede personalizar el panel nuevo como desee.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gospanel-11">
      <title>Para interaccionar con un panel</title>
      <indexterm>
        <primary>paneles</primary>
        <secondary>interaccionar con</secondary>
      </indexterm>
      <para>Para interaccionar con un panel, primero debe hacer clic con cualquier bot&oacute;n del rat&oacute;n en un espacio vac&iacute;o del panel. Si el panel no tuviera ning&uacute;n espacio vac&iacute;o, puede hacer clic con el bot&oacute;n central o derecho del rat&oacute;n en uno de los botones de ocultaci&oacute;n a fin de seleccionar el panel. Si los botones de ocultaci&oacute;n no fueran visibles, modifique antes las propiedades del panel para que pueda acceder a ellos. </para>
      <para>Usos de los botones del rat&oacute;n para interaccionar con los paneles:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="30.65*"/>
          <colspec colname="colspec1" colwidth="69.35*"/>
          <tbody>
            <row>
              <entry valign="top">
                <para>Hacer clic con el bot&oacute;n central</para>
              </entry>
              <entry valign="top">
                <para>Permite arrastrar y luego soltar el panel a una nueva ubicaci&oacute;n.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Hacer clic con el bot&oacute;n derecho</para>
              </entry>
              <entry valign="top">
                <para> Abre el men&uacute; emergente del panel</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gospanel-12">
      <title>Para mover un panel</title>
      <indexterm>
        <primary>paneles</primary>
        <secondary>mover</secondary>
      </indexterm>
      <para>Los paneles se pueden mover a diferentes ubicaciones del escritorio. Para mover un panel, haga clic con el bot&oacute;n central de rat&oacute;n en cualquier espacio vac&iacute;o del panel y, a continuaci&oacute;n, arrastre el panel y su&eacute;ltelo en la nueva ubicaci&oacute;n.</para>
      <para>Al arrastrar un panel, &eacute;ste sigue el movimiento del puntero del rat&oacute;n. El panel no se alinear&aacute; con ning&uacute;n elemento del escritorio. Al arrastrar un panel de esquina, un panel lateral o uno deslizante, se alinean autom&aacute;ticamente con un borde de la pantalla.</para>
      <note>
        <para>El Panel de men&uacute; no se puede mover.</para>
      </note>
    </sect2>
    <sect2 id="gospanel-7">
      <title>Para ocultar un panel</title>
      <indexterm>
        <primary>paneles</primary>
        <secondary>ocultar</secondary>
      </indexterm>
      <para>Se puede ocultar o mostrar todos los paneles, excepto el Panel de men&uacute;. Para ocultar un panel, utilice el bot&oacute;n de ocultaci&oacute;n. Si los botones de ocultaci&oacute;n no fueran visibles, modifique antes las propiedades del panel para que pueda acceder a ellos. </para>
      <para>Los botones de ocultaci&oacute;n se encuentran a ambos lados del panel. Los botones de ocultaci&oacute;n contienen un icono de flecha opcional. La siguiente ilustraci&oacute;n muestra los botones de ocultaci&oacute;n. </para>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/four_hide_button.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Un panel horizontal y uno vertical con botones de ocultación.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <para>Para ocultar un panel, haga clic en uno de los botones de ocultaci&oacute;n. El panel se oculta en la direcci&oacute;n de la flecha del bot&oacute;n de ocultaci&oacute;n. El bot&oacute;n de ocultaci&oacute;n permanece visible en el otro lado del panel.</para>
      <para>Para volver a mostrar el panel, haga clic en el bot&oacute;n de ocultaci&oacute;n que queda visible. El panel se expande en la direcci&oacute;n de la flecha del bot&oacute;n de ocultaci&oacute;n. Ahora, ambos botones de ocultaci&oacute;n son visibles.</para>
      <para>Puede configurar el panel para que se oculte autom&aacute;ticamente. Al configurar el panel para que se oculte autom&aacute;ticamente, &eacute;ste se oculta autom&aacute;ticamente cuando el rat&oacute;n no apunta al panel. El panel reaparece al apuntar el rat&oacute;n a la parte de la pantalla donde se encontraba. Para que el panel se oculte autom&aacute;ticamente, modifique sus propiedades.</para>
      <note>
        <para>En un panel de esquina, el comportamiento de los botones de ocultaci&oacute;n es algo diferente. Si el panel est&aacute; en una de las esquinas de la pantalla, puede utilizar los botones de ocultaci&oacute;n de la siguiente manera:</para>
        <itemizedlist>
          <listitem>
            <para>Para ocultar el panel, haga clic en el bot&oacute;n de ocultaci&oacute;n m&aacute;s cercano al borde de la pantalla, como en el caso anterior.</para>
          </listitem>
          <listitem>
            <para>Para mover el panel a la esquina opuesta de la pantalla, haga clic en el bot&oacute;n de ocultaci&oacute;n m&aacute;s lejano al borde de la pantalla.</para>
          </listitem>
        </itemizedlist>
      </note>
    </sect2>
    <sect2 id="gospanel-28">
      <title>Para modificar las propiedades de un panel</title>
      <indexterm>
        <primary>paneles</primary>
        <secondary>modificar propiedades</secondary>
      </indexterm>
      <para>Para modificar las propiedades de todos los paneles, seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guisubmenu>Avanzadas</guisubmenu><guimenuitem>Panel</guimenuitem></menuchoice> y, a continuaci&oacute;n, realice los cambios necesarios. Por ejemplo, se pueden configurar el aspecto y el comportamiento de los objetos del panel. </para>
      <para>Tambi&eacute;n se pueden modificar las propiedades de un panel por separado. Se pueden modificar las caracter&iacute;sticas de cada panel, tales como el tipo, el comportamiento para ocultarse y el aspecto visual. </para>
      <note>
        <para>No se pueden modificar las propiedades del Panel de men&uacute;.</para>
      </note>
      <para>Para modificar las propiedades de un panel, efect&uacute;e los pasos siguientes: </para>
      <orderedlist>
        <listitem>
          <para>Haga clic en un espacio vac&iacute;o del panel y, a continuaci&oacute;n seleccione <guimenuitem> Propiedades</guimenuitem> para mostrar el cuadro de di&aacute;logo <guilabel>Propiedades de panel</guilabel>. </para>
          <para>El cuadro de di&aacute;logo <guilabel>Propiedades del panel</guilabel> contiene las siguientes pesta&ntilde;as: </para>
          <itemizedlist>
            <listitem>
              <para>
                <guilabel>Panel <replaceable>tipo_panel</replaceable></guilabel>
              </para>
            </listitem>
            <listitem>
              <para>
                <guilabel>Fondo</guilabel>
              </para>
            </listitem>
          </itemizedlist>
        </listitem>
        <listitem>
          <para>Para modificar el tama&ntilde;o, posici&oacute;n y propiedades de ocultaci&oacute;n de un panel, haga clic en la pesta&ntilde;a <guilabel>Panel <replaceable>tipo_panel</replaceable></guilabel>. A continuaci&oacute;n se muestran los diferentes elementos del cuadro de di&aacute;logo para cada pesta&ntilde;a de <guilabel>Panel <replaceable>tipo_panel</replaceable></guilabel>: </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="28.57*"/>
              <colspec colname="colspec1" colwidth="71.43*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Elemento de la ventana de di&aacute;logo</para>
                  </entry>
                  <entry valign="top">
                    <para>Descripci&oacute;n </para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>Posici&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Seleccione la posici&oacute;n del panel en el escritorio. Haga clic en la posici&oacute;n deseada. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Tama&ntilde;o</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione el tama&ntilde;o del panel.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Orientar horizontalmente</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>S&oacute;lo para paneles flotantes. Seleccione esta opci&oacute;n para mostrar el panel horizontalmente. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Orientar verticalmente</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>S&oacute;lo para paneles flotantes. Seleccione esta opci&oacute;n para mostrar el panel verticalmente. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>Desplazamiento horizontal</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>S&oacute;lo para paneles flotantes. Utilice el cuadro de desplazamiento para indicar la distancia del panel con respecto al borde izquierdo del escritorio. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>Desplazamiento vertical</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>S&oacute;lo para paneles flotantes. Utilice el cuadro de desplazamiento para indicar la distancia del panel con respecto al borde superior del escritorio. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Desplazamiento desde el borde de la pantalla</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>S&oacute;lo para paneles flotantes. Utilice el cuadro de desplazamiento para indicar la distancia en p&iacute;xeles entre el panel y el borde de la pantalla. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Ocultar autom&aacute;ticamente</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para habilitar la ocultaci&oacute;n autom&aacute;tica. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Mostrar botones de ocultaci&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para mostrar los botones de ocultaci&oacute;n en el panel.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Flechas en los botones de ocultaci&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para mostrar flechas en los botones de ocultaci&oacute;n, si &eacute;stos est&aacute;n activados.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Para modificar el fondo del panel, haga clic en la pesta&ntilde;a <guilabel>Fondo</guilabel>. La pesta&ntilde;a <guilabel>Fondo</guilabel> contiene los siguientes elementos: </para>
          <informaltable frame="topbot">
            <tgroup cols="3" colsep="0" rowsep="0">
              <colspec colwidth="27.00*"/>
              <colspec colname="colspec5" colwidth="29.14*"/>
              <colspec colname="colspec6" colwidth="42.86*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Elemento de la ventana de di&aacute;logo</para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Descripci&oacute;n</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Tipo de fondo</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Puede seleccionar el tipo de fondo del panel. Las posibilidades son:</para>
                    <itemizedlist>
                      <listitem>
                        <para><guilabel>Predeterminado</guilabel>: el tipo de fondo predeterminado. El fondo est&aacute;ndar depende de los valores asignados en <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guimenuitem> Tema</guimenuitem></menuchoice>. </para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Color</guilabel>: permite seleccionar el color del fondo del panel.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Imagen</guilabel>: permite seleccionar una imagen para el fondo del panel. </para>
                      </listitem>
                    </itemizedlist>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Color de fondo</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Si el <guilabel> Tipo de fondo</guilabel> es un <guilabel>Color</guilabel>, haga clic en el bot&oacute;n<guibutton> Color que usar</guibutton> para mostrar el cuadro de di&aacute;logo de selecci&oacute;n de color. Seleccione el color en este cuadro de di&aacute;logo. </para>
                  </entry>
                </row>
                <row>
                  <entry morerows="4" valign="top">
                    <para>
                      <guilabel>Imagen</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Si el<guilabel> Tipo de fondo</guilabel> es una <guilabel>Imagen</guilabel>, seleccione la imagen para el fondo del panel. Especifique los siguientes valores de configuraci&oacute;n para la imagen del fondo:</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>No escalar imagen para ajustar</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para hacer un mosaico con la imagen hasta rellenar todo el fondo del panel.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Escalar imagen</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para redimensionar la imagen hasta rellenar todo el fondo del panel. La proporci&oacute;n entre altura y anchura se mantendr&aacute;. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Estirar imagen</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para estirar la imagen hasta rellenar todo el fondo del panel. La proporci&oacute;n entre altura y anchura no se mantendr&aacute;. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Rotar imagen para paneles verticales</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para rotar la imagen del fondo en un panel vertical.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
          <para>Tambi&eacute;n se puede arrastrar un color o imagen al panel para definir el fondo. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="gospanel-61"/>. </para>
        </listitem>
        <listitem>
          <para>Haga clic en el bot&oacute;n <guibutton>Cerrar</guibutton> para cerrar el cuadro de di&aacute;logo <guilabel>Propiedades del panel</guilabel>.</para>
        </listitem>
      </orderedlist>
      <sect3 id="gospanel-61">
        <title>Para arrastrar un color o imagen al fondo de un panel</title>
        <indexterm>
          <primary>paneles</primary>
          <secondary>cambiar el fondo</secondary>
        </indexterm>
        <para>Se puede arrastrar un color o imagen al panel para definir el fondo. Puede arrastrarse el color o la imagen desde m&uacute;ltiples aplicaciones. Por ejemplo, se puede arrastrar un color del gestor de archivos <application>Nautilus</application> al panel para definir el color como el fondo del panel. Tambi&eacute;n se puede arrastrar el color desde cualquier selector de color.</para>
        <para>Puede arrastrarse una imagen al panel para que defina el fondo. Tambi&eacute;n se pueden arrastrar las im&aacute;genes desde la aplicaci&oacute;n del gestor de archivos <application>Nautilus </application>para definir el fondo del panel. </para>
      </sect3>
    </sect2>
    <sect2 id="gospanel-31">
      <title>Para suprimir un panel</title>
      <indexterm>
        <primary>paneles</primary>
        <secondary>suprimir</secondary>
      </indexterm>
      <para>Para suprimir un panel del escritorio, haga clic con el bot&oacute;n derecho sobre el panel que desea eliminar y, a continuaci&oacute;n, seleccione <menuchoice><guimenuitem>Suprimir este panel</guimenuitem></menuchoice>.</para>
      <note>
        <para>Como m&iacute;nimo debe haber siempre un panel en el escritorio. Si s&oacute;lo hay un panel en el escritorio, &eacute;ste no se podr&aacute; suprimir.</para>
      </note>
    </sect2>
  </sect1>
  <sect1 id="gospanel-8">
    <title>Objetos de panel</title>
    <indexterm>
      <primary>paneles</primary>
      <secondary>objetos de panel</secondary>
      <see> objetos de panel</see>
    </indexterm>
    <para>En esta secci&oacute;n se describen los objetos que se pueden a&ntilde;adir a los paneles y c&oacute;mo utilizarlos desde all&iacute;.</para>
    <sect2 id="gospanel-100">
      <title>Interacci&oacute;n con objetos de panel</title>
      <indexterm>
        <primary>objetos de panel</primary>
        <secondary>interaccionar con</secondary>
      </indexterm>
      <para>Puede utilizar los botones del rat&oacute;n para interaccionar con un objeto de panel de la siguiente manera:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="30.65*"/>
          <colspec colname="colspec1" colwidth="69.35*"/>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Hacer clic con el bot&oacute;n izquierdo</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Lanza el objeto del panel.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Hacer clic con el bot&oacute;n central</para>
              </entry>
              <entry valign="top">
                <para> Permite arrastrar y luego soltar el panel a una nueva ubicaci&oacute;n.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Hacer clic con el bot&oacute;n derecho</para>
              </entry>
              <entry valign="top">
                <para> Abre el men&uacute; emergente del objeto de panel.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Se interacciona con los apliques de los objetos del panel de m&uacute;ltiples maneras. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="gospanel-39"/>.</para>
    </sect2>
    <sect2 id="gospanel-15">
      <title>Para a&ntilde;adir un objeto a un panel</title>
      <indexterm>
        <primary>objetos de panel</primary>
        <secondary>a&ntilde;adir</secondary>
      </indexterm>
      <para>Se puede a&ntilde;adir un objeto a un panel de diferentes maneras: </para>
      <itemizedlist>
        <listitem>
          <para>Desde el men&uacute; emergente del panel</para>
          <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel para abrir el men&uacute; emergente del panel. El men&uacute; contiene un submen&uacute; <guisubmenu>Agregar al panel</guisubmenu>. El submen&uacute; <guisubmenu>Agregar al panel</guisubmenu> permite a&ntilde;adir los siguientes tipos de objetos a los paneles: <itemizedlist><listitem><para>Apliques de accesorios</para></listitem><listitem><para>Apliques de entretenimiento</para></listitem><listitem><para>Apliques de Internet</para></listitem><listitem><para>Apliques de multimedia</para></listitem><listitem><para>Apliques de utilidades</para></listitem><listitem><para>Lanzadores</para></listitem><listitem><para>Lanzadores desde men&uacute;s</para></listitem><listitem><para>Men&uacute; de GNOME</para></listitem><listitem><para>Cajones</para></listitem><listitem><para>Bot&oacute;n <guibutton>Terminar sesi&oacute;n</guibutton></para></listitem><listitem><para>Bot&oacute;n <guibutton>Bloquear</guibutton></para></listitem></itemizedlist></para>
        </listitem>
        <listitem>
          <para>Desde cualquier men&uacute;</para>
          <para>Al hacer clic con el bot&oacute;n derecho del rat&oacute;n sobre un lanzador en un men&uacute;, se abre el men&uacute; emergente correspondiente. Se puede utilizar este men&uacute; emergente para a&ntilde;adir el lanzador a un panel. </para>
          <para>Tambi&eacute;n se pueden arrastrar men&uacute;s, lanzadores y apliques de los men&uacute;s a los paneles. </para>
        </listitem>
        <listitem>
          <para>Desde el gestor de archivos</para>
          <para>Cada lanzador y aplique se corresponde con un archivo <filename>.desktop</filename>. Puede arrastrarse el archivo <filename>.desktop</filename> a los paneles para a&ntilde;adir el lanzador o el aplique al panel. </para>
<!--<para><emphasis>Question:</emphasis> Are applets still represented by .desktop files?</para>-->
          <para>Cada men&uacute; se corresponde con un directorio. Se puede arrastrar el directorio a un panel para a&ntilde;adirlo como objeto.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-9">
      <title>Para modificar las propiedades de un objeto</title>
      <indexterm>
        <primary>objetos de panel</primary>
        <secondary>modificar propiedades </secondary>
      </indexterm>
      <para>Algunos objetos de panel poseen un conjunto de propiedades asociadas que son diferentes para cada tipo de objeto y permiten especificar ciertos detalles, como: <itemizedlist><listitem><para>El comando que inicia una aplicaci&oacute;n de lanzador.</para></listitem><listitem><para>La ubicaci&oacute;n de los archivos fuente de un men&uacute;.</para></listitem><listitem><para>El icono que representa al objeto.</para></listitem></itemizedlist></para>
      <para>Para modificar las propiedades de un objeto: </para>
      <orderedlist>
        <listitem>
          <indexterm>
            <primary>men&uacute; emergente del objeto de panel, ilustraci&oacute;n</primary>
          </indexterm>
          <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en el objeto del panel para abrir el men&uacute; emergente del objeto, como se muestra en la <xref linkend="gospanel-FIG-54"/>.</para>
          <figure id="gospanel-FIG-54">
            <title>Men&uacute; emergente del objeto de panel</title>
            <screenshot>
              <mediaobject>
                <imageobject>
                  <imagedata fileref="figures/panel_object_popup_menu.png" format="PNG"/>
                </imageobject>
                <textobject>
                  <phrase>&gt;Menú emergente del objeto de panel. Elementos del menú:  Propiedades, Ayuda, Eliminar del panel, Mover.</phrase>
                </textobject>
              </mediaobject>
            </screenshot>
          </figure>
        </listitem>
        <listitem>
          <para>Seleccione <guimenuitem>Propiedades</guimenuitem>. Utilice el cuadro de di&aacute;logo <guilabel>Propiedades</guilabel> para modificar las propiedades seg&uacute;n sea necesario. Las propiedades del cuadro de di&aacute;logo <guilabel>Propiedades</guilabel> dependen del tipo de objeto seleccionado en el paso 1. </para>
        </listitem>
        <listitem>
          <para>Haga clic en <guibutton>Aceptar</guibutton> para aplicar los cambios y, a continuaci&oacute;n, cierre el cuadro de di&aacute;logo <guilabel>Propiedades</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gospanel-32">
      <title>Para mover un objeto de panel</title>
      <indexterm>
        <primary>objetos de panel</primary>
        <secondary>mover</secondary>
      </indexterm>
      <para>Puede mover los objetos de panel dentro del panel o a otro. Tambi&eacute;n se pueden mover objetos entre paneles y cajones.</para>
      <para>Para mover un objeto de panel, haga clic en el bot&oacute;n central para arrastrarlo a la nueva ubicaci&oacute;n. Al soltar el bot&oacute;n, el objeto se sit&uacute;a en la nueva ubicaci&oacute;n.</para>
      <para>Tambi&eacute;n puede utilizar el men&uacute; emergente del objeto de panel para moverlo, como se indica a continuaci&oacute;n: </para>
      <orderedlist>
        <listitem>
          <para>Haga clic en el bot&oacute;n derecho del rat&oacute;n sobre el objeto y, a continuaci&oacute;n, seleccione <guimenuitem>Mover</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>Apunte con el rat&oacute;n en la nueva ubicaci&oacute;n del objeto, haga clic con cualquier bot&oacute;n del rat&oacute;n y el objeto se situar&aacute; en la nueva ubicaci&oacute;n. Esta ubicaci&oacute;n puede estar en cualquier panel del escritorio. </para>
        </listitem>
      </orderedlist>
      <para>El movimiento del objeto afecta a la posici&oacute;n del resto de objetos del panel. Para controlar el movimiento de los objetos de un panel, puede especificarse un modo de movimiento. Para indicar el modo de movimiento, pulse una de las siguientes teclas al moverlos:</para>
      <informaltable frame="topbot">
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec2" colwidth="15.00*"/>
          <colspec colname="colspec1" colwidth="30.00*"/>
          <colspec colname="colspec3" colwidth="54.00*"/>
          <thead>
            <row rowsep="1">
              <entry colname="colspec2" valign="top">
                <para>Tecla</para>
              </entry>
              <entry valign="top">
                <para>Modo de movimiento</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Descripci&oacute;n</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec2" valign="top">
                <para>Sin presionar tecla</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Movimiento con intercambio</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>El objeto intercambia la posici&oacute;n con el resto de objetos. &Eacute;ste es el modo de movimiento predeterminado.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>Tecla <keycap>Alt</keycap></para>
              </entry>
              <entry valign="top">
                <para>Movimiento libre</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>El objeto salta por encima del resto de objetos al siguiente espacio vac&iacute;o del panel.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>Tecla <keycap>May&uacute;s</keycap></para>
              </entry>
              <entry valign="top">
                <para>Movimiento de empuje</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>El objeto empuja al resto de objetos a lo largo del panel. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gospanel-33">
      <title>Para eliminar un objeto de panel</title>
      <indexterm>
        <primary>objetos de panel</primary>
        <secondary>eliminar</secondary>
      </indexterm>
      <para>Para eliminar un objeto de un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n para abrir el men&uacute; emergente y, a continuaci&oacute;n, seleccione <guimenuitem>Eliminar del panel</guimenuitem>. </para>
    </sect2>
  </sect1>
  <sect1 id="gospanel-17">
    <title>Apliques</title>
    <indexterm>
      <primary>apliques</primary>
      <secondary>introducci&oacute;n</secondary>
    </indexterm>
    <indexterm>
      <primary>objetos de panel</primary>
      <secondary>apliques</secondary>
      <see>apliques</see>
    </indexterm>
    <para>Un aplique es una peque&ntilde;a aplicaci&oacute;n cuya interfaz reside en un panel. El objeto de panel del aplique se utiliza para interaccionar con el aplique. Por ejemplo, en la siguiente figura se muestran los siguientes apliques, de izquierda a derecha: </para>
    <itemizedlist>
      <listitem>
        <para><application>Lista de ventanas</application>: muestra la ventana actualmente abierta en el sistema.</para>
      </listitem>
      <listitem>
        <para><application>Lector de CD </application>: controla el reproductor de CD del sistema.</para>
      </listitem>
      <listitem>
        <para><application>Control de volumen</application>: permite controlar el volumen del altavoz del sistema.</para>
      </listitem>
    </itemizedlist>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/sample_applet.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Apliques de ejemplo. El contexto describe el gráfico.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <sect2 id="gospanel-40">
      <title>Para a&ntilde;adir un objeto a un panel</title>
      <indexterm>
        <primary>apliques</primary>
        <secondary>a&ntilde;adir al panel</secondary>
      </indexterm>
      <para>Se puede a&ntilde;adir un aplique a un panel desde el men&uacute; emergente del panel. Haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel para abrir el men&uacute; emergente. Seleccione <guimenu>Agregar al panel</guimenu> y, a continuaci&oacute;n, seleccione el aplique que desea a&ntilde;adir en cualquiera de los siguientes submen&uacute;s:</para>
      <itemizedlist>
        <listitem>
          <para>
            <guimenu>Accesorios</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Entretenimientos</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Red</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Multimedia</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Utilidad</guimenu>
          </para>
        </listitem>
      </itemizedlist>
      <para>Tambi&eacute;n puede arrastrar el aplique del submen&uacute; al panel. </para>
    </sect2>
    <sect2 id="gospanel-39">
      <title>Para seleccionar un aplique</title>
      <indexterm>
        <primary>apliques</primary>
        <secondary>seleccionar</secondary>
      </indexterm>
      <para>Para modificar las propiedades de un aplique, primero debe hacer clic en el bot&oacute;n derecho del rat&oacute;n en el aplique para mostrar el men&uacute; emergente de objeto de panel. Para mover un aplique, haga clic con el bot&oacute;n central en &eacute;l. </para>
      <para>Existen ciertas restricciones sobre el lugar donde se puede hacer clic en un aplique para abrir el men&uacute; emergente de objeto de panel o para moverlo: </para>
      <itemizedlist>
        <listitem>
          <para>Algunos apliques contienen men&uacute;s emergentes de comandos espec&iacute;ficos del aplique que tambi&eacute;n se abren al hacer clic en zonas espec&iacute;ficas. Por ejemplo, el aplique <application>Lista de ventanas</application> tiene un asa vertical a la izquierda y botones que representan las ventanas a la derecha. Para abrir el men&uacute; emergente del aplique <application>Lista de ventanas</application>, se debe hacer clic con el bot&oacute;n derecho en el asa. Al hacer clic con el bot&oacute;n derecho en el lado derecho, aparecer&aacute; el men&uacute; emergente del bot&oacute;n.</para>
        </listitem>
        <listitem>
          <para>Algunos apliques tienen &aacute;reas que no se pueden utilizar para seleccionarlo. Por ejemplo, el aplique <application>L&iacute;nea de comandos</application> tiene un campo en el que se introducen los comandos.  No se puede hacer clic con el bot&oacute;n derecho o central del rat&oacute;n en este campo para seleccionarlo. S&oacute;lo se puede hacer clic con el bot&oacute;n derecho o central en otra parte del aplique. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-41">
      <title>Para modificar las preferencias de un aplique</title>
      <indexterm>
        <primary>apliques</primary>
        <secondary>modificar preferencias</secondary>
      </indexterm>
      <para>Para modificar las preferencias de un aplique, efect&uacute;e los siguientes pasos: </para>
      <orderedlist>
        <listitem>
          <para>Haga clic en el bot&oacute;n derecho del rat&oacute;n sobre el aplique y, a continuaci&oacute;n, seleccione <guimenuitem>Preferencias</guimenuitem>. Utilice el cuadro de di&aacute;logo <guilabel>Preferencias</guilabel> para modificarlas seg&uacute;n se necesite. Las preferencias suelen ser diferentes para cada tipo de aplique.</para>
        </listitem>
        <listitem>
          <para>Haga clic en el bot&oacute;n <guibutton>Cerrar</guibutton> para cerrar el cuadro de di&aacute;logo <guilabel>Preferencias</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-16">
    <title>Lanzadores</title>
    <indexterm>
      <primary>objetos de panel</primary>
      <secondary>lanzadores</secondary>
      <see>lanzadores</see>
    </indexterm>
    <para>Al hacer clic en un lanzador, sucede una de las siguientes acciones: </para>
    <itemizedlist>
      <listitem>
        <para>Inicia una determinada aplicaci&oacute;n.</para>
      </listitem>
      <listitem>
        <para>Ejecuta un comando.</para>
      </listitem>
      <listitem>
        <para>Abre una carpeta en una ventana del gestor de archivos.</para>
      </listitem>
      <listitem>
        <para>Abre el navegador en una determinada direcci&oacute;n <firstterm>Uniform Resource Locator</firstterm> (<acronym>URL</acronym>). El URL es la direcci&oacute;n de una ubicaci&oacute;n espec&iacute;fica en Internet.</para>
      </listitem>
    </itemizedlist>
    <para>Pueden encontrarse lanzadores en las siguientes partes del escritorio:</para>
    <itemizedlist>
      <listitem>
        <para>Paneles: en los paneles, los lanzadores se representan por iconos.</para>
      </listitem>
      <listitem>
        <para>Men&uacute;s: en los men&uacute;s, los lanzadores se representan por elementos de men&uacute;. Por lo general, los elementos del men&uacute; tienen un icono junto a su nombre.</para>
      </listitem>
      <listitem>
        <para>Fondo del escritorio: en el fondo del escritorio, los lanzadores se representan por iconos.</para>
      </listitem>
    </itemizedlist>
    <para>Las propiedades de un lanzador se pueden modificar. Por ejemplo, las propiedades de un lanzador incluyen el nombre, el icono que lo representa y su modo de ejecuci&oacute;n. </para>
    <sect2 id="gospanel-34">
      <title>Para a&ntilde;adir un lanzador a un panel</title>
      <indexterm>
        <primary>lanzadores</primary>
        <secondary>a&ntilde;adir al panel</secondary>
      </indexterm>
      <para>Puede a&ntilde;adir un lanzador a un panel como sigue:</para>
      <itemizedlist>
        <listitem>
          <para>Desde el men&uacute; emergente del panel</para>
          <para>Para crear un nuevo lanzador a un panel, haga clic con el bot&oacute;n derecho en un espacio vac&iacute;o del panel y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Lanzador</guimenuitem></menuchoice>. Se mostrar&aacute; un cuadro de di&aacute;logo <guilabel>Crear un lanzador</guilabel>. Para obtener m&aacute;s informaci&oacute;n acerca de c&oacute;mo trabajar con este cuadro de di&aacute;logo, consulte la <xref linkend="gospanel-52"/>.</para>
          <para>De forma alternativa, para a&ntilde;adir un lanzador ya existente al panel, puede seleccionar <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Lanzador de men&uacute;</guimenuitem></menuchoice> en el men&uacute; emergente. Seleccione el lanzador que desea a&ntilde;adir del men&uacute;.</para>
        </listitem>
        <listitem>
          <para>Desde cualquier men&uacute;</para>
          <para>Para a&ntilde;adir un lanzador a un panel desde cualquier men&uacute;, efect&uacute;e los siguientes pasos:<itemizedlist><listitem><para>Abra el men&uacute; que contiene el lanzador desde el panel donde lo desea a&ntilde;adir. Haga clic con el bot&oacute;n derecho en el nombre del lanzador. Seleccione <guimenuitem>A&ntilde;adir este lanzador al panel</guimenuitem>. </para></listitem><listitem><para>Abra un men&uacute; que contenga el lanzador. Arrastre el lanzador hacia el panel. </para></listitem></itemizedlist></para>
        </listitem>
        <listitem>
          <para>Desde el gestor de archivos</para>
          <para>Para a&ntilde;adir un lanzador a un panel desde el gestor de archivos, encuentre el archivo <filename>.desktop</filename> para el lanzador en el sistema de archivos. Para a&ntilde;adirlo, arrastre el archivo <filename>.desktop</filename> al panel. </para>
        </listitem>
      </itemizedlist>
      <sect3 id="gospanel-52">
        <title>Para crear un lanzador con el cuadro de di&aacute;logo Crear un lanzador</title>
        <para>Para crear un lanzador con el cuadro de di&aacute;logo <guilabel>Crear un lanzador</guilabel>, efect&uacute;e los pasos siguientes: </para>
        <orderedlist>
          <listitem>
            <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel para abrir el men&uacute; emergente del panel. Seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem> Lanzador</guimenuitem></menuchoice> para mostrar el cuadro de di&aacute;logo <guilabel>Crear lanzador</guilabel>. El cuadro de di&aacute;logo mostrar&aacute; la pesta&ntilde;a  <guilabel>B&aacute;sico</guilabel></para>
          </listitem>
          <listitem>
            <para>Introduzca las propiedades del lanzador en el cuadro de di&aacute;logo. A continuaci&oacute;n, se muestran los elementos de cuadro de di&aacute;logo que aparecen en <guilabel>B&aacute;sico</guilabel>: </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colname="colspec0" colwidth="26.19*"/>
                <colspec colname="colspec1" colwidth="73.81*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>Elemento de la ventana de di&aacute;logo</para>
                    </entry>
                    <entry valign="top">
                      <para>Descripci&oacute;n </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Nombre</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Utilice este cuadro de texto para indicar el nombre del lanzador. Utilice la pesta&ntilde;a <guilabel>Avanzado</guilabel> para a&ntilde;adir traducciones del nombre. &Eacute;ste es el nombre que aparecer&aacute; cuando se a&ntilde;ada el lanzador a un men&uacute; o al escritorio. </para>
                    </entry>
                  </row>
                  <row>
                    <entry colname="colspec0">
                      <para>
                        <guilabel>Usuario</guilabel>
                      </para>
                    </entry>
                    <entry colname="colspec1">
                      <para>Utilice este cuadro de texto para indicar el tipo de aplicaci&oacute;n a la cual pertenece el lanzador. Por ejemplo, escriba <userinput>Editor de texto</userinput> en este cuadro de texto si la aplicaci&oacute;n fuera <application>gedit</application>. Utilice la pesta&ntilde;a <guilabel>Avanzado</guilabel> para a&ntilde;adir traducciones del nombre gen&eacute;rico.</para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Comentario</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Utilice este cuadro de texto para anotar una descripci&oacute;n breve del lanzador. El comentario ser&aacute; lo que se muestre como ayuda al apuntar con el rat&oacute;n al icono del panel. Utilice la pesta&ntilde;a <guilabel>Avanzado</guilabel> para a&ntilde;adir traducciones del comentario. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Comando</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Utilice este cuadro de texto para indicar el comando que se ejecutar&aacute; al hacer clic en el lanzador. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Tipo</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Utilice el cuadro de combinaci&oacute;n desplegable
para indicar el tipo de lanzador. Se puede seleccionar: </para>
                      <itemizedlist>
                        <listitem>
                          <para><guilabel>Aplicaci&oacute;n</guilabel>: seleccione esta opci&oacute;n para crear un lanzador que inicie una aplicaci&oacute;n.</para>
                        </listitem>
                        <listitem>
                          <para><guilabel>Enlace</guilabel>: seleccione esta opci&oacute;n para crear un lanzador que enlace a un archivo, carpeta o sitio FTP.</para>
                        </listitem>
                      </itemizedlist>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Icono</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Seleccione un icono para representar el lanzador. Para seleccionar un icono, haga clic en el bot&oacute;n <guibutton>Sin icono</guibutton>. Se mostrar&aacute; un selector de iconos. Seleccione el icono deseado en el cuadro de di&aacute;logo. Alternativamente, para seleccionar el icono de otro directorio, haga clic en <guibutton>Buscar</guibutton>. Cuando haya seleccionado el icono, haga clic en el bot&oacute;n <guibutton>Aceptar</guibutton>. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Ejecutar en terminal</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Seleccione esta opci&oacute;n para ejecutar el comando o aplicaci&oacute;n en una ventana de terminal. Se debe seleccionar esta opci&oacute;n para el caso de aplicaciones o comandos que no crean una ventana en la que ejecutarse. </para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
          </listitem>
          <listitem>
            <para>Para configurar las propiedades avanzadas del lanzador, haga clic en la etiqueta <guilabel> Avanzado</guilabel>. El cuadro de di&aacute;logo <guilabel>Propiedades del lanzador</guilabel> mostrar&aacute; la pesta&ntilde;a <guilabel>Avanzado</guilabel>.</para>
          </listitem>
          <listitem>
            <para>Introduzca las propiedades avanzadas del lanzador en el cuadro de di&aacute;logo. La siguiente tabla describe los elementos del cuadro de di&aacute;logo en la parte superior de la pesta&ntilde;a <guilabel>Avanzado</guilabel>: </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colwidth="32.03*"/>
                <colspec colwidth="67.97*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>Elemento de la ventana de di&aacute;logo</para>
                    </entry>
                    <entry valign="top">
                      <para>Descripci&oacute;n </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Intente esto antes de usarlo</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Introduzca aqu&iacute; un comando para probarlo antes de iniciar el lanzador. Si el comando es ejecutable y se encuentra en la ruta de acceso, el lanzador aparecer&aacute; en el panel</para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Documentaci&oacute;n</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Introduzca la ruta de acceso al archivo de ayuda del lanzador. Si introduce en este campo una ruta de acceso, se a&ntilde;adir&aacute; un elemento <guimenuitem>Ayuda sobre <replaceable>nombre_lanzador</replaceable></guimenuitem> al men&uacute; emergente del lanzador.</para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
          </listitem>
          <listitem>
            <para>Tambi&eacute;n se puede a&ntilde;adir una traducci&oacute;n de los campos  <guilabel>Nombre</guilabel>, <guilabel> Usuario</guilabel> y <guilabel>Comentario</guilabel> de la pesta&ntilde;a <guilabel>B&aacute;sico</guilabel>. Para a&ntilde;adir una traducci&oacute;n, introduzca los detalles en la tabla <guilabel>Nombre/Comentario de las traduccione</guilabel> como se indica a continuaci&oacute;n: </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colname="colspec0" colwidth="20.78*"/>
                <colspec colname="colspec1" colwidth="79.22*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>Campo</para>
                    </entry>
                    <entry valign="top">
                      <para>Descripci&oacute;n </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>Primer campo</para>
                    </entry>
                    <entry valign="top">
                      <para> Introduzca el c&oacute;digo de dos letras del idioma para el cual desea a&ntilde;adir una traducci&oacute;n. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>Segundo campo</para>
                    </entry>
                    <entry valign="top">
                      <para> Introduzca la traducci&oacute;n del <guilabel>Nombre</guilabel> del lanzador.</para>
                    </entry>
                  </row>
                  <row>
                    <entry colname="colspec0">
                      <para>Tercer campo</para>
                    </entry>
                    <entry colname="colspec1">
                      <para> Introduzca la traducci&oacute;n del <guilabel>Usuario</guilabel> del lanzador. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>Cuarto campo</para>
                    </entry>
                    <entry valign="top">
                      <para> Introduzca la traducci&oacute;n del <guilabel>Comentario</guilabel> del lanzador. </para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
            <para>Y, a continuaci&oacute;n, haga clic en el bot&oacute;n <guibutton>A&ntilde;adir/Poner</guibutton>. </para>
            <para>Para editar una traducci&oacute;n, selecci&oacute;nela. El texto traducido aparecer&aacute; en la parte inferior de este cuadro de di&aacute;logo. Edite los campos seg&uacute;n sea necesario y, a continuaci&oacute;n, haga clic en el bot&oacute;n <guibutton>A&ntilde;adir/Poner</guibutton>.</para>
            <para>Haga clic en el bot&oacute;n <guibutton>Quitar</guibutton> para eliminar una traducci&oacute;n previamente seleccionada.</para>
          </listitem>
          <listitem>
            <para>Para crear el lanzador y cerrar el cuadro de di&aacute;logo <guilabel>Propiedades del lanzador</guilabel>, haga clic en <guibutton>Aceptar</guibutton>.</para>
          </listitem>
        </orderedlist>
      </sect3>
    </sect2>
    <sect2 id="gospanel-36">
      <title>Para modificar las propiedades de un lanzador</title>
      <indexterm>
        <primary>lanzadores</primary>
        <secondary>modificar propiedades</secondary>
      </indexterm>
      <para>Para modificar las propiedades de un lanzador: </para>
      <orderedlist>
        <listitem>
          <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel para abrir el men&uacute; emergente del panel. </para>
        </listitem>
        <listitem>
          <para>Seleccione <guimenuitem>Propiedades</guimenuitem>. Utilice el cuadro de di&aacute;logo <guilabel>Propiedades del lanzador</guilabel> para modificar las propiedades seg&uacute;n sea necesario. Para obtener m&aacute;s informaci&oacute;n acerca del cuadro de di&aacute;logo <guilabel>Propiedades del lanzador</guilabel>, consulte la <xref linkend="gospanel-52"/>. </para>
        </listitem>
        <listitem>
          <para>Haga clic en el bot&oacute;n <guibutton>Cerrar</guibutton> para cerrar el cuadro de di&aacute;logo <guilabel>Propiedades del lanzador</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-37">
    <title>Men&uacute;s</title>
    <indexterm>
      <primary>men&uacute;s</primary>
      <secondary>a&ntilde;adir al panel</secondary>
    </indexterm>
    <indexterm>
      <primary>objetos de panel</primary>
      <secondary>men&uacute;s</secondary>
    </indexterm>
    <para>Se pueden a&ntilde;adir los siguientes tipos de men&uacute;s a los paneles: </para>
    <itemizedlist>
      <listitem>
        <para>Men&uacute;s de sistema: los men&uacute;s de sistema contienen las aplicaciones y herramientas est&aacute;ndar que se pueden utilizar en el escritorio. Los men&uacute;s <guimenu>Aplicaciones</guimenu> y <guimenu>Acciones</guimenu> son men&uacute;s de sistema. Para a&ntilde;adir un men&uacute; de sistema a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n un lanzador del men&uacute; y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Men&uacute; completo</guimenu><guimenuitem>A&ntilde;adir el men&uacute; al panel</guimenuitem></menuchoice>. </para>
      </listitem>
      <listitem>
        <para><guimenu>Men&uacute; de GNOME</guimenu>: mediante el <guimenu>Men&uacute; de GNOME</guimenu> se puede acceder a la mayor&iacute;a de aplicaciones est&aacute;ndar, comandos y opciones de configuraci&oacute;n. Para a&ntilde;adir un <guimenu>Men&uacute; de GNOME</guimenu> a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Men&uacute; de GNOME</guimenuitem></menuchoice>. Se pueden a&ntilde;adir tantos objetos del <guimenu>Men&uacute; de  GNOME</guimenu> a los paneles como se desee. De manera predeterminada, el <guimenu>Men&uacute; de GNOME</guimenu> se representa en los paneles mediante un icono con forma de huella estilizada, como se muestra a continuaci&oacute;n:</para>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Icono del Menú de GNOME.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </listitem>
    </itemizedlist>
    <para>Los men&uacute;s que se a&ntilde;aden a los paneles se representan con un icono con una flecha.  La flecha indica que el icono representa un men&uacute; o un caj&oacute;n. La <xref linkend="gospanel-FIG-68"/> muestra c&oacute;mo los men&uacute;s aparecen normalmente en los paneles. </para>
    <figure id="gospanel-FIG-68">
      <title>Objetos de men&uacute; habituales en un panel </title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/typical_menu.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Objetos de menú habituales en un panel.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
  </sect1>
  <sect1 id="gospanel-18">
    <title>Cajones</title>
    <indexterm>
      <primary>objetos de panel</primary>
      <secondary>cajones</secondary>
      <see>cajones</see>
    </indexterm>
    <para>Un caj&oacute;n es una extensi&oacute;n de un panel. Se puede abrir y cerrar un caj&oacute;n de la misma manera que se oculta y se vuelve a mostrar un panel. Un caj&oacute;n puede contener los mismos objetos que un panel, como lanzadores, men&uacute;s, apliques y otros objetos, adem&aacute;s de otros cajones. Al abrir el caj&oacute;n, se pueden utilizar los objetos de la misma manera que en un panel. </para>
    <para>La siguiente figura muestra un caj&oacute;n abierto que contiene dos objetos de panel. </para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/open_drawer.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Cajón abierto. El contexto describe el gráfico.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>La flecha del icono del caj&oacute;n indica que el icono representa un men&uacute; o un caj&oacute;n.</para>
    <para>Se pueden mover, a&ntilde;adir y quitar objetos de un caj&oacute;n de la misma forma que con los paneles. </para>
    <sect2 id="gospanel-42">
      <title>Para abrir y cerrar un caj&oacute;n</title>
      <indexterm>
        <primary>cajones</primary>
        <secondary>abrir</secondary>
      </indexterm>
      <indexterm>
        <primary>cajones</primary>
        <secondary>cerrar</secondary>
      </indexterm>
      <para>Para abrir un caj&oacute;n, haga clic en el objeto caj&oacute;n de un panel. Puede cerrar un caj&oacute;n de diferentes formas: </para>
      <itemizedlist>
        <listitem>
          <para>Hacer clic en el caj&oacute;n.</para>
        </listitem>
        <listitem>
          <para>Hacer clic en el bot&oacute;n de ocultaci&oacute;n del caj&oacute;n.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-420">
      <title>Para a&ntilde;adir un caj&oacute;n a un panel</title>
      <indexterm>
        <primary>cajones</primary>
        <secondary>a&ntilde;adir al panel</secondary>
      </indexterm>
      <para>Puede a&ntilde;adir un caj&oacute;n a un panel de diferentes formas: </para>
      <itemizedlist>
        <listitem>
          <para>Desde el men&uacute; emergente del panel</para>
          <para>Haga clic con el bot&oacute;n derecho en un espacio vac&iacute;o del panel y, a continuaci&oacute;n, seleccione <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Caj&oacute;n</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>Desde cualquier men&uacute;</para>
          <para>Se puede a&ntilde;adir un men&uacute; como caj&oacute;n a un panel.</para>
          <para> Para a&ntilde;adir el submen&uacute; como caj&oacute;n a un panel, abra el men&uacute; en el panel. Haga clic con el bot&oacute;n de la derecha sobre cualquier lanzadera en el men&uacute; y, a continuaci&oacute;n, seleccione <menuchoice><guimenu> Men&uacute; completo</guimenu><guimenuitem>A&ntilde;adir este caj&oacute;n al panel</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-54">
      <title>Para a&ntilde;adir un objeto a un caj&oacute;n</title>
      <indexterm>
        <primary>cajones</primary>
        <secondary>a&ntilde;adir objetos a</secondary>
      </indexterm>
      <para>Se puede a&ntilde;adir un objeto a un caj&oacute;n del mismo modo que a un panel. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="gospanel-15"/>. </para>
    </sect2>
    <sect2 id="gospanel-550">
      <title>Para modificar las propiedades de un caj&oacute;n</title>
      <indexterm>
        <primary>cajones</primary>
        <secondary>modificar propiedades</secondary>
      </indexterm>
      <para>Para modificar las preferencias de todos los paneles y cajones, seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guisubmenu>Preferencias</guisubmenu><guisubmenu>Avanzadas</guisubmenu><guimenuitem>Panel</guimenuitem></menuchoice> y, a continuaci&oacute;n, efect&uacute;e los cambios necesarios. Por ejemplo, se pueden seleccionar diversas opciones relacionadas con el aspecto y el comportamiento de los objetos en paneles y cajones. Tambi&eacute;n se pueden seleccionar opciones que s&oacute;lo afecten a los cajones. Por ejemplo, se puede seleccionar una opci&oacute;n para cerrar los cajones al hacer clic en un lanzador de uno de ellos.</para>
      <para>Tambi&eacute;n se pueden modificar otras propiedades para cada caj&oacute;n por separado. Se pueden cambiar las caracter&iacute;sticas de cada caj&oacute;n, como por ejemplo, el aspecto visual y si hay botones de ocultaci&oacute;n.</para>
      <para>Para modificar las propiedades de un caj&oacute;n, efect&uacute;e los siguientes pasos: </para>
      <orderedlist>
        <listitem>
          <para>Haga clic con el bot&oacute;n derecho en el caj&oacute;n y, a continuaci&oacute;n, seleccione  <guimenuitem>Propiedades </guimenuitem> para mostrar el cuadro de di&aacute;logo <guilabel>Propiedades del panel</guilabel>. El cuadro de di&aacute;logo mostrar&aacute; la pesta&ntilde;a  <guilabel>Caj&oacute;n</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Seleccione las propiedades del caj&oacute;n en el cuadro de di&aacute;logo. A continuaci&oacute;n se describen los elementos de la pesta&ntilde;a <guilabel>Caj&oacute;n</guilabel>: </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec2" colwidth="29.44*"/>
              <colspec colname="colspec3" colwidth="70.56*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Elemento de la ventana de di&aacute;logo</para>
                  </entry>
                  <entry valign="top">
                    <para>Descripci&oacute;n </para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Tama&ntilde;o</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Seleccione el tama&ntilde;o del caj&oacute;n. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Consejo/Nombre</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Utilice el cuadro de texto para indicar un nombre para el caj&oacute;n. El nombre aparecer&aacute; como un mensaje de ayuda al apuntar al caj&oacute;n en el panel.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Icono</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione un icono para representar el caj&oacute;n. Haga clic en el bot&oacute;n <guibutton>Icono</guibutton> para mostrar un cuadro de di&aacute;logo de selecci&oacute;n de iconos. Seleccione el icono deseado en el cuadro de di&aacute;logo. Tambi&eacute;n puede seleccionar el icono de otro directorio haciendo clic en <guibutton>Buscar</guibutton>. Cuando haya seleccionado el icono, haga clic en el bot&oacute;n <guibutton>Aceptar</guibutton>. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Activar el bot&oacute;n de ocultaci&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para mostrar un bot&oacute;n de ocultaci&oacute;n cuando se abre un caj&oacute;n. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Activar flecha del bot&oacute;n de ocultaci&oacute;n</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Seleccione esta opci&oacute;n para mostrar flechas en los botones de ocultaci&oacute;n, si &eacute;stos est&aacute;n activados.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Se puede utilizar la pesta&ntilde;a  <guilabel>Fondo</guilabel> para configurar el fondo del caj&oacute;n. Para saber c&oacute;mo completar la pesta&ntilde;a <guilabel>Fondo</guilabel> consulte la <xref linkend="gospanel-28"/>. Tambi&eacute;n se puede arrastrar un color o imagen al caj&oacute;n para definir el color o imagen del fondo del caj&oacute;n. Para obtener m&aacute;s informaci&oacute;n, consulte la <xref linkend="gospanel-39"/>.</para>
        </listitem>
        <listitem>
          <para>Haga clic en el bot&oacute;n <guibutton>Cerrar</guibutton> para cerrar el cuadro de di&aacute;logo <guilabel>Propiedades del panel</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-20">
    <title>Bot&oacute;n Terminar sesi&oacute;n</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/logout_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icono de Terminar sesión.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>objetos de panel</primary>
      <secondary>bot&oacute;n Terminar sesi&oacute;n</secondary>
    </indexterm>
    <indexterm>
      <primary>bot&oacute;n Terminar sesi&oacute;n</primary>
    </indexterm>
    <para> El bot&oacute;n <guibutton>Terminar sesi&oacute;n</guibutton> inicia el proceso para cerrar la sesi&oacute;n de GNOME. </para>
    <para>Para agregar un bot&oacute;n <guimenu>Terminar sesi&oacute;n</guimenu> a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel. Elija <menuchoice><guimenu>Agregar a panel</guimenu><guimenuitem>Bot&oacute;n Terminar sesi&oacute;n</guimenuitem></menuchoice>. Para cerrar la sesi&oacute;n o cerrar el sistema, haga clic en el bot&oacute;n <guibutton>Terminar sesi&oacute;n</guibutton>. </para>
  </sect1>
  <sect1 id="gospanel-21">
    <title>Bot&oacute;n Bloquear</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/lockscreen_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>La imagen muestra el icono de un candado que representa la función Bloquear pantalla.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>objetos de panel</primary>
      <secondary>bot&oacute;n Bloquear</secondary>
    </indexterm>
    <indexterm>
      <primary>bot&oacute;n Bloquear</primary>
    </indexterm>
    <indexterm>
      <primary>bloquear pantalla</primary>
    </indexterm>
    <para>El bot&oacute;n <guibutton>Bloquear</guibutton> bloquea la pantalla y activa el salvapantallas. Para volver a la sesi&oacute;n, se debe volver a introducir la contrase&ntilde;a. Para bloquear la pantalla correctamente, el salvapantallas tiene que estar habilitado.</para>
    <para>Para agregar un bot&oacute;n <guimenu>Bloquear</guimenu> a un panel, haga clic con el bot&oacute;n derecho del rat&oacute;n en un espacio vac&iacute;o del panel. Elija <menuchoice><guimenu>Agregar al panel</guimenu><guimenuitem>Bot&oacute;n para bloquear pantalla</guimenuitem></menuchoice>. </para>
    <para>Haga clic con el bot&oacute;n derecho del rat&oacute;n en el bot&oacute;n  <guibutton>Bloquear</guibutton> para abrir un men&uacute; de comandos relacionados con el salvapantallas. La <xref linkend="gosstartsession-TBL-83"/> describe los comandos disponibles en el men&uacute;.</para>
    <table frame="topbot" id="gosstartsession-TBL-83">
      <title>Elementos del men&uacute; Bloquear pantalla</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="43.55*"/>
        <colspec colname="colspec1" colwidth="56.45*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Elemento de men&uacute;</para>
            </entry>
            <entry valign="top">
              <para>Funci&oacute;n</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Salvapantallas</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Activa de inmediato el salvapantallas pero no bloquea la pantalla.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Bloquear la pantalla</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Bloquea la pantalla de inmediato. Este comando realiza la misma funci&oacute;n que el bot&oacute;n <guibutton>Bloquear</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Cancelar el daemon del salvapantallas</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Termina el proceso del salvapantallas. Despu&eacute;s de terminar este proceso, no se puede bloquear la pantalla.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Reiniciar el daemon del salvapantallas</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Termina y reinicia el proceso del salvapantallas. Utilice este comando despu&eacute;s de cambiar la contrase&ntilde;a. Al reiniciar el proceso del salvapantallas, s&oacute;lo ser&aacute; v&aacute;lida la nueva contrase&ntilde;a.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Propiedades</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Muestra un cuadro de di&aacute;logo <guilabel>XScreenSaver</guilabel> que se puede utilizar para configurar el salvapantallas. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
</chapter>
