  <legalnotice id="legalnotice">
	<para>
	  Se concede autorizaci&oacute;n para copiar, distribuir o modificar 
	  este documento seg&uacute;n los t&eacute;rminos de la GFDL (GNU Free 
	  Documentation Licence), Versi&oacute;n 1.1, o cualquier otra versi&oacute;n 
	  posterior publicada por Free Software Fundation sin secciones 
	  invariables, textos de portada ni textos de contraportada. 
	  Podr&aacute; encontrar una copia de la GFDL en este <ulink type="help"
	  url="ghelp:fdl">enlace</ulink> o en el archivo COPYING-DOCS 
	  distribuido con este manual.
         </para>
         <para> Este manual forma parte de una colecci&oacute;n de manuales 
          de GNOME distribuidos con la GFDL.  Si desea distribuir este 
          manual independientemente de la colecci&oacute;n, puede hacerlo 
          a&ntilde;adiendo al manual una copia de la licencia, como se describe 
          en el apartado 6 de la licencia. 
	</para>

	<para>
	  Muchos de los nombres utilizados por las empresas para 
	  diferenciar sus productos y servicios son marcas comerciales. 
	  Cuando estos nombres aparecen en cualquier documentaci&oacute;n de 
	  GNOME y dichas marcas comerciales se ponen en conocimiento de 
	  los miembros del Proyecto de documentaci&oacute;n de GNOME, entonces 
	  los nombres aparecen en may&uacute;sculas o con la inicial en may&uacute;sculas.
	</para>

	<para>
	  El DOCUMENTO Y LAS VERSIONES MODIFICADAS DEL MISMO SE 
	  PROPORCIONAN CON SUJECI&Oacute;N A LOS T&Eacute;RMINOS DE LA GFDL, QUEDANDO 
	  BIEN ENTENDIDO, ADEM&Aacute;S, QUE:

	  <orderedlist>
		<listitem>
		  <para>
                    EL DOCUMENTO SE PROPORCIONA "TAL CUAL", SIN GARANT&Iacute;AS 
                    DE NING&Uacute;N TIPO, NI EXPRESAS NI IMPL&Iacute;CITAS, INCLUYENDO, 
                    SIN LIMITACI&Oacute;N, CUALQUIER GARANT&Iacute;A DE QUE EL DOCUMENTO 
                    O UNA VERSI&Oacute;N MODIFICADA DEL MISMO CAREZCAN DE DEFECTOS, 
                    SEA COMERCIALIZABLE, ADECUADO PARA UNA FINALIDAD 
                    DETERMINADA O QUE NO CONSTITUYA NINGUNA INFRACCI&Oacute;N. 
                    TODO EL RIESGO EN CUANTO A LA CALIDAD, PRECISI&Oacute;N Y 
                    UTILIDAD DEL DOCUMENTO O DE CUALQUIER VERSI&Oacute;N 
                    MODIFICADA DEL MISMO LE CORRESPONDE A USTED. EN CASO 
                    DE QUE CUALQUIER DOCUMENTO O VERSI&Oacute;N MODIFICADA 
                    RESULTARA DEFECTUOSO EN CUALQUIER SENTIDO, SER&Aacute; USTED 
                    (Y NO EL REDACTOR INICIAL, NI EL AUTOR NI CUALQUIER 
                    PERSONA QUE HAYA CONTRIBUIDO) QUIEN ASUMIR&Aacute; EL COSTE 
                    DE CUALQUIER SERVICIO T&Eacute;CNICO, REPARACI&Oacute;N O CORRECCI&Oacute;N 
                    NECESARIOS. ESTA LIMITACI&Oacute;N DE LAS GARANT&Iacute;AS CONSTITUYE 
                    UNA PARTE ESENCIAL DE ESTA LICENCIA. NO SE AUTORIZA 
                    NING&Uacute;N USO DE CUALQUIER DOCUMENTO O VERSI&Oacute;N MODIFICADA 
                    DEL MISMO SI NO ES CON SUJECI&Oacute;N A ESTA LIMITACI&Oacute;N DE 
                    LAS GARANT&Iacute;AS; Y
		  </para>
		</listitem>
		<listitem>
		  <para>EN NINGUNA CIRCUNSTANCIA NI SEG&Uacute;N NING&Uacute;N 
		  	ARGUMENTO LEGAL, SEA POR MOTIVOS CULPOSOS 
		  	(INCLUIDA LA NEGLIGENCIA), CONTRACTUALES O 
		  	DE OTRO TIPO, NI EL AUTOR, NI EL REDACTOR 
		  	INICIAL, NI CUALQUIER COLABORADOR, NI CUALQUIER 
		  	DISTRIBUIDOR DEL DOCUMENTO O VERSI&Oacute;N MODIFICADA 
		  	DEL MISMO, NI CUALQUIER PROVEEDOR DE CUALQUIERA 
		  	DE DICHAS PARTES, SER&Aacute;N RESPONSABLES, ANTE 
		  	NING&Uacute;N TERCERO, DE NING&Uacute;N DA&Ntilde;O O PERJUICIO 
		  	DIRECTO, INDIRECTO, ESPECIAL, INCIDENTAL O 
		  	CONSIGUIENTE DE NING&Uacute;N TIPO, INCLUIDOS, SIN 
		  	LIMITACI&Oacute;N, LOS DA&Ntilde;OS POR P&Eacute;RDIDA DE FONDO DE 
		  	COMERCIO, INTERRUPCI&Oacute;N DEL TRABAJO, FALLO O MAL 
		  	FUNCIONAMIENTO INFORM&Aacute;TICO, NI CUALQUIER OTRO DA&Ntilde;O 
		  	O P&Eacute;RDIDA DERIVADOS DEL USO DEL DOCUMENTO Y LAS 
                        VERSIONES MODIFICADAS DEL MISMO, O RELACIONADO CON 
                        ELLO, INCLUSO SI SE HAB&Iacute;A COMUNICADO A AQUELLA PARTE 
                        LA POSIBILIDAD DE TALES DA&Ntilde;OS.                        
		  </para>
		</listitem>
	  </orderedlist>
	</para>
  </legalnotice>

