<?xml version="1.0" encoding="utf-8"?>
<part id="part1-1"><title>Un paseo por el escritorio de GNOME</title><partintro><para>Este apartado presenta los componentes del n&uacute;cleo central de GNOME. Tambi&eacute;n proporciona informaci&oacute;n para empezar a trabajar con el escritorio. El escritorio es ampliamente configurable, por lo que esta secci&oacute;n cubre s&oacute;lo las caracter&iacute;sticas funcionales principales. Si desea implementar todas las posibilidades de configuraci&oacute;n que se mencionan en este cap&iacute;tulo, consulte <emphasis>Personalizaci&oacute;n del escritorio de GNOME</emphasis>. Esta secci&oacute;n contiene los siguientes cap&iacute;tulos: </para><itemizedlist><listitem><para><emphasis>T&eacute;cnicas b&aacute;sicas</emphasis></para><para>Este cap&iacute;tulo contiene informaci&oacute;n acerca del uso del rat&oacute;n, las teclas de acceso directo y las t&eacute;cnicas b&aacute;sicas para trabajar con las ventanas y los cuadros de di&aacute;logo. </para></listitem><listitem><para><emphasis>Informaci&oacute;n general acerca del escritorio</emphasis></para><para>Este cap&iacute;tulo contiene informaci&oacute;n acerca de los componentes y las funciones principales del escritorio. Si no desea leer todo el manual, consulte como m&iacute;nimo este cap&iacute;tulo.</para></listitem><listitem><para><emphasis>Sesiones de escritorio</emphasis></para><para>Este cap&iacute;tulo contiene informaci&oacute;n acerca de c&oacute;mo empezar, gestionar y terminar sesiones de escritorio. </para></listitem><listitem><para><emphasis>C&oacute;mo trabajar con paneles</emphasis></para><para>Este cap&iacute;tulo ampl&iacute;a la informaci&oacute;n acerca del uso de los paneles. Los paneles son componentes clave del escritorio. En este cap&iacute;tulo se indica c&oacute;mo utilizar las diferentes partes de los paneles y c&oacute;mo invocar las funciones disponibles en el escritorio a trav&eacute;s de ellos.</para></listitem><listitem><para><emphasis>C&oacute;mo trabajar con men&uacute;s</emphasis></para><para>Este cap&iacute;tulo ampl&iacute;a la informaci&oacute;n acerca del uso de los men&uacute;s. </para></listitem><listitem><para><emphasis>C&oacute;mo trabajar con ventanas</emphasis></para><para>Este cap&iacute;tulo ampl&iacute;a la informaci&oacute;n acerca del uso de los ventanas; se describen funciones b&aacute;sicas de &eacute;stas, como mover y cambiar el tama&ntilde;o, as&iacute; como los controles que se usan con ellas. </para></listitem><listitem><para><emphasis>Gestor de archivos Nautilus</emphasis></para><para>Este cap&iacute;tulo contiene informaci&oacute;n acerca del gestor de archivos <application>Nautilus</application>; se explica c&oacute;mo utilizarlo<application/> para trabajar con el sistema de archivos y c&oacute;mo personalizarlo<application/>.</para></listitem><listitem><para><emphasis>Uso del fondo del escritorio</emphasis></para><para>Este cap&iacute;tulo contiene informaci&oacute;n acerca de c&oacute;mo usar el fondo del escritorio; se describe c&oacute;mo utilizar &eacute;ste para iniciar aplicaciones y abrir archivos o carpetas. Tambi&eacute;n se hace hincapi&eacute; en c&oacute;mo utilizar la <guilabel>Papelera</guilabel> y el men&uacute; <guimenu>Fondo del escritorio</guimenu> y en c&oacute;mo personalizar el fondo del escritorio.</para></listitem></itemizedlist></partintro>&gosbasic;
&gosoverview;
&gosstartsession;
&gospanel;
&goseditmainmenu;
&gosmetacity;
&gosnautilus;
&gosdeskback;</part>
