<?xml version="1.0" encoding="utf-8"?>
<part id="part2-1"><title>Personalizaci&oacute;n del escritorio de GNOME</title><partintro><para>Se pueden personalizar muchas de las caracter&iacute;sticas del escritorio. La personalizaci&oacute;n de cada aspecto del escritorio se controla mediante una herramienta de software especializada llamada Herramienta de preferencias del escritorio. Para mayor comodidad, las herramientas de preferencias del escritorio est&aacute;n agrupadas en:</para><itemizedlist><listitem><para>B&aacute;sicas</para></listitem><listitem><para><guilabel>Accesibilidad</guilabel></para></listitem><listitem><para><guilabel>Avanzadas</guilabel></para></listitem></itemizedlist><para>Las herramientas de preferencias del escritorio se pueden abrir de diversas maneras: </para><itemizedlist><listitem><para>Seleccione <menuchoice><guimenu>Aplicaciones</guimenu><guimenuitem>Preferencias</guimenuitem></menuchoice>. Seleccione la herramienta que necesite en los submen&uacute;s. </para></listitem><listitem><para>Haga doble clic en el objeto <guilabel>Empezar aqu&iacute;</guilabel> del fondo del escritorio. Se abrir&aacute; una ventana de <application>Nautilus</application> que mostrar&aacute; el contenido de <guilabel>Empezar aqu&iacute;</guilabel>. Haga doble clic en el objeto <guilabel>Preferencias</guilabel> en la ventana de <application>Nautilus</application> para ver las herramientas de preferencias. Haga doble clic en la herramienta que desee. </para></listitem></itemizedlist><para>Esta secci&oacute;n describe c&oacute;mo configurar el escritorio en los siguientes cap&iacute;tulos. </para><itemizedlist><listitem><para><emphasis>Uso de las herramientas de preferencias b&aacute;sicas</emphasis></para><para>Lea este cap&iacute;tulo para aprender a personalizar el fondo del escritorio. Contiene informaci&oacute;n acerca de c&oacute;mo configurar los valores del teclado y del rat&oacute;n. Describe c&oacute;mo configurar las teclas de acceso, las preferencias de sonido y el proxy de red. Explica c&oacute;mo seleccionar un tema y el tipo de letra del escritorio; c&oacute;mo personalizar las barras de men&uacute; y herramientas de las aplicaciones; y c&oacute;mo personalizar el comportamiento del foco de la ventana. </para></listitem><listitem><para><emphasis>Uso de las herramientas de preferencias avanzadas</emphasis></para><para>Este cap&iacute;tulo describe c&oacute;mo configurar los tipos de archivos, las aplicaciones preferidas y los paneles. Tambi&eacute;n contiene informaci&oacute;n acerca de c&oacute;mo personalizar las sesiones y los programas de inicio. </para></listitem><listitem><para><emphasis>Uso de las herramientas de preferencias de accesibilidad</emphasis></para><para>Lea este cap&iacute;tulo para aprender a utilizar las funciones de accesibilidad del escritorio. Tambi&eacute;n c&oacute;mo utilizar las funciones de accesibilidad del teclado. </para></listitem></itemizedlist></partintro>&goscustdesk;
&goscustlookandfeel;
&goscustaccess;</part>
