<?xml version="1.0" encoding="utf-8"?>
<glossary id="glossary-1">
  <title>Glossaire</title>
  <glossentry id="glossary-21">
    <glossterm>adresse IP</glossterm>
    <glossdef>
      <para>Identificateur num&eacute;rique unique d'un ordinateur sur un r&eacute;seau. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-16">
    <glossterm>affichage</glossterm>
    <glossdef>
      <para>Composant <application>Nautilus</application> vous permettant d'afficher un dossier d'une mani&egrave;re particuli&egrave;re. Par exemple, <application>Nautilus </application> contient un affichage &quot;ic&ocirc;nes&quot; qui vous permet de visualiser le contenu d'un dossier sous la forme d'ic&ocirc;nes. Il propose &eacute;galement un affichage &quot;liste&quot; qui pr&eacute;sente le contenu d'un dossier sous la forme d'une liste. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-17">
    <glossterm>afficheur</glossterm>
    <glossdef>
      <para>Composant <application>Nautilus</application> vous permettant de visualiser un type particulier de fichier dans le volet d'affichage. Un afficheur peut ajouter les &eacute;l&eacute;ments pertinents pour le type de fichier dans les menus Nautilus. Elle vous permet &eacute;galement d'utiliser les boutons de zoom <application>Nautilus </application> pour modifier la taille de l'&eacute;l&eacute;ment pr&eacute;sent&eacute; dans le volet d'affichage. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-6">
    <glossterm>applet</glossterm>
    <glossdef>
      <para>Une applet est une petite application interactive qui r&eacute;side dans un tableau de bord, par exemple le <application>Lecteur CD</application>. Chacune poss&egrave;de une interface utilisateur simple dont vous pouvez vous servir &agrave; l'aide de la souris ou du clavier. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-10">
    <glossterm>application compatible GNOME</glossterm>
    <glossdef>
      <para>Les applications qui utilisent les biblioth&egrave;ques de programmation standard de GNOME sont appel&eacute;es applications compatibles GNOME. C'est notamment le cas de <application>Nautilus </application> et de <application>gedit</application>. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-13">
    <glossterm>barre d'&eacute;tat</glossterm>
    <glossdef>
      <para>La barre d'&eacute;tat est situ&eacute;e en bas d'une fen&ecirc;tre. Elle fournit des informations relatives &agrave; l'&eacute;tat actuel des objets affich&eacute;s dans celle-ci. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-12">
    <glossterm>barre d'outils</glossterm>
    <glossdef>
      <para>La barre d'outils contient des boutons correspondant aux commandes les plus fr&eacute;quemment utilis&eacute;es d'une application. G&eacute;n&eacute;ralement, elle appara&icirc;t sous la barre de menus. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-11">
    <glossterm>barre de menus</glossterm>
    <glossdef>
      <para>La barre de menus est situ&eacute;e en haut d'une fen&ecirc;tre d'application. Elle contient les menus de celle-ci. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-7">
    <glossterm>espace de travail</glossterm>
    <glossdef>
      <para>Un espace de travail est une zone discr&egrave;te du bureau dans laquelle vous pouvez travailler. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-23">
    <glossterm>formater</glossterm>
    <glossdef>
      <para>Formater un support consiste &agrave; le pr&eacute;parer &agrave; &ecirc;tre utilis&eacute; avec un syst&egrave;me de fichiers donn&eacute;. Lorsque vous formatez un support, vous &eacute;crasez toutes les informations pr&eacute;sentes sur celui-ci. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-18">
    <glossterm>i-noeud</glossterm>
    <glossdef>
      <para>Structure de donn&eacute;es contenant des informations relatives &agrave; chaque fichier des syst&egrave;mes de fichiers UNIX. Chaque fichier poss&egrave;de un i-noeud. Un i-noeud contient le noeud, le type, le propri&eacute;taire et l'emplacement d'un fichier. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-3">
    <glossterm>lanceur</glossterm>
    <glossdef>
      <para>Un lanceur d&eacute;marre une application donn&eacute;e, ex&eacute;cute une commande ou ouvre un fichier. Il peut r&eacute;sider dans un tableau de bord ou dans un menu.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-28">
    <glossterm>lien symbolique</glossterm>
    <glossdef>
      <para>Un type particulier de fichier pointant vers un autre fichier ou dossier. Lorsque vous ex&eacute;cutez une action sur un lien symbolique, celle-ci s'applique au fichier ou dossier sur lequel pointe le lien. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-24">
    <glossterm>monter</glossterm>
    <glossdef>
      <para><firstterm>monter</firstterm> signifie rendre un syst&egrave;me de fichiers accessible. Lorsque vous montez un syst&egrave;me de fichiers, celui-ci est attach&eacute; &agrave; votre syst&egrave;me de fichiers sous la forme d'un sous-r&eacute;pertoire. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-20">
    <glossterm>Nom DNS</glossterm>
    <glossdef>
      <para>Identificateur alphab&eacute;tique unique d'un ordinateur sur un r&eacute;seau. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-9">
    <glossterm>objet de l'arri&egrave;re-plan du bureau</glossterm>
    <glossdef>
      <para>Ic&ocirc;ne situ&eacute;e sur l'arri&egrave;re-plan du bureau permettant d'ouvrir des fichiers, des dossiers et des applications. Vous pouvez utiliser ce type d'objet pour acc&eacute;der ais&eacute;ment aux fichiers, aux dossiers et aux applications fr&eacute;quemment utilis&eacute;s.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-2">
    <glossterm>outil de pr&eacute;f&eacute;rence</glossterm>
    <glossdef>
      <para>Outil logiciel d&eacute;di&eacute; qui contr&ocirc;le un aspect donn&eacute; du comportement du bureau.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-15">
    <glossterm>pile</glossterm>
    <glossdef>
      <para>La pile constitue l'ordre dans lequel sont empil&eacute;es les fen&ecirc;tres sur votre &eacute;cran. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-25">
    <glossterm>raccourci clavier</glossterm>
    <glossdef>
      <para>Un <firstterm>raccourci clavier</firstterm> est une touche ou une combinaison de touches permettant d'effectuer une action d'une mani&egrave;re autre que la m&eacute;thode standard. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-8">
    <glossterm>tiroir</glossterm>
    <glossdef>
      <para>Un tiroir repr&eacute;sente une extension coulissante d'un tableau de bord dont l'ouverture et la fermeture s'effectuent &agrave; partir d'une ic&ocirc;ne de tiroir. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-26">
    <glossterm>touche de raccourci </glossterm>
    <glossdef>
      <para>Il s'agit de raccourcis clavier permettant de faire d&eacute;marrer des applications. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-5">
    <glossterm>touches de raccourci</glossterm>
    <glossdef>
      <para>Les touches de raccourci sont des frappes de touche permettant d'ex&eacute;cuter rapidement une action. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-22">
    <glossterm>tranche </glossterm>
    <glossdef>
      <para>Partition d'un disque. Vous pouvez cr&eacute;er des tranches sur vos supports Zip et Jaz. Un objet appara&icirc;t pour chacune d'entre elles sur l'arri&egrave;re-plan du bureau.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-27">
    <glossterm>type MIME</glossterm>
    <glossdef>
      <para>Un type MIME (Multipurpose Internet Mail Extension) permet d'identifier le format d'un fichier. Le type MIME permet aux applications de lire le fichier. Ainsi, une application de courrier &eacute;lectronique peut utiliser le <literal>image/png</literal> type MIME afin de d&eacute;tecter qu'un fichier PNG (Portable Networks Graphic) est attach&eacute; au message.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-19">
    <glossterm>URL (Uniform Resource Locator)</glossterm>
    <glossdef>
      <para>Une URL (Uniform Resource Locator) repr&eacute;sente l'adresse d'un emplacement donn&eacute; sur le Web.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-4">
    <glossterm>volet</glossterm>
    <glossdef>
      <para>Un volet constitue une subdivision d'une fen&ecirc;tre. Par exemple, la fen&ecirc;tre <application> Nautilus</application> contient un volet lat&eacute;ral et un volet d'affichage. </para>
    </glossdef>
  </glossentry>
</glossary>
