<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustdesk-6">
  <title>Utilisation des outils de pr&eacute;f&eacute;rence de base</title>
  <highlights>
    <para>Les outils de pr&eacute;f&eacute;rence de base vous permettent de personnaliser l'arri&egrave;re-plan de votre bureau. Il est &eacute;galement possible de les utiliser pour configurer les param&egrave;tres du clavier et de la souris. Vous pouvez aussi les utiliser pour d&eacute;finir les touches de raccourci, les pr&eacute;f&eacute;rences de son et le proxy r&eacute;seau. Vous pouvez  aussi les employer pour choisir un th&egrave;me ou une police pour votre bureau ainsi que pour personnaliser les barres de menus et d'outils des applications. Ils vous permettent &eacute;galement de personnaliser le comportement des fen&ecirc;tres &agrave; l'activation.</para>
    <para>Ce chapitre d&eacute;crit l'utilisation des outils de pr&eacute;f&eacute;rence de base dans le but de personnaliser le bureau.</para>
  </highlights>
  <sect1 id="goscustdesk-37">
    <title>Ouverture d'un outil de pr&eacute;f&eacute;rence de base</title>
    <para>Vous pouvez ouvrir les outils de pr&eacute;f&eacute;rence de base en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>Dans le menu <guimenu>Pr&eacute;f&eacute;rences</guimenu> :</para>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Pr&eacute;f&eacute;rences du bureau</guimenuitem></menuchoice>. S&eacute;lectionnez l'outil de pr&eacute;f&eacute;rence requis dans le sous-menu. La bo&icirc;te de dialogue relative &agrave; celui-ci s'affiche.</para>
      </listitem>
      <listitem>
        <para>Depuis l'emplacement <guilabel>D&eacute;marrer ici</guilabel> :</para>
        <para>Ouvrez une fen&ecirc;tre <application>Nautilus</application>, puis s&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici</guimenuitem></menuchoice>. Vous pouvez &eacute;galement cliquer deux fois sur l'objet <guilabel>D&eacute;marrer ici</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. L'emplacement <guilabel>D&eacute;marrer ici</guilabel> s'affiche. Cliquez deux fois sur l'objet <guilabel>Pr&eacute;f&eacute;rences</guilabel> de la fen&ecirc;tre <application>Nautilus</application> pour afficher vos outils de pr&eacute;f&eacute;rence. </para>
        <para>Cliquez deux fois sur l'outil requis. La bo&icirc;te de dialogue relative &agrave; celui-ci s'affiche.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustdesk-7">
    <title>Personnalisation de l'arri&egrave;re-plan de l'outil</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary>personnalisation</secondary>
    </indexterm>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence du bureau</primary>
      <see>outils de pr&eacute;f&eacute;rence</see>
    </indexterm>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary> Arri&egrave;re-plan</secondary>
    </indexterm>
    <indexterm>
      <primary>arri&egrave;re-plans</primary>
      <secondary>personnalisation de l'arri&egrave;re-plan du bureau</secondary>
    </indexterm>
    <para>L'arri&egrave;re-plan du bureau d&eacute;signe la partie du bureau qui ne contient aucun &eacute;l&eacute;ment d'interface graphique, tels que des tableaux de bord ou des fen&ecirc;tres. L'arri&egrave;re-plan du bureau se situe toujours sous les autres &eacute;l&eacute;ments d'interface.</para>
    <para>Vous pouvez personnaliser l'arri&egrave;re-plan du bureau en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>S&eacute;lectionnez une image &agrave; afficher sur l'arri&egrave;re-plan du bureau. L'image est surimpos&eacute;e &agrave; la couleur de l'arri&egrave;re-plan du bureau. Celle-ci reste visible si vous s&eacute;lectionnez une image transparente ou si l'image ne recouvre pas l'ensemble de l'arri&egrave;re-plan.</para>
      </listitem>
      <listitem>
        <para>S&eacute;lectionnez une couleur pour l'arri&egrave;re-plan du bureau. Vous pouvez s&eacute;lectionner une couleur unie ou cr&eacute;er un d&eacute;grad&eacute; avec deux couleurs. Un d&eacute;grad&eacute; est un effet visuel dans lequel une couleur se fond progressivement en une autre couleur. </para>
      </listitem>
    </itemizedlist>
    <para>Vous pouvez &eacute;galement modifier l'apparence de l'arri&egrave;re-plan de votre bureau depuis le gestionnaire de fichiers <application>Nautilus</application>.</para>
    <para><xref linkend="goscustdesk-TBL-14"/> &eacute;num&egrave;re les param&egrave;tres configurables de l'arri&egrave;re-plan.</para>
    <table frame="topbot" id="goscustdesk-TBL-14">
      <title>Param&egrave;tres de l'arri&egrave;re-plan du bureau</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>&Eacute;l&eacute;ment</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>S&eacute;lectionner une image</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>S&eacute;lectionnez une image &agrave; afficher sur l'arri&egrave;re-plan du bureau. Pour choisir une image, cliquez sur le bouton <guibutton>S&eacute;lectionner une image</guibutton>. Une bo&icirc;te de dialogue de s&eacute;lection d'image s'affiche. Utilisez la bo&icirc;te de dialogue pour s&eacute;lectionner une image. Lorsque vous s&eacute;lectionnez une image, cliquez sur <guibutton>OK</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Options d'image</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Les options suivantes permettent de sp&eacute;cifier comment une image doit s'afficher.</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Papier peint</guilabel> :R&eacute;p&egrave;te l'image de mani&egrave;re &agrave; recouvrir l'arri&egrave;re-plan du bureau.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Centr&eacute;</guilabel> :Affiche l'image au centre de l'arri&egrave;re-plan du bureau.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Redimensionn&eacute;</guilabel> : Agrandit l'image jusqu'&agrave; ce que celle-ci atteigne les bords de l'&eacute;cran et veille au respect de ses proportions.</para>
                </listitem>
                <listitem>
                  <para><guilabel>&Eacute;tir&eacute;</guilabel> :Agrandit l'image jusqu'&agrave; ce qu'elle recouvre l'arri&egrave;re-plan du bureau, mais ne respecte pas ses proportions.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Aucune image</guilabel> :N'affiche aucune image.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para><guilabel>Style de l'arri&egrave;re-plan</guilabel> :</para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Les options de la zone de liste d&eacute;roulante <guilabel>Style de l'arri&egrave;re-plan</guilabel> et les boutons de s&eacute;lection de couleur vous permettent de sp&eacute;cifier les couleurs.</para>
              <para>Vous pouvez sp&eacute;cifier les couleurs en recourant aux m&eacute;thodes suivantes :</para>
              <itemizedlist>
                <listitem>
                  <para>S&eacute;lectionnez <guilabel>Couleur unie</guilabel> dans la zone de liste d&eacute;roulante <guilabel>Style de l'arri&egrave;re-plan</guilabel> afin de sp&eacute;cifier une couleur pour l'arri&egrave;re-plan. </para>
                  <para>Pour choisir la couleur requise, cliquez sur le bouton<guibutton>Couleur</guibutton>. La bo&icirc;te de dialogue <guilabel>Choisir une couleur</guilabel> s'affiche. Choisissez une couleur, puis cliquez sur <guibutton>OK</guibutton>.</para>
                </listitem>
                <listitem>
                  <para>S&eacute;lectionnez <guilabel>D&eacute;grad&eacute; horizontal</guilabel> dans la zone de liste d&eacute;roulante  <guilabel>Style de l'arri&egrave;re-plan</guilabel>. Cette option cr&eacute;e un d&eacute;grad&eacute; du bord droit au bord gauche de l'&eacute;cran.</para>
                  <para>Cliquez sur le bouton <guibutton>Couleur gauche</guibutton>pour afficher la bo&icirc;te de dialogue <guilabel>Choisir une couleur</guilabel>. Choisissez la couleur &agrave; afficher au bord de gauche.</para>
                  <para>Cliquez sur le bouton <guibutton>Couleur droite</guibutton>. S&eacute;lectionnez la couleur &agrave; afficher au bord de droite.</para>
                </listitem>
                <listitem>
                  <para>S&eacute;lectionnez <guilabel>D&eacute;grad&eacute; vertical</guilabel> dans la zone de liste d&eacute;roulante <guilabel>Style de l'arri&egrave;re-plan</guilabel>. Cette option cr&eacute;e un d&eacute;grad&eacute; du bord sup&eacute;rieur au bord inf&eacute;rieur de l'&eacute;cran.</para>
                  <para>Cliquez sur le bouton <guibutton>Couleur haut</guibutton> pour faire appara&icirc;tre la bo&icirc;te de dialogue <guilabel>Choisir une couleur</guilabel>. Choisissez la couleur &agrave; afficher au bord sup&eacute;rieur.</para>
                  <para>Cliquez sur le bouton <guibutton>Couleur bas</guibutton>. Choisissez la couleur &agrave; afficher au bord inf&eacute;rieur.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustdesk-38">
    <title>S&eacute;lection des polices par d&eacute;faut</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>Police</secondary>
    </indexterm>
    <indexterm>
      <primary>polices</primary>
      <secondary>arri&egrave;re-plan du bureau</secondary>
    </indexterm>
    <indexterm>
      <primary>polices</primary>
      <secondary>applications </secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Police</application> vous permet de s&eacute;lectionner les polices &agrave; utiliser dans vos applications et sur l'arri&egrave;re-plan du bureau.</para>
    <para><xref linkend="goscustdesk-TBL-26"/> &eacute;num&egrave;re les param&egrave;tres configurables des polices.</para>
    <table frame="topbot" id="goscustdesk-TBL-26">
      <title>Param&egrave;tres de police</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec18" colwidth="19.21*"/>
        <colspec colname="colspec19" colwidth="46.79*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Option</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Police des applications</guilabel>
              </para>
            </entry>
            <entry colsep="0" rowsep="0" valign="top">
              <para>Le bouton de s&eacute;lection de police permet de choisir une police &agrave; utiliser dans les applications. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Police du bureau</guilabel>
              </para>
            </entry>
            <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
              <para>Le bouton de s&eacute;lection de police vous permet de choisir une police &agrave; utiliser sur votre arri&egrave;re-plan de bureau uniquement. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustperiph-2">
    <title>Configuration des param&egrave;tres du clavier</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>Clavier</secondary>
    </indexterm>
    <indexterm>
      <primary>clavier</primary>
      <secondary>configuration des pr&eacute;f&eacute;rences g&eacute;n&eacute;rales</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Clavier</application> vous permet de s&eacute;lectionner des param&egrave;tres de r&eacute;p&eacute;tition automatique ainsi que de configurer des &eacute;v&eacute;nements sonores associ&eacute;s au clavier. </para>
    <para>Vous pouvez personnaliser les param&egrave;tres de l'outil de pr&eacute;f&eacute;rence <application>Clavier</application> dans les zones fonctionnelles suivantes :</para>
    <itemizedlist>
      <listitem>
        <para><guilabel>Clavier</guilabel> ;</para>
      </listitem>
      <listitem>
        <para><guilabel>Son</guilabel>.</para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustdesk-40">
      <title>Param&egrave;tres du clavier</title>
      <para>L'onglet <guilabel>Clavier</guilabel> vous permet de d&eacute;finir les pr&eacute;f&eacute;rences g&eacute;n&eacute;rales du clavier. Pour d&eacute;marrer l'outil de pr&eacute;f&eacute;rence <emphasis> accessibilit&eacute;</emphasis><application>Clavier</application>, &agrave; savoir, <application>AccessX</application>, cliquez sur le bouton <guibutton>Accessibilit&eacute;</guibutton>.</para>
      <para><xref linkend="goscustperiph-TBL-3"/> &eacute;num&egrave;re les param&egrave;tres configurables du clavier.</para>
      <table frame="topbot" id="goscustperiph-TBL-3">
        <title>Param&egrave;tres du clavier</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>R&eacute;p&eacute;tition clavier si la touche est maintenue</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Cette option vous permet d'activer la r&eacute;p&eacute;tition du clavier. Si cette fonction est active, l'action associ&eacute;e &agrave; une touche se r&eacute;p&egrave;te lorsque vous maintenez celle-ci enfonc&eacute;e. Par exemple, si vous maintenez une touche de caract&egrave;re enfonc&eacute;e, celui-ci est entr&eacute; plusieurs fois.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> D&eacute;lai</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>S&eacute;lectionnez le d&eacute;lai qui doit s'&eacute;couler entre la pression d'une touche et la r&eacute;p&eacute;tition de l'action.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Vitesse</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>S&eacute;lectionnez la vitesse de r&eacute;p&eacute;tition de l'action. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Clignote dans les zones de texte et les champs</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Cette option permet au curseur de clignoter dans les champs et dans les zones de texte.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Vitesse</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Le curseur vous permet de sp&eacute;cifier la vitesse de clignotement du curseur dans les champs et les zones de texte.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-41">
      <title>Param&egrave;tres de son</title>
      <indexterm>
        <primary>clavier</primary>
        <secondary>configuration des pr&eacute;f&eacute;rences de son</secondary>
      </indexterm>
      <indexterm>
        <primary>son</primary>
        <secondary>configuration des pr&eacute;f&eacute;rences du clavier</secondary>
      </indexterm>
      <para>L'onglet <guilabel>Son</guilabel> vous permet de d&eacute;finir les pr&eacute;f&eacute;rences relatives au son du clavier.</para>
      <para>Certaines applications diffusent un son de cloche pour signaler une erreur de saisie clavier. Les options de l'onglet <guilabel>Son</guilabel> vous permettent de configurer ce son. <xref linkend="goscustdesk-TBL-1"/> &eacute;num&egrave;re les param&egrave;tres configurables pour le son du clavier.</para>
      <table frame="topbot" id="goscustdesk-TBL-1">
        <title>Param&egrave;tres du son du clavier</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0">
                <para>
                  <guilabel>D&eacute;sactiv&eacute;</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0">
                <para>Cette option permet de d&eacute;sactiver le son du clavier.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Bip</guilabel>
                </para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Cette option permet d'activer le son du clavier.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-39">
    <title>Personnalisation des raccourcis clavier</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>raccourcis clavier</secondary>
    </indexterm>
    <indexterm>
      <primary>touches de raccourci</primary>
      <secondary> configuration</secondary>
    </indexterm>
    <indexterm>
      <primary>raccourcis clavier</primary>
      <secondary>configuration</secondary>
    </indexterm>
    <indexterm>
      <primary>raccourcis clavier</primary>
      <secondary>configuration</secondary>
    </indexterm>
    <para>Un <firstterm>raccourci clavier</firstterm> est une touche ou une combinaison de touches permettant d'effectuer une action d'une mani&egrave;re autre que la m&eacute;thode standard. </para>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Raccourcis clavier</application> affiche les raccourcis par d&eacute;faut. Vous pouvez personnaliser ceux-ci afin de les adapter &agrave; vos besoins. </para>
    <para>Vous pouvez &eacute;galement cr&eacute;er des <firstterm>touches de raccourci</firstterm>. Il s'agit de raccourcis clavier permettant de faire d&eacute;marrer des applications. </para>
    <para><xref linkend="goscustdesk-TBL-3"/> &eacute;num&egrave;re les param&egrave;tres personnalisables des raccourcis clavier.</para>
    <table frame="topbot" id="goscustdesk-TBL-3">
      <title>Param&egrave;tres par d&eacute;faut des raccourcis clavier</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="36.11*"/>
        <colspec colname="colspec1" colwidth="63.89*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option</para>
            </entry>
            <entry valign="top">
              <para> Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Raccourcis d'&eacute;dition de texte </guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>S&eacute;lectionnez l'un des param&egrave;tres suivants :</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>D&eacute;faut</guilabel> :Ce param&egrave;tre vous permet d'utiliser les touches de raccourci standard.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Emacs</guilabel>:Ce param&egrave;tre vous permet d'utiliser les touches de raccourci <application>Emacs</application>.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Raccourcis du bureau </guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette table r&eacute;pertorie les actions et les touches de raccourci associ&eacute;es &agrave; chaque action. </para>
              <para>Pour modifier les touches de raccourci d'une action, cliquez sur l'action pour la s&eacute;lectionner, puis cliquez sur son raccourci. Appuyez sur les touches que vous souhaitez affecter &agrave; l'action.</para>
              <para>Pour d&eacute;sactiver les touches de raccourci d'une action, cliquez deux fois sur l'action, puis cliquez sur son raccourci. Appuyez sur <keycap>Effacement arri&egrave;re</keycap>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Raccourcis personnalis&eacute;s </guilabel>
              </para>
            </entry>
            <entry colname="colspec1">
              <para>Pour ajouter une touche de raccourci, proc&eacute;dez comme suit :</para>
              <orderedlist>
                <listitem>
                  <para>Cliquez sur <guibutton>Nouveau</guibutton>. Une bo&icirc;te de dialogue <guilabel>Liaison personnalis&eacute;e </guilabel> s'affiche. Entrez la commande &agrave; associer &agrave; la touche de raccourci dans la zone <guilabel>Nouvelle commande</guilabel>. Le bouton <guibutton>Parcourir</guibutton> vous permet &eacute;galement de rechercher la commande. Lorsque vous avez s&eacute;lectionn&eacute; la commande, cliquez sur <guibutton>OK</guibutton>. La commande est ajout&eacute;e &agrave; la section <guilabel>Raccourcis personnalis&eacute;s</guilabel> de la table <guilabel> Raccourcis du bureau</guilabel>.</para>
                </listitem>
                <listitem>
                  <para>Cliquez dans la colonne <guilabel>Raccourcis</guilabel> de la commande dans la section <guilabel>Liaison personnalis&eacute;e</guilabel> de la table <guilabel>Raccourcis du bureau</guilabel>. Appuyez sur la touche ou sur la combinaison de touches &agrave; associer avec la commande. </para>
                </listitem>
              </orderedlist>
              <para>Pour &eacute;diter un raccourci clavier, s&eacute;lectionnez-le dans la section <guilabel> Raccourcis personnalis&eacute;s</guilabel> de la table <guilabel>Raccourcis du bureau</guilabel>, puis cliquez sur <guibutton>&Eacute;diter</guibutton>. &Eacute;ditez la commande dans la bo&icirc;te de dialogue <guilabel> Liaison personnalis&eacute;e</guilabel>.</para>
              <para>Pour supprimer un raccourci clavier, s&eacute;lectionnez-le dans la section <guilabel> Raccourcis personnalis&eacute;s</guilabel> de la table <guilabel>Raccourcis du bureau</guilabel>, puis cliquez sur <guibutton>Supprimer</guibutton>. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustuserinter-2">
    <title>Personnalisation des menus et des barres d'outils dans les applications</title>
    <indexterm>
      <primary>barres d'outils, personnalisation de l'apparence</primary>
    </indexterm>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>Menus &amp; Barres d'outils</secondary>
    </indexterm>
    <indexterm>
      <primary>menus</primary>
      <secondary>dans les applications, personnalisation de l'apparence</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application> Menus &amp; barres d'outils</application> vous permet de personnaliser l'apparence des menus, des barres d'outils et des barres de menus des applications compatibles GNOME.</para>
    <para><xref linkend="goscustuserinter-TBL-8"/> &eacute;num&egrave;re les param&egrave;tres de menu et de barre d'outils personnalisables pour les applications compatibles GNOME. </para>
    <table frame="topbot" id="goscustuserinter-TBL-8">
      <title>Param&egrave;tres de personnalisation des applications</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Option</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> &Eacute;tiquettes des boutons</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>S&eacute;lectionnez l'une des options suivantes afin de sp&eacute;cifier les &eacute;l&eacute;ments affich&eacute;s sur les barres d'outils dans les applications compatibles GNOME.</para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Texte sous les ic&ocirc;nes</guilabel>:Cette option permet d'afficher les barres d'outils avec une ic&ocirc;ne et une &eacute;tiquette sur chaque bouton. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Texte &agrave; c&ocirc;t&eacute; des ic&ocirc;nes</guilabel>: Cette option vous permet d'afficher des barres d'outils contenant uniquement une ic&ocirc;ne sur chaque bouton, avec du texte sur les principaux boutons.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Ic&ocirc;nes seulement</guilabel>:Cette option vous permet d'afficher des barres d'outils ne contenant qu'une ic&ocirc;ne sur chaque bouton.</para>
                </listitem>
                <listitem>
                  <para><guilabel>Texte seulement</guilabel>:Cette option vous permet d'afficher des barres d'outils ne contenant que du texte sur chaque bouton.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> Les barres d'outils sont d&eacute;tachables et d&eacute;pla&ccedil;ables</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Cette option vous permet de d&eacute;placer les barres d'outils des fen&ecirc;tres d'application vers n'importe quel emplacement du bureau. Si vous s&eacute;lectionnez cette option, des poign&eacute;es apparaissent &agrave; gauche des barres d'outils dans vos applications. Pour d&eacute;placer une barre d'outils, cliquez sur la poign&eacute;e en appuyant sur le bouton gauche, puis faites glisser la barre vers un nouvel emplacement.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> Afficher les ic&ocirc;nes dans les menus</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Cette option vous permet d'afficher une ic&ocirc;ne &agrave; c&ocirc;t&eacute; de chaque &eacute;l&eacute;ment d'un menu. Certains &eacute;l&eacute;ments de menu ne poss&egrave;dent pas d'ic&ocirc;ne.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustperiph-5">
    <title>Configuration des param&egrave;tres de la souris</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>souris</secondary>
    </indexterm>
    <indexterm>
      <primary>souris</primary>
      <secondary>configuration</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Souris</application> vous permet de configurer votre souris pour un droitier ou pour un gaucher. Vous pouvez &eacute;galement sp&eacute;cifier la vitesse et la sensibilit&eacute; des d&eacute;placements de la souris.</para>
    <para>Vous pouvez personnaliser les param&egrave;tres de l'outil de pr&eacute;f&eacute;rence <application>Souris</application> dans les zones fonctionnelles suivantes :</para>
    <itemizedlist>
      <listitem>
        <para><guilabel>Boutons</guilabel> ;</para>
      </listitem>
      <listitem>
        <para><guilabel>Curseurs</guilabel> ;</para>
      </listitem>
      <listitem>
        <para><guilabel>D&eacute;placement</guilabel>.</para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustdesk-55">
      <title>Param&egrave;tres des boutons</title>
      <para>L'onglet <guilabel>Boutons</guilabel> vous permet de sp&eacute;cifier si les boutons de la souris sont configur&eacute;s pour un gaucher. Vous pouvez &eacute;galement sp&eacute;cifier le d&eacute;lai qui peut s'&eacute;couler entre deux clics pour que ceux-ci soient consid&eacute;r&eacute;s comme un double-clic.</para>
      <para><xref linkend="goscustperiph-TBL-6"/> &eacute;num&egrave;re les param&egrave;tres configurables des boutons de la souris.</para>
      <table frame="topbot" id="goscustperiph-TBL-6">
        <title>Param&egrave;tres des boutons de la souris</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Souris pour gaucher</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Cette option vous permet de configurer votre souris pour un gaucher. Lorsque vous configurez votre souris pour un gaucher, les fonctions des boutons gauche et droit sont invers&eacute;es.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>D&eacute;lai</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Ce curseur vous permet de sp&eacute;cifier le d&eacute;lai qui peut s'&eacute;couler entre deux clics pour que ceux-ci soient consid&eacute;r&eacute;s comme un double-clic. Si l'intervalle entre les clics d&eacute;passe ce d&eacute;lai, l'action est interpr&eacute;t&eacute;e comme deux clics distincts. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-54">
      <title>Param&egrave;tres du pointeur</title>
      <para>L'onglet <guilabel>Curseurs</guilabel> vous permet de d&eacute;finir vos pr&eacute;f&eacute;rences en mati&egrave;re de pointeur de souris.</para>
      <para><xref linkend="goscustdesk-TBL-45"/> &eacute;num&egrave;re les param&egrave;tres configurables des pointeurs de la souris.</para>
      <table frame="topbot" id="goscustdesk-TBL-45">
        <title>Param&egrave;tres des pointeurs de la souris</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="50*"/>
          <colspec colname="colspec1" colwidth="50*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Option</para>
              </entry>
              <entry valign="top">
                <para> Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Th&egrave;me de curseur</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>S&eacute;lectionnez le th&egrave;me du pointeur de la souris requis dans la zone de liste. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <guilabel>Afficher la position du curseur lorsque la touche Ctrl est enfonc&eacute;e</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Cette option permet d'activer l'animation d'un pointeur lorsque vous appuyez sur la touche <keycap>Ctrl</keycap>. Elle peut vous aider &agrave; localiser le pointeur de la souris.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-53">
      <title>Param&egrave;tres de mouvement</title>
      <para>L'onglet <guilabel>D&eacute;placement</guilabel> vous permet de d&eacute;finir vos pr&eacute;f&eacute;rences en termes de d&eacute;placement de la souris.</para>
      <para><xref linkend="goscustdesk-TBL-47"/> &eacute;num&egrave;re les param&egrave;tres configurables de mouvement de la souris.</para>
      <table frame="topbot" id="goscustdesk-TBL-47">
        <title>Param&egrave;tres des mouvements de la souris</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="30.10*"/>
          <colspec colwidth="69.90*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Param&egrave;tre</para>
              </entry>
              <entry valign="top">
                <para> Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Acc&eacute;l&eacute;ration</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Ce curseur vous permet de sp&eacute;cifier la vitesse &agrave; laquelle le pointeur de la souris se d&eacute;place dans l'&eacute;cran.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>Sensibilit&eacute;</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Ce curseur vous permet de sp&eacute;cifier la sensibilit&eacute; du pointeur de la souris lors des d&eacute;placements de celle-ci.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guilabel>R&eacute;activit&eacute;</guilabel>
                </para>
              </entry>
              <entry valign="top">
                <para>Ce curseur vous permet de sp&eacute;cifier la distance &agrave; laquelle un &eacute;l&eacute;ment doit &ecirc;tre d&eacute;plac&eacute; avant que l'action de d&eacute;placement soit interpr&eacute;t&eacute;e comme une action glisser-d&eacute;poser.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-50">
    <title>Configuration des param&egrave;tres du proxy r&eacute;seau</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>proxy r&eacute;seau</secondary>
    </indexterm>
    <indexterm>
      <primary>proxy r&eacute;seau </primary>
      <secondary>d&eacute;finition des pr&eacute;f&eacute;rences</secondary>
    </indexterm>
    <indexterm>
      <primary>proxy</primary>
      <secondary>d&eacute;finition des pr&eacute;f&eacute;rences</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Proxy r&eacute;seau</application> vous permet de configurer les modalit&eacute;s de connexion de votre syst&egrave;me aux r&eacute;seaux. Vous pouvez configurer le bureau pour qu'il se connecte &agrave; un  <firstterm>serveur proxy</firstterm> et sp&eacute;cifier les d&eacute;tails du serveur proxy. Un serveur proxy intercepte les requ&ecirc;tes provenant d'un autre serveur et, si possible, les ex&eacute;cute lui-m&ecirc;me. Vous pouvez entrer le nom DNS (Domain Name Service) ou l'adresse IP (Internet Protocol) du serveur proxy. Le <firstterm>nom DNS </firstterm> repr&eacute;sente l'identificateur alphab&eacute;tique unique d'un ordinateur sur un r&eacute;seau. L'<firstterm>adresse IP</firstterm> repr&eacute;sente l'identificateur num&eacute;rique unique d'un ordinateur sur un r&eacute;seau. </para>
    <para><xref linkend="goscustdesk-TBL-52"/> &eacute;num&egrave;re les param&egrave;tres configurables du proxy r&eacute;seau.</para>
    <table frame="topbot" id="goscustdesk-TBL-52">
      <title>Param&egrave;tres du proxy r&eacute;seau</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec2" colwidth="35.09*"/>
        <colspec colname="colspec3" colwidth="64.91*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option</para>
            </entry>
            <entry valign="top">
              <para>Fonction </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Utiliser proxy HTTP </guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Cette option vous permet d'utiliser un serveur proxy pour le service HTTP.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Emplacement</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Entrez le nom DNS ou l'adresse IP du serveur proxy &agrave; utiliser pour un service HTTP.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <para>
                <guilabel>Port</guilabel>
              </para>
            </entry>
            <entry colname="colspec3" valign="top">
              <para>Entrez le num&eacute;ro de port du service HTTP sur le serveur proxy.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Le proxy n&eacute;cessite un nom d'utilisateur et un mot de passe</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>S&eacute;lectionnez cette option si le serveur proxy requiert un nom d'utilisateur et un mot de passe.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Enregistrer le nom d'utilisateur et le mot de passe sur le disque</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>S&eacute;lectionnez cette option pour enregistrer le nom d'utilisateur et le mot de passe.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2">
              <para>
                <guilabel>Nom d'utilisateur</guilabel>
              </para>
            </entry>
            <entry colname="colspec3">
              <para>Entrez votre nom d'utilisateur pour le serveur proxy. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Mot de passe</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Entrez votre mot de passe pour le serveur proxy. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustmulti-2">
    <title>D&eacute;finition des pr&eacute;f&eacute;rences du son</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>son</secondary>
    </indexterm>
    <indexterm>
      <primary>son</primary>
      <secondary>d&eacute;finition des pr&eacute;f&eacute;rences </secondary>
    </indexterm>
    <indexterm>
      <primary>son</primary>
      <secondary>association d'&eacute;v&eacute;nements &agrave; des sons</secondary>
    </indexterm>
    <indexterm>
      <primary>&eacute;v&eacute;nements, association de sons &agrave;</primary>
    </indexterm>
    <indexterm>
      <primary>serveur de sons</primary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Son</application> vous permet de contr&ocirc;ler le d&eacute;marrage du serveur de son GNOME. Il est &eacute;galement possible de sp&eacute;cifier les sons &agrave; diffuser lors d'un &eacute;v&eacute;nement donn&eacute;.</para>
    <para>Vous pouvez personnaliser les param&egrave;tres de l'outil de pr&eacute;f&eacute;rence <application>Son</application> dans les zones fonctionnelles suivantes  :</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>G&eacute;n&eacute;ral</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>&Eacute;v&eacute;nements sonores</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustmulti-3">
      <title>Param&egrave;tres g&eacute;n&eacute;raux</title>
      <para>L'onglet <guilabel>G&eacute;n&eacute;ral</guilabel> de l'outil de pr&eacute;f&eacute;rence <application>Son</application> vous permet de sp&eacute;cifier le lancement du serveur GNOME. Vous pouvez &eacute;galement activer les fonctions d'&eacute;v&eacute;nements sonores.</para>
      <para><xref linkend="goscustmulti-TBL-4"/> &eacute;num&egrave;re les param&egrave;tres g&eacute;n&eacute;raux configurables pour le son.</para>
      <table frame="topbot" id="goscustmulti-TBL-4">
        <title>Param&egrave;tres du son</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Activer le serveur de son au d&eacute;marrage</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Cette option vous permet de d&eacute;marrer le serveur de son &agrave; l'ouverture d'une session GNOME. Lorsque le serveur de son est actif, le bureau peut &eacute;mettre des sons.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Effets sonores des &eacute;v&eacute;nements</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Cette option permet la diffusion de sons lors d'&eacute;v&eacute;nements particuliers du bureau. Vous ne pouvez s&eacute;lectionner cette option que si l'option <guilabel>Activer le serveur de son au d&eacute;marrage</guilabel> est s&eacute;lectionn&eacute;e.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-48">
      <title>Param&egrave;tres des &eacute;v&eacute;nements sonores</title>
      <para>L'onglet <guilabel>&Eacute;v&eacute;nements sonores</guilabel> de l'outil de pr&eacute;f&eacute;rence <application>Son</application> vous permet d'associer des sons &agrave; des &eacute;v&eacute;nements donn&eacute;s. </para>
      <note>
        <para>Vous devez s&eacute;lectionner les options <guilabel>Activer le serveur de son au d&eacute;marrage</guilabel> et <guilabel>Effets sonores des &eacute;v&eacute;nements</guilabel> avant de pouvoir acc&eacute;der &agrave; l'onglet <guilabel>&Eacute;v&egrave;nements sonores</guilabel>.</para>
      </note>
      <para><xref linkend="goscustmulti-TBL-6"/> &eacute;num&egrave;re les param&egrave;tres  configurables des &eacute;v&eacute;nements sonores.</para>
      <table frame="topbot" id="goscustmulti-TBL-6">
        <title>Param&egrave;tres des &eacute;v&eacute;nements sonores</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec18" colwidth="19.21*"/>
          <colspec colname="colspec19" colwidth="46.79*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>Table <guilabel> Sons</guilabel></para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Cette table vous permet d'associer des sons &agrave; des &eacute;v&eacute;nements donn&eacute;s. </para>
                <para>La colonne <guilabel>&Eacute;v&egrave;nements</guilabel> affiche une liste hi&eacute;rarchique des &eacute;v&eacute;nements qui peuvent survenir. Pour d&eacute;velopper une cat&eacute;gorie d'&eacute;v&eacute;nements, cliquez sur la fl&egrave;che dirig&eacute;e vers la droite situ&eacute;e en regard de l'une d'entre elles.</para>
                <para>La colonne <guilabel>Fichier &agrave; lire</guilabel> indique le fichier sonore &agrave; lire lors de cet &eacute;v&eacute;nement.</para>
              </entry>
            </row>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guibutton>Lire </guibutton>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Ce bouton vous permet de lire le fichier son associ&eacute; &agrave; l'&eacute;v&eacute;nement s&eacute;lectionn&eacute;. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec18" colsep="0" rowsep="0" valign="top">
                <para>Zone de liste modifiable du fichier son,  <guibutton>Parcourir </guibutton></para>
              </entry>
              <entry colname="colspec19" colsep="0" rowsep="0" valign="top">
                <para>Pour associer un son &agrave; un  &eacute;v&eacute;nement, s&eacute;lectionnez l'&eacute;v&eacute;nement dans la table <guilabel>Sons</guilabel>. Entrez le nom du fichier son &agrave; associer &agrave; l'&eacute;v&eacute;nement s&eacute;lectionn&eacute; dans la zone de liste modifiable. Vous pouvez &eacute;galement cliquer sur le bouton <guibutton>Parcourir</guibutton> pour afficher une bo&icirc;te de dialogue <guilabel> S&eacute;lectionnez le fichier son</guilabel>. Cette bo&icirc;te de dialogue vous permet de sp&eacute;cifier le fichier son &agrave; associer &agrave; l'&eacute;v&eacute;nement s&eacute;lectionn&eacute;.</para>
                <note>
                  <para>Vous ne pouvez lui affecter que des fichiers son au format <filename>.wav</filename>. </para>
                </note>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-12">
    <title>D&eacute;finition des th&egrave;mes du bureau</title>
    <indexterm>
      <primary>th&egrave;mes Gtk+</primary>
      <see>th&egrave;mes</see>
    </indexterm>
    <indexterm>
      <primary>th&egrave;mes</primary>
      <secondary>d&eacute;finition des th&egrave;mes du bureau</secondary>
    </indexterm>
    <indexterm>
      <primary>th&egrave;mes</primary>
      <secondary>d&eacute;finition des th&egrave;mes des fen&ecirc;tres </secondary>
    </indexterm>
    <indexterm>
      <primary>fen&ecirc;tres</primary>
      <secondary>d&eacute;finition des th&egrave;mes</secondary>
    </indexterm>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>th&egrave;me</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Th&egrave;me</application> vous permet de s&eacute;lectionner un th&egrave;me pour votre bureau et pour vos fen&ecirc;tres. Vous pouvez personnaliser les param&egrave;tres de l'outil de pr&eacute;f&eacute;rence <application>Th&egrave;me</application> dans les zones fonctionnelles suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Th&egrave;me du widget</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Cadres de fen&ecirc;tres</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <para>Les th&egrave;mes de l'arri&egrave;re-plan et des fen&ecirc;tres ne sont pas les seuls &agrave; d&eacute;terminer l'apparence de votre bureau. Par exemple, <application>Nautilus</application>  vous propose des th&egrave;mes qui vous permettent de modifier l'apparence des fen&ecirc;tres et de l'arri&egrave;re-plan du bureau <application>Nautilus </application>. </para>
    <sect2 id="goscustdesk-56">
      <title>Param&egrave;tres relatifs au th&egrave;me du bureau</title>
      <para>L'onglet <guilabel>Th&egrave;me du Widget</guilabel> de l'outil de pr&eacute;f&eacute;rence <application> Th&egrave;me</application> vous permet de s&eacute;lectionner un th&egrave;me pour votre bureau. Le th&egrave;me du bureau sert &agrave; sp&eacute;cifier l'apparence visuelle de vos tableaux de bord, applets et menus. Le th&egrave;me du bureau sp&eacute;cifie &eacute;galement l'apparence des &eacute;l&eacute;ments d'interface des applications compatibles GNOME. Par exemple, le th&egrave;me affecte l'apparence des boutons, des barres de d&eacute;filement, des cases &agrave; cocher, etc.</para>
      <para>Vous pouvez effectuer une s&eacute;lection dans la liste des th&egrave;mes disponibles ou en installer de nouveaux. La liste des th&egrave;mes disponibles comprend plusieurs th&egrave;mes permettant de r&eacute;pondre aux besoins des utilisateurs en termes d'accessibilit&eacute;.</para>
      <para><xref linkend="goscustlookandfeel-TBL-23"/> &eacute;num&egrave;re les param&egrave;tres configurables du th&egrave;me par d&eacute;faut du bureau.</para>
      <table frame="topbot" id="goscustlookandfeel-TBL-23">
        <title>Param&egrave;tres relatifs aux th&egrave;mes du bureau</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="40.81*"/>
          <colspec colwidth="59.19*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Option</para>
              </entry>
              <entry valign="top">
                <para> Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Th&egrave;mes disponibles</para>
              </entry>
              <entry valign="top">
                <para>S&eacute;lectionnez le th&egrave;me requis dans la zone de liste.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Installer un nouveau th&egrave;me</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Vous pouvez ajouter un th&egrave;me &agrave; la liste disponible. Le nouveau th&egrave;me doit &ecirc;tre un dossier non compress&eacute;. </para>
                <para>Pour ajouter un th&egrave;me &agrave; la liste disponible, cliquez sur le bouton <guibutton>Installer un nouveau th&egrave;me</guibutton>. Une bo&icirc;te de dialogue s'affiche. Entrez l'emplacement  du dossier du th&egrave;me dans la zone combin&eacute;e d&eacute;roulante. Le bouton <guibutton>Parcourir</guibutton> vous permet &eacute;galement de rechercher le dossier. Lorsque vous avez s&eacute;lectionn&eacute; le dossier, cliquez sur <guibutton>OK</guibutton>.</para>
                <para>De nombreux th&egrave;mes GTK sont disponibles sur Internet.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Aller au dossier des th&egrave;mes</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Cliquez sur ce bouton pour ouvrir une fen&ecirc;tre du gestionnaire de fichiers dans le dossier de th&egrave;me par d&eacute;faut. Vous pouvez supprimer des th&egrave;mes de la fen&ecirc;tre du gestionnaire de fichiers. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustdesk-57">
      <title>Param&egrave;tres du cadre de fen&ecirc;tre</title>
      <para>L'onglet <guilabel>Th&egrave;me du cadre de la fen&ecirc;tre</guilabel> de l'outil de pr&eacute;f&eacute;rence <application>Th&egrave;me</application> vous permet de s&eacute;lectionner un th&egrave;me pour vos fen&ecirc;tres. Vous pouvez effectuer une s&eacute;lection dans la liste des th&egrave;mes disponibles ou en installer de nouveaux. La liste des th&egrave;mes disponibles comprend plusieurs th&egrave;mes permettant de r&eacute;pondre aux besoins des utilisateurs en termes d'accessibilit&eacute;.</para>
      <para><xref linkend="goscustdesk-TBL-2"/> r&eacute;pertorie les param&egrave;tres configurables des th&egrave;mes de fen&ecirc;tres.</para>
      <table frame="topbot" id="goscustdesk-TBL-2">
        <title>Param&egrave;tres relatifs aux Th&egrave;mes des cadres de la fen&ecirc;tre</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="40.81*"/>
          <colspec colwidth="59.19*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Option</para>
              </entry>
              <entry valign="top">
                <para> Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Th&egrave;mes disponibles</para>
              </entry>
              <entry valign="top">
                <para>S&eacute;lectionnez le th&egrave;me requis dans la zone de liste.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Installer un nouveau th&egrave;me</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Vous pouvez ajouter un th&egrave;me &agrave; la liste disponible. Le nouveau th&egrave;me doit &ecirc;tre un dossier non compress&eacute;. </para>
                <para>Pour ajouter un th&egrave;me &agrave; la liste disponible, cliquez sur le bouton <guibutton>Installer un nouveau th&egrave;me</guibutton>. Une bo&icirc;te de dialogue s'affiche. Entrez l'emplacement  du dossier du th&egrave;me dans la zone de liste modifiable. Le bouton <guibutton>Parcourir</guibutton> vous permet &eacute;galement de rechercher le dossier. Lorsque vous avez s&eacute;lectionn&eacute; le dossier, cliquez sur <guibutton>OK</guibutton>.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Aller au dossier des th&egrave;mes</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Cliquez sur ce bouton pour ouvrir une fen&ecirc;tre du gestionnaire de fichiers dans le dossier de th&egrave;me par d&eacute;faut. Vous pouvez supprimer des th&egrave;mes de la fen&ecirc;tre du gestionnaire de fichiers. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustwindows-2">
    <title>Personnalisation de l'activation des fen&ecirc;tres</title>
    <indexterm>
      <primary>gestionnaire de fen&ecirc;tres Metacity</primary>
      <see>gestionnaire de fen&ecirc;tres</see>
    </indexterm>
    <indexterm>
      <primary>gestionnaire de fen&ecirc;tres</primary>
      <secondary>personnalisation</secondary>
    </indexterm>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>focus de fen&ecirc;tre</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Focus de fen&ecirc;tre</application> vous permet de personnaliser le comportement de focus de votre bureau.</para>
    <para><xref linkend="goscustwindows-TBL-3"/> &eacute;num&egrave;re les param&egrave;tres personnalisables du focus de fen&ecirc;tre.</para>
    <table frame="topbot" id="goscustwindows-TBL-3">
      <title>Param&egrave;tres du focus de fen&ecirc;tre</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Option</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> Cliquer pour activer</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Cette option vous permet d'activer une fen&ecirc;tre en cliquant sur celle-ci. Elle reste active jusqu'&agrave; ce que vous cliquiez sur une autre fen&ecirc;tre.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0">
              <para>
                <guilabel>Pointer pour activer</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0">
              <para>Cette option vous permet d'activer une fen&ecirc;tre en pointant  sur celle-ci. Elle reste active jusqu'&agrave; ce que vous pointiez sur une autre fen&ecirc;tre. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0">
              <para>
                <guilabel>&Eacute;lever la fen&ecirc;tre en cas de focus</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0">
              <para>Cette option vous permet de mettre les fen&ecirc;tres &agrave; l'avant-plan lorsque vous les activez.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
</chapter>
