<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustuserinter-1">
  <title>Utilisation des outils de pr&eacute;f&eacute;rence avanc&eacute;s</title>
  <highlights>
    <para>Les outils de pr&eacute;f&eacute;rence <guilabel>Avanc&eacute;s</guilabel> permettent de personnaliser le comportement et l'apparence des applications, tableaux de bord et autres &eacute;l&eacute;ments de l'interface utilisateur. Ils vous aident &agrave; configurer les types de fichiers, les applications par d&eacute;faut et les tableaux de bord. Vous pouvez &eacute;galement les utiliser pour personnaliser vos sessions et programmes de d&eacute;marrage. Le pr&eacute;sent chapitre d&eacute;crit l'utilisation des outils de pr&eacute;f&eacute;rence avanc&eacute;s dans le but de personnaliser le bureau.</para>
  </highlights>
  <sect1 id="goscustlookandfeel-17">
    <title>Ouverture des outils de pr&eacute;f&eacute;rence avanc&eacute;s</title>
    <para>Vous pouvez ouvrir un outil de pr&eacute;f&eacute;rence <guilabel>Avanc&eacute;s</guilabel> en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>Dans le menu <guimenu>Pr&eacute;f&eacute;rences du bureau</guimenu> :</para>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;s</guisubmenu></menuchoice>. <guimenuitem/> S&eacute;lectionnez l'outil requis dans le sous-menu. La bo&icirc;te de dialogue relative &agrave; celui-ci s'affiche.</para>
      </listitem>
      <listitem>
        <para>Depuis l'emplacement <guilabel>D&eacute;marrer ici</guilabel> :</para>
        <para>Ouvrez une fen&ecirc;tre <application>Nautilus</application>, puis s&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici</guimenuitem></menuchoice>. Vous pouvez &eacute;galement cliquer deux fois sur l'objet <guilabel>D&eacute;marrer ici</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. L'emplacement <guilabel>D&eacute;marrer ici</guilabel> s'affiche. Cliquez deux fois sur l'objet <guilabel>Pr&eacute;f&eacute;rences du bureau</guilabel> dans la fen&ecirc;tre <application>Nautilus</application>, puis sur le dossier <guilabel>Avanc&eacute;s</guilabel>. Les outils de pr&eacute;f&eacute;rence <guilabel>Avanc&eacute;s</guilabel> s'affichent.</para>
        <para>Cliquez deux fois sur l'outil requis. La bo&icirc;te de dialogue relative &agrave; celui-ci s'affiche.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustlookandfeel-39">
    <title>Configuration d'une base de donn&eacute;es CD</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>base de donn&eacute;es CD</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>base de donn&eacute;es CD</application> permet de configurer une base de donn&eacute;es CD dans laquelle le syst&egrave;me peut effectuer des recherches. Une telle base de donn&eacute;es contient des informations relatives aux CD, telles  que le nom de l'artiste, le titre et la liste des pistes. Lorsqu'une application lit un CD, elle peut le rechercher dans la base de donn&eacute;es, puis afficher les informations correspondantes. </para>
    <para><xref linkend="goscustlookandfeel-TBL-40"/> d&eacute;crit les &eacute;l&eacute;ments de l'outil de pr&eacute;f&eacute;rence <application>base de donn&eacute;es CD</application>.</para>
    <table frame="topbot" id="goscustlookandfeel-TBL-40">
      <title>Param&egrave;tres de la base de donn&eacute;es CD</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>&Eacute;l&eacute;ment</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Description</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Ne pas envoyer d'informations</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Cette option permet de ne pas envoyer d'informations au serveur de la base de donn&eacute;es CD.</para>
            </entry>
          </row>
          <row>
            <entry colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel>Envoyer les informations r&eacute;elles </guilabel>
              </para>
            </entry>
            <entry colsep="0" rowsep="0" valign="top">
              <para>Cette option permet d'envoyer les informations relatives &agrave; votre nom et au nom d'h&ocirc;te au serveur de la base de donn&eacute;es CD.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> Envoyer d'autres informations</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Cette option permet d'envoyer un autre nom et nom d'h&ocirc;te au serveur de la base de donn&eacute;es CD. Entrez le nom dans le champ correspondant. Entrez le nom d'h&ocirc;te dans le champ correspondant.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> Serveur tour de r&ocirc;le FreeDB</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>FreeDB est une base de donn&eacute;es CD. Le serveur tour de r&ocirc;le FreeDB est une configuration assurant le partage des t&acirc;ches entre les serveurs DB. Cette option permet d'acc&eacute;der &agrave; la base de donn&eacute;es CD FreeDB depuis ce serveur.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> Autre serveur FreeDB</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Cette option permet d'acc&eacute;der &agrave; la base de donn&eacute;es CD FreeDB depuis un autre serveur. S&eacute;lectionnez le serveur requis dans la table. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton> Mettre &agrave; jour la liste de serveurs</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Ce bouton permet de mettre &agrave; jour la liste des serveurs FreeDB disponibles dans la table.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guilabel> Autre serveur</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Cette option permet d'utiliser une autre base de donn&eacute;es CD. Entrez le nom du serveur sur lequel r&eacute;side la base de donn&eacute;es dans le champ <guilabel>Nom d'h&ocirc;te</guilabel>. Entrez le nom du port sur lequel vous pouvez acc&eacute;der &agrave; la base de donn&eacute;es dans le champ correspondant.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustdoc-7">
    <title>Configuration des types de fichiers et des programmes</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>Types de fichiers et programmes</secondary>
    </indexterm>
    <indexterm>
      <primary> types de fichiers</primary>
      <secondary> configuration</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Types de fichiers et Programmes</application> permet de sp&eacute;cifier comment cr&eacute;er, afficher et &eacute;diter des fichiers de diff&eacute;rents types. Par exemple, vous pouvez sp&eacute;cifier que si un fichier est r&eacute;dig&eacute; en texte standard, il doit s'ouvrir dans un &eacute;diteur de texte. </para>
    <para><application>Nautilus</application> et les autres applications GNOME v&eacute;rifient le contenu du fichier afin d'en d&eacute;terminer le type. Si les premi&egrave;res lignes ne le permettent pas, l'application v&eacute;rifie l'extension du fichier.</para>
    <para><xref linkend="goscustdoc-TBL-8"/> d&eacute;crit les &eacute;l&eacute;ments de l'outil de pr&eacute;f&eacute;rence <application>Types de fichiers et  Programmes</application>. </para>
    <table frame="topbot" id="goscustdoc-TBL-8">
      <title>&Eacute;l&eacute;ments de l'outil de pr&eacute;f&eacute;rence Types de fichiers et Programmes</title>
      <tgroup cols="2" colsep="1" rowsep="1">
        <colspec colname="colspec0" colwidth="18.86*"/>
        <colspec colname="colspec1" colwidth="47.14*"/>
        <thead>
          <row>
            <entry colsep="0" rowsep="1" valign="top">
              <para>&Eacute;l&eacute;ment</para>
            </entry>
            <entry colsep="0" rowsep="1" valign="top">
              <para>Description</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>Table </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Pour afficher le contenu d'une cat&eacute;gorie de types de fichiers, cliquez sur la fl&egrave;che dirig&eacute;e vers la droite situ&eacute;e en regard du nom de la cat&eacute;gorie. La cat&eacute;gorie se d&eacute;veloppe et affiche une description de chaque type de fichier ainsi que l'extension associ&eacute;e &agrave; celui-ci. </para>
              <para>Pour s&eacute;lectionner un type de fichier, cliquez sur celui-ci.</para>
            </entry>
          </row>
          <row>
            <entry colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Ajouter un type de fichier </guibutton>
              </para>
            </entry>
            <entry colsep="0" rowsep="0" valign="top">
              <para>Ce bouton permet d'ajouter un type de fichier. Pour plus d'informations, consultez <xref linkend="goscustlookandfeel-28"/>. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton> Ajouter un service</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Ce bouton permet d'ajouter un service. Pour plus d'informations, consultez <xref linkend="goscustlookandfeel-30"/>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton> &Eacute;diter</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <indexterm>
                <primary>types de fichiers</primary>
                <secondary>&eacute;dition</secondary>
              </indexterm>
              <indexterm>
                <primary>services</primary>
                <secondary>&eacute;dition</secondary>
              </indexterm>
              <para>Pou &eacute;diter un type de fichier, un service ou une cat&eacute;gorie de types de fichiers, s&eacute;lectionnez l'&eacute;l&eacute;ment &agrave; &eacute;diter, puis cliquez sur <guibutton>&Eacute;diter</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
              <para>
                <guibutton>Supprimer</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
              <para>Pour supprimer un type de fichier ou un service, s&eacute;lectionnez l'&eacute;l&eacute;ment concern&eacute;, puis cliquez sur <guibutton>Supprimer</guibutton>. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <sect2 id="goscustlookandfeel-28">
      <title>Ajout d'un type de fichier</title>
      <indexterm>
        <primary>types de fichiers</primary>
        <secondary>ajout</secondary>
      </indexterm>
      <para>Pour ajouter un type de fichier, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu> Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;s</guisubmenu><guimenuitem> Types de fichiers et programmes</guimenuitem></menuchoice> pour d&eacute;marrer l'outil de pr&eacute;f&eacute;rence <application>Types de fichiers et Programmes</application>.</para>
        </listitem>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>Ajouter un type de fichier</guibutton>. Une bo&icirc;te de dialogue <guilabel>Ajouter un type de fichier</guilabel> s'affiche.</para>
        </listitem>
        <listitem>
          <para>Entrez les propri&eacute;t&eacute;s requises dans celle-ci. Le tableau suivant d&eacute;crit les &eacute;l&eacute;ments de dialogue de l'onglet <guilabel>Ajouter un type de fichier</guilabel> :</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="37.42*"/>
              <colspec colname="colspec1" colwidth="62.58*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Option</para>
                  </entry>
                  <entry valign="top">
                    <para> Fonction</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Pas d'ic&ocirc;ne</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>S&eacute;lectionnez une ic&ocirc;ne destin&eacute;e &agrave; repr&eacute;senter le type de fichier. Pour choisir une ic&ocirc;ne, cliquez sur le bouton <guibutton>Pas d'ic&ocirc;ne</guibutton>. Une bo&icirc;te de dialogue de s&eacute;lection d'ic&ocirc;ne s'affiche. Choisissez une ic&ocirc;ne. Vous pouvez &eacute;galement choisir une ic&ocirc;ne dans un autre r&eacute;pertoire en cliquant sur le bouton <guibutton>Parcourir</guibutton>. Lorsque vous s&eacute;lectionnez une ic&ocirc;ne, cliquez sur <guibutton>OK</guibutton>. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Description</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Entrez la description du type de fichier.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Type MIME </guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Entrez le type MIME de ce type de fichier. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Cat&eacute;gorie</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Entrez la cat&eacute;gorie &agrave; laquelle le type de fichier doit appartenir dans l'outil de pr&eacute;f&eacute;rence <application>Types de fichiers et programmes</application>. Cliquez sur le bouton <guibutton>Choisir</guibutton> pour s&eacute;lectionner une cat&eacute;gorie dans la bo&icirc;te de dialogue <guilabel>Choisissez une cat&eacute;gorie de fichiers</guilabel>.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Extensions de nom de fichier</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Entrez les extensions &agrave; associer au type de fichier. Saisissez une extension de nom de fichier dans le champ situ&eacute; &agrave; gauche, puis cliquez sur <keycap>Entr&eacute;e</keycap>. Pour supprimer une extension, s&eacute;lectionnez-la dans le champ de droite, puis cliquez sur le bouton <guibutton>Supprimer</guibutton>. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Composant de l'afficheur</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Informations disponibles dans une version ult&eacute;rieure. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Action par d&eacute;faut</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Informations disponibles dans une version ult&eacute;rieure. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Programme &agrave; ex&eacute;cuter</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Sp&eacute;cifiez le programme &agrave; associer au type de fichier. Entrez la commande de d&eacute;marrage du programme dans ce champ. Vous pouvez &eacute;galement choisir une commande d&eacute;j&agrave; entr&eacute;e en cliquant sur le bouton fl&eacute;ch&eacute;, puis en s&eacute;lectionnant la commande &agrave; ex&eacute;cuter.</para>
                    <para>Le bouton <guibutton>Parcourir</guibutton> vous permet &eacute;galement de s&eacute;lectionner une commande &agrave; ex&eacute;cuter. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Ex&eacute;cuter dans un Terminal</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'ex&eacute;cuter le programme dans une fen&ecirc;tre de terminal. Choisissez la pour les programmes qui ne cr&eacute;ent pas de fen&ecirc;tre d'ex&eacute;cution.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>OK</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goscustlookandfeel-30">
      <title>Ajout d'un service</title>
      <indexterm>
        <primary>services</primary>
        <secondary>ajout</secondary>
      </indexterm>
      <para>Pour ajouter un service, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu> Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;s</guisubmenu><guimenuitem> Types de fichiers et programmes</guimenuitem></menuchoice> pour d&eacute;marrer l'outil de pr&eacute;f&eacute;rence <application> Types de fichiers et programmes</application>.</para>
        </listitem>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>Ajouter un service</guibutton>. La bo&icirc;te de dialogue correspondante s'affiche.</para>
        </listitem>
        <listitem>
          <para>Entrez les propri&eacute;t&eacute;s du service dans la bo&icirc;te de dialogue. Le tableau suivant d&eacute;crit les &eacute;l&eacute;ments de dialogue de l'onglet <guilabel>Ajouter un service</guilabel> :</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="41.22*"/>
              <colspec colname="colspec1" colwidth="58.78*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Option</para>
                  </entry>
                  <entry valign="top">
                    <para> Fonction</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Description</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Entrez la description du service.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Protocole </guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Entrez le protocole du service.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Programme</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Sp&eacute;cifiez le programme &agrave; associer au service. Entrez la commande de d&eacute;marrage du programme dans ce champ. Vous pouvez &eacute;galement choisir une commande d&eacute;j&agrave; entr&eacute;e en cliquant sur le bouton fl&eacute;ch&eacute;, puis en s&eacute;lectionnant la commande &agrave; ex&eacute;cuter.</para>
                    <para>Le bouton <guibutton>Parcourir</guibutton> vous permet &eacute;galement de s&eacute;lectionner une commande &agrave; ex&eacute;cuter. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Ex&eacute;cuter dans un Terminal</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'ex&eacute;cuter le programme dans une fen&ecirc;tre de terminal. Choisissez la pour les programmes qui ne cr&eacute;ent pas de fen&ecirc;tre d'ex&eacute;cution.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>OK</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="goscustdesk-10">
    <title>Personnalisation des tableaux de bord</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>tableau de bord</secondary>
    </indexterm>
    <indexterm>
      <primary>tableaux de bord</primary>
      <secondary>personnalisation du comportement et de l'apparence</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Tableau de bord</application> permet de configurer le comportement des tableaux de bord. Toute modification apport&eacute;e &agrave; l'outil de pr&eacute;f&eacute;rence <application>Tableau de bord</application> affecte tous vos tableaux de bord.</para>
    <table frame="topbot" id="goscustlookandfeel-TBL-22">
      <title>Param&egrave;tres relatifs aux tableaux de bord</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colwidth="50*"/>
        <colspec colwidth="50*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Param&egrave;tre</para>
            </entry>
            <entry valign="top">
              <para> Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Fermer le tiroir lorsque le lanceur est cliqu&eacute; </guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Cette option permet de fermer un tiroir lorsque l'un de ses lanceurs a &eacute;t&eacute; s&eacute;lectionn&eacute;. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Animation</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Cette option permet d'afficher et de masquer les tableaux de bord avec une animation.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guilabel>Vitesse d'animation </guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Cette zone de liste d&eacute;roulante permet de s&eacute;lectionner la vitesse de l'animation.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="goscustdoc-2">
    <title>S&eacute;lection de vos applications par d&eacute;faut</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>Applications par d&eacute;faut</secondary>
    </indexterm>
    <indexterm>
      <primary>applications par d&eacute;faut</primary>
      <see>applications par d&eacute;faut</see>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Applications par d&eacute;faut</application> permet de sp&eacute;cifier les applications &agrave; utiliser lorsque le bureau d&eacute;marre une application. Par exemple, vous pouvez sp&eacute;cifier  <application>Xterm</application> en tant qu'application de terminal par d&eacute;faut. Lorsque vous ouvrez le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu> et s&eacute;lectionnez <guimenuitem>Nouveau Terminal</guimenuitem>, <application>Xterm </application> d&eacute;marre.</para>
    <para>Vous pouvez param&eacute;trer les applications de l'outil de pr&eacute;f&eacute;rence <application>Applications par d&eacute;faut</application> dans les zones fonctionnelles suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Navigateur Web </guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>&Eacute;diteur de texte</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Terminal</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustlookandfeel-32">
      <title>Param&egrave;tres du navigateur Web</title>
      <indexterm>
        <primary>applications par d&eacute;faut</primary>
        <secondary>navigateur Web</secondary>
      </indexterm>
      <indexterm>
        <primary>navigateur Web, application par d&eacute;faut</primary>
      </indexterm>
      <para>L'onglet <application>Navigateur Web</application> permet de configurer votre navigateur Web par d&eacute;faut. Celui-ci s'ouvre lorsque vous cliquez sur une URL. Par exemple, le navigateur Web par d&eacute;faut s'ouvre quand vous s&eacute;lectionnez une URL dans une application ou un lanceur d'URL sur l'arri&egrave;re-plan du bureau.</para>
      <para><xref linkend="goscustlookandfeel-TBL-37"/> &eacute;num&egrave;re les param&egrave;tres configurables du navigateur Web par d&eacute;faut.</para>
      <table frame="topbot" id="goscustlookandfeel-TBL-37">
        <title>Param&egrave;tres du navigateur Web par d&eacute;faut</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> S&eacute;lectionnez un navigateur Web</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option permet d'utiliser un navigateur Web standard. La zone de liste d&eacute;roulante modifiable permet de s&eacute;lectionner votre navigateur Web par d&eacute;faut.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Navigateur Web personnalis&eacute;</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option permet d'utiliser un navigateur Web personnalis&eacute;. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Commande</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Entrez la commande &agrave; ex&eacute;cuter pour d&eacute;marrer le navigateur web personnalis&eacute;. Pour permettre au navigateur d'afficher un URL sur lequel vous cliquez, entrez <command> &ldquo;%s&rdquo;</command> apr&egrave;s la commande.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> D&eacute;marrer dans un Terminal</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option permet d'ex&eacute;cuter la commande dans une fen&ecirc;tre de terminal. S&eacute;lectionnez cette option si votre navigateur ne s'ouvre pas dans une fen&ecirc;tre.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustlookandfeel-31">
      <title>Param&egrave;tres de l'&eacute;diteur de texte</title>
      <indexterm>
        <primary>applications par d&eacute;faut</primary>
        <secondary>&eacute;diteur de texte</secondary>
      </indexterm>
      <indexterm>
        <primary>&eacute;diteur de texte, application par d&eacute;faut</primary>
      </indexterm>
      <para>L'onglet <application> &Eacute;diteur de texte</application> permet de configurer votre &eacute;diteur de texte par d&eacute;faut.</para>
      <para><xref linkend="goscustdoc-TBL-1"/> &eacute;num&egrave;re les param&egrave;tres de l'&eacute;diteur de texte par d&eacute;faut configur&eacute;.</para>
      <table frame="topbot" id="goscustdoc-TBL-1">
        <title>Param&egrave;tres de l'&eacute;diteur de texte favori</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> S&eacute;lectionnez un &eacute;diteur</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option vous permet d'utiliser un &eacute;diteur de texte standard. La zone de liste d&eacute;roulante modifiable permet de sp&eacute;cifier l'&eacute;diteur de texte par d&eacute;faut.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> &Eacute;diteur personnalis&eacute;</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option vous permet d'utiliser un &eacute;diteur de texte personnalis&eacute;. Une bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s de l'&eacute;diteur personnalis&eacute;</guilabel> s'affiche. </para>
                <itemizedlist>
                  <listitem>
                    <para><guilabel>Nom</guilabel> :Entrez le nom de l'&eacute;diteur de texte personnalis&eacute;.</para>
                  </listitem>
                  <listitem>
                    <para><guilabel>Commande</guilabel> :Entrez la commande &agrave; ex&eacute;cuter pour d&eacute;marrer l'&eacute;diteur de texte personnalis&eacute;.</para>
                  </listitem>
                  <listitem>
                    <para><guilabel>Cette application peut ouvrir plusieurs fichiers</guilabel> :S&eacute;lectionnez cette option si l'&eacute;diteur de texte par d&eacute;faut peut ouvrir plusieurs fichiers.</para>
                  </listitem>
                  <listitem>
                    <para><guilabel>Cette application doit &ecirc;tre ex&eacute;cut&eacute;e dans un shell</guilabel>:Cette option permet d'ex&eacute;cuter la commande dans une fen&ecirc;tre de terminal. S&eacute;lectionnez cette option si l'&eacute;diteur ne s'ouvre pas dans une fen&ecirc;tre.</para>
                  </listitem>
                </itemizedlist>
                <para>Apr&egrave;s avoir sp&eacute;cifi&eacute; un &eacute;diteur de texte personnalis&eacute;, vous pouvez cliquer sur le bouton <guibutton>Propri&eacute;t&eacute;s</guibutton> afin d'afficher la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s de l'&eacute;diteur personnalis&eacute;</guilabel>. Cette bo&icirc;te de dialogue permet de modifier les propri&eacute;t&eacute;s de l'&eacute;diteur de texte personnalis&eacute;.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Utiliser cet &eacute;diteur pour ouvrir des fichiers texte dans le gestionnaire de fichiers</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option permet au gestionnaire de fichiers de d&eacute;marrer l'&eacute;diteur de texte personnalis&eacute; pour afficher des fichiers texte.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustlookandfeel-34">
      <title>Param&egrave;tres du terminal</title>
      <indexterm>
        <primary>applications par d&eacute;faut</primary>
        <secondary>terminal</secondary>
      </indexterm>
      <indexterm>
        <primary>terminal, application par d&eacute;faut</primary>
      </indexterm>
      <para>L'onglet <application>Terminal</application> permet de configurer votre terminal par d&eacute;faut.</para>
      <para><xref linkend="goscustlookandfeel-TBL-35"/> &eacute;num&egrave;re les param&egrave;tres configurables du terminal par d&eacute;faut.</para>
      <table frame="topbot" id="goscustlookandfeel-TBL-35">
        <title>Param&egrave;tres du terminal par d&eacute;faut</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> S&eacute;lectionnez un terminal</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option vous permet d'utiliser un terminal standard. Utilisez la zone de liste d&eacute;roulante modifiable pour sp&eacute;cifier votre terminal pr&eacute;f&eacute;r&eacute;. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Terminal personnalis&eacute;</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option vous permet d'utiliser un terminal personnalis&eacute;. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Commande</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Entrez la commande &agrave; ex&eacute;cuter pour d&eacute;marrer le terminal personnalis&eacute;. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Indicateur d'Exec</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Entrez l'option <command>exec</command> &agrave; utiliser avec la commande.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
  <sect1 id="goscustsession-5">
    <title>Configuration de sessions</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>Sessions</secondary>
    </indexterm>
    <indexterm>
      <primary>sessions</primary>
      <secondary>pr&eacute;f&eacute;rences</secondary>
    </indexterm>
    <indexterm>
      <primary>applications de d&eacute;marrage</primary>
      <secondary> personnalisation</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence <application>Sessions</application> vous permet de g&eacute;rer vos sessions. Vous pouvez d&eacute;finir des pr&eacute;f&eacute;rences de session et sp&eacute;cifier les applications &agrave; d&eacute;marrer &agrave; l'ouverture d'une session. Vous pouvez configurer vos sessions afin qu'elles enregistrent l'&eacute;tat des applications sur le bureau et le restaurent lorsque vous en d&eacute;marrez une nouvelle. Cet outil de pr&eacute;f&eacute;rence vous permet &eacute;galement de g&eacute;rer plusieurs sessions GNOME.</para>
    <para>Vous pouvez personnaliser les param&egrave;tres des sessions et des applications de d&eacute;marrage dans les zones fonctionnelles suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Options de session</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Session courante</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel> Programmes au d&eacute;marrage</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <sect2 id="goscustsession-16">
      <title>D&eacute;finition des options de session</title>
      <indexterm>
        <primary>sessions</primary>
        <secondary>d&eacute;finition des options</secondary>
      </indexterm>
      <para>L'onglet <guilabel>Options de session</guilabel> permet de g&eacute;rer plusieurs sessions et de d&eacute;finir les pr&eacute;f&eacute;rences de la session courante. </para>
      <para><xref linkend="goscustsession-TBL-11"/> &eacute;num&egrave;re les param&egrave;tres configurables des options de session.</para>
      <table frame="topbot" id="goscustsession-TBL-11">
        <title>Param&egrave;tres des options de session</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Afficher l'&eacute;cran d'accueil &agrave; la connexion</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Cette option permet d'afficher un &eacute;cran d'accueil lorsque vous d&eacute;marrez une session. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Invite &agrave; la d&eacute;connexion</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette option permet d'afficher une bo&icirc;te de dialogue de confirmation lorsque vous quittez une session. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Enregistrer automatiquement les modifications de la session</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <indexterm>
                  <primary>applications de d&eacute;marrage </primary>
                  <secondary>g&eacute;r&eacute;es par la session</secondary>
                </indexterm>
                <para>Cette option permet au gestionnaire de session d'enregistrer l'&eacute;tat courant de la session. Il enregistre les applications g&eacute;r&eacute;es par la session ouvertes ainsi que les param&egrave;tres qui leur sont associ&eacute;s. Lorsque vous ouvrez une nouvelle session, les applications d&eacute;marrent automatiquement avec les param&egrave;tres enregistr&eacute;s.</para>
                <para>Si vous ne s&eacute;lectionnez pas cette option, la bo&icirc;te de dialogue <guilabel>Confirmation de d&eacute;connexion</guilabel> propose une option <guilabel>Enregistrer la configuration courante</guilabel>.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Sessions</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Cette zone de la bo&icirc;te de dialogue permet de g&eacute;rer plusieurs sessions sur le bureau en proc&eacute;dant comme suit :</para>
                <itemizedlist>
                  <listitem>
                    <para>Pour cr&eacute;er une nouvelle session, cliquez sur le bouton  <guibutton>Ajouter</guibutton>. La bo&icirc;te de dialogue <guilabel>Ajouter une nouvelle session</guilabel> s'affiche. Elle permet de sp&eacute;cifier le nom de la session.</para>
                  </listitem>
                  <listitem>
                    <para>Pour renommer une session, s&eacute;lectionnez celle-ci dans la table <guilabel>Choisir la session courante</guilabel>. Cliquez sur le bouton <guibutton>&Eacute;diter</guibutton>. La bo&icirc;te de dialogue <guilabel>&Eacute;diter le nom de session</guilabel> s'affiche. Entrez un nouveau nom pour la session.</para>
                  </listitem>
                  <listitem>
                    <para>Pour supprimer une session, s&eacute;lectionnez-la dans la table <guilabel> Choisir la session courante</guilabel>. Cliquez sur le bouton <guibutton>Supprimer</guibutton>.</para>
                  </listitem>
                </itemizedlist>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustlookandfeel-27">
      <title>D&eacute;finition des propri&eacute;t&eacute;s de la session</title>
      <indexterm>
        <primary> applications de d&eacute;marrage</primary>
        <secondary>g&eacute;r&eacute;es par la session</secondary>
      </indexterm>
      <indexterm>
        <primary>sessions</primary>
        <secondary>d&eacute;finition des propri&eacute;t&eacute;s</secondary>
      </indexterm>
      <para>L'onglet <guilabel>Session courante</guilabel> permet de sp&eacute;cifier les valeurs de l'ordre de d&eacute;marrage et de choisir le style de red&eacute;marrage des applications g&eacute;r&eacute;es par la session courante. </para>
      <para><xref linkend="sessprop01"/> &eacute;num&egrave;re les propri&eacute;t&eacute;s configurables de la session. </para>
      <table frame="topbot" id="sessprop01">
        <title>Propri&eacute;t&eacute;s de la session</title>
        <tgroup cols="2" colsep="1" rowsep="1">
          <colspec colname="colspec0" colwidth="18.86*"/>
          <colspec colname="colspec1" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Option</para>
              </entry>
              <entry colsep="0" rowsep="1" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Ordre</guilabel>
                </para>
              </entry>
              <entry colsep="0" rowsep="0" valign="top">
                <para>Le param&egrave;tre <guilabel>Ordre</guilabel> sp&eacute;cifie la s&eacute;quence dans laquelle le gestionnaire de session lance les applications de d&eacute;marrage g&eacute;r&eacute;es par la session. Il proc&egrave;de dans l'ordre croissant des valeurs d'ordre. La valeur par d&eacute;faut est 50.</para>
                <para>Pour sp&eacute;cifier l'ordre de d&eacute;marrage d'une application, s&eacute;lectionnez-la dans la table. La bo&icirc;te de s&eacute;lection num&eacute;rique <guilabel>Ordre</guilabel> permet de sp&eacute;cifier la valeur de l'ordre de d&eacute;marrage.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel>Style</guilabel>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Le param&egrave;tre <guilabel>Style</guilabel> d&eacute;termine le style de d&eacute;marrage d'une application. Pour s&eacute;lectionner le style de red&eacute;marrage d'une application, cliquez sur celle-ci dans la table, puis choisissez l'un des styles suivants :</para>
                <itemizedlist>
                  <listitem>
                    <para>
                      <guilabel>Normal</guilabel>
                    </para>
                    <para>D&eacute;marre automatiquement lorsque vous ouvrez une session GNOME. La commande <command> kill</command> permet de quitter les applications pr&eacute;sentant ce style de red&eacute;marrage pendant une session.</para>
                  </listitem>
                  <listitem>
                    <para>
                      <guilabel>Red&eacute;marrer</guilabel>
                    </para>
                    <para>Red&eacute;marre automatiquement lorsque vous fermez ou quittez l'application. S&eacute;lectionnez ce style pour une application qui doit tourner en permanence pendant une session. Pour quitter une application de ce type, s&eacute;lectionnez-la dans la table, puis cliquez sur le bouton <guibutton>Supprimer</guibutton>.</para>
                  </listitem>
                  <listitem>
                    <para>
                      <guilabel>Corbeille</guilabel>
                    </para>
                    <para>Ne red&eacute;marre pas lorsque vous lancez une session GNOME.</para>
                  </listitem>
                  <listitem>
                    <para>
                      <guilabel>Param&egrave;tres</guilabel>
                    </para>
                    <para>D&eacute;marre automatiquement lorsque vous ouvrez une session. Les applications pr&eacute;sentant ce style poss&egrave;dent g&eacute;n&eacute;ralement une valeur d'ordre de d&eacute;marrage faible et enregistrent les param&egrave;tres de configuration des applications GNOME et des applications g&eacute;r&eacute;es par la session.</para>
                  </listitem>
                </itemizedlist>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0" valign="top">
                <para>
                  <guibutton>Supprimer</guibutton>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0" valign="top">
                <para>Le bouton <guibutton>Supprimer</guibutton> permet de supprimer l'application s&eacute;lectionn&eacute;e dans la liste. Celle-ci est ferm&eacute;e et dispara&icirc;t du gestionnaire de session. Une application supprim&eacute;e ne d&eacute;marre pas &agrave; l'ouverture d'une nouvelle session.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" colsep="0" rowsep="0">
                <para>
                  <guibutton>Appliquer</guibutton>
                </para>
              </entry>
              <entry colname="colspec1" colsep="0" rowsep="0">
                <para>Le bouton <guibutton>Appliquer</guibutton> permet d'appliquer les modifications apport&eacute;es &agrave; l'ordre de d&eacute;marrage et au style de red&eacute;marrage.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="goscustsession-12">
      <title>Configuration des applications de d&eacute;marrage</title>
      <indexterm>
        <primary>applications de d&eacute;marrage</primary>
        <secondary>non g&eacute;r&eacute;es par la session</secondary>
      </indexterm>
      <para>L'onglet <guilabel>Programmes au d&eacute;marrage</guilabel> de l'outil de pr&eacute;f&eacute;rence <application>Sessions</application> vous permet de sp&eacute;cifier des <firstterm>applications de d&eacute;marrage</firstterm> non g&eacute;r&eacute;es par la session. Les applications de d&eacute;marrage sont lanc&eacute;es automatiquement lorsque vous ouvrez une session. L'onglet <guilabel>Programmes au d&eacute;marrage</guilabel> permet de sp&eacute;cifier les commandes qui ex&eacute;cutent les applications non g&eacute;r&eacute;es par la session. Ces commandes s'ex&eacute;cutent automatiquement lorsque vous vous connectez.</para>
      <para>Vous pouvez &eacute;galement d&eacute;marrer automatiquement les applications g&eacute;r&eacute;es par la session. Pour plus d'informations, voir <xref linkend="goscustsession-16"/>.</para>
      <para><xref linkend="goscustsession-TBL-19"/> &eacute;num&egrave;re les param&egrave;tres configurables des applications de d&eacute;marrage.</para>
      <table frame="topbot" id="goscustsession-TBL-19">
        <title>Param&egrave;tres des programmes de d&eacute;marrage</title>
        <tgroup cols="2">
          <colspec colname="col1" colwidth="18.86*"/>
          <colspec colname="col2" colwidth="47.14*"/>
          <thead>
            <row>
              <entry colname="col1" colsep="0" valign="top">
                <para>Option</para>
              </entry>
              <entry colname="col2" colsep="0" valign="top">
                <para>Fonction</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="col1" colsep="0" rowsep="0" valign="top">
                <para>
                  <guilabel> Ajouter un programme de d&eacute;marrage</guilabel>
                </para>
              </entry>
              <entry colname="col2" colsep="0" rowsep="0" valign="top">
                <para>Cette table permet de g&eacute;rer les applications de d&eacute;marrage non g&eacute;r&eacute;es par la session en proc&eacute;dant de la mani&egrave;re suivante :</para>
                <itemizedlist>
                  <listitem>
                    <para>Pour ajouter une application de d&eacute;marrage, cliquez sur le bouton <guibutton>Ajouter</guibutton>. La bo&icirc;te de dialogue <guilabel>Ajouter un programme de d&eacute;marrage</guilabel> s'affiche. Entrez la commande permettant de d&eacute;marrer l'application dans le champ <guilabel>Commande de d&eacute;marrage</guilabel>. </para>
                    <para>Si vous sp&eacute;cifiez plusieurs applications de d&eacute;marrage, la zone de s&eacute;lection num&eacute;rique <guilabel> Priorit&eacute;</guilabel> permet de sp&eacute;cifier l'ordre de d&eacute;marrage de chaque application. Celui-ci correspond &agrave; la s&eacute;quence dans laquelle les applications doivent d&eacute;marrer.</para>
                  </listitem>
                  <listitem>
                    <para>Pour &eacute;diter une application de d&eacute;marrage, s&eacute;lectionnez celle-ci, puis cliquez sur le bouton <guibutton>&Eacute;diter</guibutton>. La bo&icirc;te de dialogue <guilabel>&Eacute;diter le programme de d&eacute;marrage</guilabel> s'affiche. Celle-ci permet de modifier la commande et l'ordre de d&eacute;marrage de l'application.</para>
                  </listitem>
                  <listitem>
                    <para>Pour supprimer une application de d&eacute;marrage, s&eacute;lectionnez-la, puis cliquez sur le bouton <guilabel>Supprimer</guilabel>.</para>
                  </listitem>
                </itemizedlist>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
  </sect1>
</chapter>
