<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustaccess-1">
  <title>Utilisation des outils de pr&eacute;f&eacute;rence Accessibilit&eacute;</title>
  <highlights>
    <para>Le pr&eacute;sent chapitre d&eacute;crit l'utilisation des outils de pr&eacute;f&eacute;rence  <guilabel>Accessibilit&eacute;</guilabel> avec lesquels vous pouvez personnaliser votre bureau.</para>
  </highlights>
  <sect1 id="goscustaccess-2">
    <title>Ouverture d'un outil Accessibilit&eacute;</title>
    <para>Vous pouvez ouvrir un outil de pr&eacute;f&eacute;rence <guilabel>Accessibilit&eacute;</guilabel> en recourant &agrave; l'une des m&eacute;thodes suivantes : </para>
    <itemizedlist>
      <listitem>
        <para>Dans le menu <guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu> : </para>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Accessibilit&eacute;</guisubmenu></menuchoice>. S&eacute;lectionnez l'outil de pr&eacute;f&eacute;rence requis dans le sous-menu. La bo&icirc;te de dialogue relative &agrave; celui-ci s'affiche.</para>
      </listitem>
      <listitem>
        <para>Depuis l'emplacement <guilabel>D&eacute;marrer ici</guilabel> :</para>
        <para>Ouvrez une fen&ecirc;tre <application>Nautilus</application>, puis s&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici</guimenuitem></menuchoice>. Vous pouvez &eacute;galement cliquer deux fois sur l'objet <guilabel>D&eacute;marrer ici</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. L'emplacement <guilabel>D&eacute;marrer ici</guilabel> s'affiche. Cliquez deux fois sur l'objet <guilabel>Pr&eacute;f&eacute;rences</guilabel> dans la fen&ecirc;tre <application>Nautilus</application>, puis sur le dossier <guilabel> Accessibilit&eacute;</guilabel>. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustaccess-6">
    <title>Configuration des options d'accessibilit&eacute; du clavier</title>
    <indexterm>
      <primary>AccessX</primary>
      <see>outils de pr&eacute;f&eacute;rence, accessibilit&eacute; du clavier </see>
    </indexterm>
    <indexterm>
      <primary>clavier</primary>
      <secondary>configuration des options d'accessibilit&eacute;</secondary>
    </indexterm>
    <indexterm>
      <primary>accessibilit&eacute; </primary>
      <secondary>configuration du clavier</secondary>
    </indexterm>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>accessibilit&eacute; du clavier</secondary>
    </indexterm>
    <para>L'outil de pr&eacute;f&eacute;rence Accessibilit&eacute; <application>Clavier</application> permet de d&eacute;finir les pr&eacute;f&eacute;rences d'accessibilit&eacute; du clavier. Cet outil est &eacute;galement appel&eacute; <application> AccessX</application>. </para>
    <para><xref linkend="goscustaccess-TBL-1"/> &eacute;num&egrave;re les param&egrave;tres modifiables d'accessibilit&eacute; du clavier.</para>
    <table frame="topbot" id="goscustaccess-TBL-1">
      <title>Param&egrave;tres d'accessibilit&eacute; du clavier</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="25.64*"/>
        <colspec colname="colspec1" colwidth="74.36*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option</para>
            </entry>
            <entry valign="top">
              <para> Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Activer l'accessibilit&eacute; du clavier</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette option permet d'activer les fonctions d'accessibilit&eacute; du clavier. Lorsque vous la s&eacute;lectionnez, les autres options de l'outil de pr&eacute;f&eacute;rence deviennent disponibles.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Bip lors de l'activation / d&eacute;sactivation des fonctions d'accessibilit&eacute; du clavier</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette option permet d'entendre un signal sonore &agrave; l'activation ou &agrave; la d&eacute;sactivation d'une fonction, par exemple les touches r&eacute;manentes ou lentes.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>D&eacute;sactiver en cas de non-utilisation pendant</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> S&eacute;lectionnez cette option pour d&eacute;sactiver les pr&eacute;f&eacute;rences d'accesibilit&eacute; au clavier s'il est inactif pendant un certain temps. Utilisez le curseur pour sp&eacute;cifier le nombre de secondes d'inactivit&eacute; du clavier requis avant que le syst&egrave;me ne d&eacute;sactive les pr&eacute;f&eacute;rences d'accessibilit&eacute;. Lorsque le nombre de secondes est &eacute;coul&eacute;, les pr&eacute;f&eacute;rences d'accessibilit&eacute; du clavier ci-dessous sont d&eacute;sactiv&eacute;es :</para>
              <itemizedlist>
                <listitem>
                  <para>Touches rebond</para>
                </listitem>
                <listitem>
                  <para>Touches souris</para>
                </listitem>
                <listitem>
                  <para>Touches lentes</para>
                </listitem>
                <listitem>
                  <para>Touches r&eacute;manentes</para>
                </listitem>
                <listitem>
                  <para>Touches bascule</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Activer les touches souris </guilabel>
              </para>
              <indexterm>
                <primary>accessibilit&eacute;</primary>
                <secondary>touches souris</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette option permet de demander au pav&eacute; num&eacute;rique d'&eacute;muler les actions de la souris. Vous pouvez sp&eacute;cifier les param&egrave;tres suivants : </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Vitesse maximum du curseur</guilabel> :Utilisez ce param&egrave;tre pour sp&eacute;cifier la vitesse maximale du pointeur lors de ses d&eacute;placements dans l'&eacute;cran. </para>
                </listitem>
                <listitem>
                  <para><guilabel>D&eacute;lai pour acc&eacute;l&eacute;rer &agrave; la vitesse max.</guilabel> :Ce param&egrave;tre permet de sp&eacute;cifier la dur&eacute;e du d&eacute;lai d'acc&eacute;l&eacute;ration du pointeur. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Commencer le d&eacute;placement apr&egrave;s ce d&eacute;lai suivant une pression de touche</guilabel> :Ce param&egrave;tre permet de sp&eacute;cifier le d&eacute;lai qui doit s'&eacute;couler apr&egrave;s une pression de touche avant le d&eacute;placement du pointeur. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Activer les touches lentes </guilabel>
              </para>
              <indexterm>
                <primary>accessibilit&eacute;</primary>
                <secondary>touches lentes</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette option permet de contr&ocirc;ler le d&eacute;lai pendant lequel vous devez maintenir une touche enfonc&eacute;e avant son acceptation. Vous pouvez sp&eacute;cifier les param&egrave;tres suivants : </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>N'accepter les pressions de touche qu'apr&egrave;s</guilabel> :Ce param&egrave;tre permet de sp&eacute;cifier le d&eacute;lai pendant lequel vous devez maintenir une touche enfonc&eacute;e avant son acceptation. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Bip quand la touche est enfonc&eacute;e</guilabel> :Cette option permet d'entendre un signal sonore lors d'une pression de touche. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Bip quand la touche est accept&eacute;e</guilabel> :Cette option permet d'entendre un signal sonore &agrave; l'acceptation d'une touche. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Bip quand la touche est rejet&eacute;e</guilabel> :Cette option permet d'entendre un signal sonore au rejet d'une touche. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Activer les touches rebond</guilabel>
              </para>
              <indexterm>
                <primary>accessibilit&eacute;</primary>
                <secondary>touches rebond</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette option permet d'accepter une entr&eacute;e de touche et pour contr&ocirc;ler les caract&eacute;ristiques de r&eacute;p&eacute;tition d'une touche du clavier. Vous pouvez sp&eacute;cifier les param&egrave;tres suivants : </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Ignorer les pressions de touche dans</guilabel> :Ce param&egrave;tre permet de sp&eacute;cifier l'intervalle entre la premi&egrave;re pression d'une touche et sa r&eacute;p&eacute;tition automatique. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Bip quand la touche est rejet&eacute;e</guilabel> :Cette option permet d'entendre un signal sonore au rejet d'une touche. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Activer les touches adh&eacute;sives</guilabel>
              </para>
              <indexterm>
                <primary>accessibilit&eacute;</primary>
                <secondary>touches r&eacute;manentes</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette option permet d'ex&eacute;cuter plusieurs op&eacute;rations de pression de touche simultan&eacute;es en appuyant sur les touches les unes apr&egrave;s les autres. Vous pouvez sp&eacute;cifier les param&egrave;tres suivants : </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Bip lorsqu'un modificateur est enfonc&eacute;</guilabel> :Cette option permet d'entendre un signal sonore lorsque vous appuyez sur un modificateur. </para>
                </listitem>
                <listitem>
                  <para><guilabel>D&eacute;sactiver les touches adh&eacute;sives quand deux touches sont enfonc&eacute;es simultan&eacute;ment</guilabel> :Cette option permet d'indiquer que, lorsque vous appuyez simultan&eacute;ment sur deux touches, vous n'appuyez plus cons&eacute;cutivement sur des touches pour ex&eacute;cuter plusieurs pressions de touche simultan&eacute;es.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Touches bascule et r&eacute;p&eacute;tition</guilabel>
              </para>
              <indexterm>
                <primary>accessibilit&eacute;</primary>
                <secondary>touches bascule</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cette option permet d'entendre un signal sonore &agrave; la pression de touche bascule. Vous entendez un bip lorsqu'une touche bascule est activ&eacute;e. Vous entendez deux bips lorsqu'une touche bascule est d&eacute;sactiv&eacute;e.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Zone de test</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>La zone de test constitue une interface interactive vous permettant de visualiser comment les param&egrave;tres du clavier affectent l'affichage lorsque vous tapez. Tapez du texte dans la zone de test pour v&eacute;rifier les effets de vos param&egrave;tres.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guibutton>Importer un fichier AccessX CDE</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cliquez sur ce bouton pour importer un fichier de configuration AccessX CDE. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Pour plus d'informations sur la configuration des pr&eacute;f&eacute;rences d'accessibilit&eacute; du clavier, voir <citetitle> GNOME 2.0 Desktop for the Solaris Operating Environment Accessibility Guide </citetitle>.</para>
  </sect1>
</chapter>
