<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosdeskback-1">
  <title>Utilisation de l'arri&egrave;re-plan du bureau</title>
  <highlights>
    <para>Par d&eacute;faut, le gestionnaire de fichiers <application>Nautilus</application> g&egrave;re l'arri&egrave;re-plan de votre bureau. Si vous n'utilisez pas <application>Nautilus </application> &agrave; cette fin, passez ce chapitre. Celui-ci d&eacute;crit l'utilisation l'arri&egrave;re-plan du bureau <application>Nautilus</application>.</para>
  </highlights>
  <sect1 id="gosdeskback-21">
    <title>Pr&eacute;sentation de l'arri&egrave;re-plan  du bureau</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary>introduction</secondary>
    </indexterm>
    <para>L'arri&egrave;re-plan du bureau se trouve derri&egrave;re tous les autres composants de la partie visible du bureau. Il s'agit d'un composant actif de l'interface utilisateur. Vous pouvez ex&eacute;cuter les t&acirc;ches suivantes depuis l'arri&egrave;re-plan du bureau :</para>
    <itemizedlist>
      <listitem>
        <para>D&eacute;marrer vos applications et ouvrir vos fichiers ou dossiers. </para>
        <para>Vous pouvez ajouter des objets &agrave; l'arri&egrave;re-plan du bureau pour pouvoir acc&eacute;der plus ais&eacute;ment aux applications, fichiers et dossiers fr&eacute;quemment utilis&eacute;s. Par exemple, vous pouvez y ajouter un lanceur d'application. Un lien symbolique vers un fichier souvent utilis&eacute; peut &ecirc;tre cr&eacute;&eacute;, puis ajout&eacute; &agrave; l'arri&egrave;re-plan du bureau. Il est &eacute;galement possible d'enregistrer des fichiers et des dossiers sur l'arri&egrave;re-plan du bureau.</para>
      </listitem>
      <listitem>
        <para>Ouvrir le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu>.</para>
        <para>Cliquez avec le bouton droit sur l'arri&egrave;re-plan du bureau pour ouvrir le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu>. Ce menu permet d'ex&eacute;cuter des actions sur l'arri&egrave;re-plan du bureau.</para>
      </listitem>
      <listitem>
        <para>Utiliser la <guilabel>corbeille</guilabel>.</para>
        <para>Vous pouvez d&eacute;placer des objets dans la <guilabel>Corbeille</guilabel> et la vider.</para>
      </listitem>
      <listitem>
        <para>Personnaliser l'arri&egrave;re-plan du bureau.</para>
        <para>Vous pouvez personnaliser le motif ou la couleur de l'arri&egrave;re-plan du bureau.</para>
      </listitem>
    </itemizedlist>
    <para>Par d&eacute;faut, l'arri&egrave;re-plan du bureau contient trois objets. </para>
    <para><xref linkend="gosdeskback-TBL-84"/> d&eacute;crit les fonctions des objets par d&eacute;faut de l'arri&egrave;re-plan du bureau.</para>
    <table frame="topbot" id="gosdeskback-TBL-84">
      <title>Fonctions des objets par d&eacute;faut de l'arri&egrave;re-plan du bureau</title>
      <tgroup cols="3" colsep="0" rowsep="0">
        <colspec colname="colspec2" colwidth="35.94*"/>
        <colspec colname="colspec0" colwidth="35.94*"/>
        <colspec colname="colspec1" colwidth="64.06*"/>
        <thead>
          <row rowsep="1">
            <entry colname="colspec2" valign="top">
              <para>Objet</para>
            </entry>
            <entry valign="top">
              <para>Composant</para>
            </entry>
            <entry valign="top">
              <para>Fonction </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_home_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icône du dossier personnel Nautilus.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry valign="top">
              <para>
                <guilabel> Dossier personnel</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Ouvre une fen&ecirc;tre <application> Nautilus</application>  et pr&eacute;sente votre dossier personnel dans le volet d'affichage.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_starthere_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icône Nautilus Démarrer ici.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel> D&eacute;marrer ici</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Permet d'acc&eacute;der &agrave; certaines caract&eacute;ristiques principales du bureau GNOME. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_overview_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icône d'aperçu GNOME.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel> Aper&ccedil;u GNOME</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Permet d'ouvrir une fen&ecirc;tre de navigateur d'aide et affiche des informations sur le bureau GNOME.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_trash_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Icône Corbeille de Nautilus.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry valign="top">
              <para>
                <guilabel> Corbeille</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>Ouvre une fen&ecirc;tre <application>Nautilus</application>  et pr&eacute;sente la <guilabel>Corbeille</guilabel> dans le volet d'affichage.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="gosdeskback-22">
    <title>D&eacute;marrage de l'arri&egrave;re-plan du bureau</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary>d&eacute;marrage</secondary>
    </indexterm>
    <para>Si <application>Nautilus</application> n'est pas le gestionnaire de l'arri&egrave;re-plan du bureau courant, les objets par d&eacute;faut n'apparaissent pas sur celui-ci. Dans ce cas, il est possible que vous deviez le red&eacute;marrer. Si les objets par d&eacute;faut n'apparaissent pas sur l'arri&egrave;re-plan du bureau, l'une des conditions suivantes peut &ecirc;tre vraie :</para>
    <itemizedlist>
      <listitem>
        <para>Les pr&eacute;f&eacute;rences <application>Nautilus</application> sont d&eacute;finies de telle sorte que <application>Nautilus</application> ne g&egrave;re pas l'arri&egrave;re-plan du bureau. Pour red&eacute;marrer l'arri&egrave;re-plan du bureau, vous devez d&eacute;finir  vos pr&eacute;f&eacute;rences de telle sorte que <application>Nautilus </application> g&egrave;re celui-ci.</para>
      </listitem>
      <listitem>
        <para>Vous avez tu&eacute; le processus de l'arri&egrave;re-plan du bureau par inadvertance. Pour red&eacute;marrer l'arri&egrave;re-plan du bureau, vous devez d&eacute;finir  vos pr&eacute;f&eacute;rences de telle sorte que <application>Nautilus </application> g&egrave;re celui-ci.</para>
      </listitem>
      <listitem>
        <para>Vous avez supprim&eacute; le r&eacute;pertoire <filename>/.nautilus</filename>. Pour red&eacute;marrer l'arri&egrave;re-plan du bureau, vous devez configurer <application>Nautilus</application> de telle sorte qu'il g&egrave;re celui-ci. </para>
      </listitem>
    </itemizedlist>
    <para>Pour ce faire, proc&eacute;dez comme suit :</para>
    <orderedlist>
      <listitem>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Dossier personnel</guimenuitem></menuchoice>. Une fen&ecirc;tre <application>Nautilus</application> s'affiche. </para>
      </listitem>
      <listitem>
        <para>S&eacute;lectionnez <menuchoice><guimenu>&Eacute;diter</guimenu><guimenuitem>Pr&eacute;f&eacute;rences</guimenuitem></menuchoice>. Une bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences</guilabel> s'affiche. S&eacute;lectionnez <guilabel>Bureau &amp; Corbeille</guilabel> dans la bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences</guilabel>.</para>
      </listitem>
      <listitem>
        <para>S&eacute;lectionnez l'option <guilabel>Utiliser Nautilus pour dessiner le bureau</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Cliquez sur <guibutton>Fermer</guibutton> pour fermer la bo&icirc;te de dialogue.</para>
      </listitem>
    </orderedlist>
    <para>Pour configurer <application>Nautilus</application> de sorte qu'il g&egrave;re l'arri&egrave;re-plan du bureau, proc&eacute;dez comme suit :</para>
    <orderedlist>
      <listitem>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Dossier personnel</guimenuitem></menuchoice>. Une bo&icirc;te de dialogue <guilabel>Premi&egrave;re configuration Nautilus</guilabel> s'affiche.</para>
      </listitem>
      <listitem>
        <para>Celle-ci permet de personnaliser votre environnement <application>Nautilus</application>. Suivez les instructions de la bo&icirc;te de dialogue. Dans l'&eacute;cran <guilabel>Transition de GMC &agrave; Nautilus</guilabel>, s&eacute;lectionnez l'option <guilabel>Utiliser Nautilus pour dessiner le bureau</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Lorsque vous atteignez l'&eacute;cran <guilabel>Termin&eacute;</guilabel>, cliquez sur le bouton <guibutton>Termin&eacute;</guibutton>.</para>
      </listitem>
    </orderedlist>
  </sect1>
  <sect1 id="gosdeskback-2">
    <title>Objets de l'arri&egrave;re-plan du bureau</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary>objets de l'arri&egrave;re-plan du bureau</secondary>
    </indexterm>
    <para>Un objet de l'arri&egrave;re-plan du bureau est une ic&ocirc;ne situ&eacute;e sur l'arri&egrave;re-plan du bureau vous permettant d'ouvrir des fichiers, des dossiers et des applications. Tous les objets de l'arri&egrave;re-plan du bureau r&eacute;sident dans le r&eacute;pertoire correspondant. Lorsque vous d&eacute;placez des objets vers l'arri&egrave;re-plan du bureau, ils apparaissent dans ce r&eacute;pertoire. Vous pouvez &eacute;galement utiliser votre dossier personnel en tant que r&eacute;pertoire du bureau. </para>
    <para>Par d&eacute;faut, l'arri&egrave;re-plan du bureau contient trois objets. Vous pouvez &eacute;galement y ajouter des objets afin de pouvoir acc&eacute;der plus ais&eacute;ment aux fichiers, dossiers et applications fr&eacute;quemment utilis&eacute;s. Par exemple, vous pouvez y ajouter un lanceur vous permettant d'ouvrir une application fr&eacute;quemment utilis&eacute;e. </para>
    <para><xref linkend="gosdeskback-TBL-86"/> d&eacute;crit les types d'objets que vous pouvez ajouter &agrave; l'arri&egrave;re-plan du bureau.</para>
    <table frame="topbot" id="gosdeskback-TBL-86">
      <title>Types d'objets d'arri&egrave;re-plan du bureau</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="30.23*"/>
        <colspec colname="colspec1" colwidth="69.77*"/>
        <thead>
          <row rowsep="1">
            <entry colname="colspec0" valign="top">
              <para>Type d'objet</para>
            </entry>
            <entry valign="top">
              <para>Description</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Lien symbolique</para>
            </entry>
            <entry valign="top">
              <para>Un lien symbolique est un objet qui pointe sur un autre fichier ou dossier. Lorsque vous s&eacute;lectionnez un lien symbolique dans l'arri&egrave;re-plan du bureau, le fichier ou le dossier vers lequel celui-ci pointe s'ouvre. Vous pouvez d&eacute;placer ou copier un lien symbolique sur l'arri&egrave;re-plan du bureau.</para>
              <para>Les liens symboliques peuvent &ecirc;tre identifi&eacute;s gr&acirc;ce &agrave; l'embl&egrave;me fl&eacute;ch&eacute; qui appara&icirc;t par d&eacute;faut sur chacun d'entre eux. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Lanceur</para>
            </entry>
            <entry valign="top">
              <para>Vous pouvez ajouter les types de lanceur suivants &agrave; l'arri&egrave;re-plan du bureau :</para>
              <itemizedlist>
                <listitem>
                  <para>Application :D&eacute;marre une application particuli&egrave;re.</para>
                </listitem>
                <listitem>
                  <para>Lien :Liens vers une URL, un fichier ou un dossier particulier.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Fichier</para>
            </entry>
            <entry valign="top">
              <para>Il est possible d'ajouter des fichiers &agrave; l'arri&egrave;re-plan du bureau. Ceux-ci r&eacute;sident dans le r&eacute;pertoire correspondant. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Dossier </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Vous pouvez d&eacute;placer ou cr&eacute;er des dossiers sur l'arri&egrave;re-plan du bureau. Ceux-ci r&eacute;sident dans le r&eacute;pertoire correspondant.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Vous pouvez modifier les objets de l'arri&egrave;re-plan du bureau en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>afficher les propri&eacute;t&eacute;s de l'objet ;</para>
      </listitem>
      <listitem>
        <para>renommer l'objet ;</para>
      </listitem>
      <listitem>
        <para>modifier les permissions de l'objet ;</para>
      </listitem>
      <listitem>
        <para>modifier l'ic&ocirc;ne correspondant &agrave; l'objet ;</para>
      </listitem>
      <listitem>
        <para>redimensionner l'ic&ocirc;ne correspondant &agrave; l'objet ;</para>
      </listitem>
      <listitem>
        <para>ajouter un embl&egrave;me &agrave; l'objet.</para>
      </listitem>
    </itemizedlist>
    <para>Les sections suivantes d&eacute;crivent l'arri&egrave;re-plan du bureau.</para>
    <sect2 id="gosdeskback-30">
      <title>S&eacute;lection d'objets sur l'arri&egrave;re-plan du bureau</title>
      <indexterm>
        <primary>arri&egrave;re-plan du bureau</primary>
        <secondary>s&eacute;lection d'objets</secondary>
      </indexterm>
      <indexterm>
        <primary>objets de l'arri&egrave;re-plan du bureau</primary>
        <secondary>s&eacute;lection</secondary>
      </indexterm>
      <para>Pour s&eacute;lectionner un objet, cliquez sur celui-ci. Pour s&eacute;lectionner plusieurs objets, maintenez la touche <keycap> Ctrl</keycap> enfonc&eacute;e, puis cliquez ceux-ci.</para>
      <para>Vous pouvez &eacute;galement s&eacute;lectionner une zone de l'arri&egrave;re-plan du bureau pour s&eacute;lectionner tous les objets qui s'y trouvent. Cliquez sur l'arri&egrave;re-plan du bureau en appuyant sur le bouton de gauche, puis faites glisser la souris sur la zone contenant les objets &agrave; s&eacute;lectionner. La s&eacute;lection est d&eacute;limit&eacute;e par un rectangle gris.</para>
      <para>Pour s&eacute;lectionner plusieurs zones, maintenez la touche <keycap> Ctrl</keycap> enfonc&eacute;e, puis faites glisser la souris sur celles-ci. </para>
    </sect2>
    <sect2 id="gosdeskback-29">
      <title>Ouverture d'un objet depuis l'arri&egrave;re-plan du bureau</title>
      <indexterm>
        <primary>arri&egrave;re-plan du bureau</primary>
        <secondary>ouverture d'objets</secondary>
      </indexterm>
      <indexterm>
        <primary>objets d'arri&egrave;re-plan du bureau</primary>
        <secondary>ouverture</secondary>
      </indexterm>
      <para>Pour ouvrir un objet depuis l'arri&egrave;re-plan du bureau, cliquez deux fois sur celui-ci. Vous pouvez &eacute;galement cliquer sur l'objet avec le bouton droit, puis s&eacute;lectionner <guimenuitem>Ouvrir</guimenuitem>. Lorsque vous ouvrez un objet, l'action par d&eacute;faut qui lui est associ&eacute;e s'ex&eacute;cute. Par exemple, si l'objet est un fichier texte, celui-ci s'ouvre dans une fen&ecirc;tre <application>Nautilus </application>. Les actions par d&eacute;faut des types de fichiers sont sp&eacute;cifi&eacute;s dans l'outil de pr&eacute;f&eacute;rence <application>Types de fichiers et programmes</application>.</para>
      <para>Pour ex&eacute;cuter une op&eacute;ration autre que l'action par d&eacute;faut sur un objet, cliquez sur celui-ci avec le bouton droit, puis s&eacute;lectionnez <guimenuitem>Ouvrir avec</guimenuitem>. S&eacute;lectionnez une action dans le sous-menu <guisubmenu>Ouvrir avec</guisubmenu>. </para>
      <para>Les &eacute;l&eacute;ments de celui-ci correspondent au contenu des parties suivantes de l'outil de pr&eacute;f&eacute;rence  <application>Types de fichiers et programmes</application> :</para>
      <itemizedlist>
        <listitem>
          <para>la zone de liste d&eacute;roulante <guilabel>Action par d&eacute;faut</guilabel> de la bo&icirc;te de dialogue <guilabel>&Eacute;diter un type de fichier</guilabel> ;</para>
        </listitem>
        <listitem>
          <para>la zone de liste d&eacute;roulante <guilabel>Afficheur</guilabel> de la bo&icirc;te de dialogue <guilabel>&Eacute;diter un type de fichier</guilabel>.</para>
        </listitem>
      </itemizedlist>
      <para>Vous pouvez d&eacute;finir vos pr&eacute;f&eacute;rences dans une fen&ecirc;tre  <application>Nautilus</application> de mani&egrave;re &agrave; ne devoir cliquer qu'une seule fois sur un fichier pour ex&eacute;cuter l'action par d&eacute;faut.</para>
    </sect2>
    <sect2 id="gosdeskback-3">
      <title>Ajout d'un lanceur &agrave; l'arri&egrave;re-plan du bureau</title>
      <indexterm>
        <primary>arri&egrave;re-plan du bureau</primary>
        <secondary>ajout de lanceurs</secondary>
      </indexterm>
      <indexterm>
        <primary>objets d'arri&egrave;re-plan du bureau</primary>
        <secondary>lanceurs</secondary>
      </indexterm>
      <para>Un lanceur situ&eacute; sur l'arri&egrave;re-plan du bureau peut d&eacute;marrer une application ou ouvrir un lien vers un dossier, un fichier ou un site FTP donn&eacute;. </para>
      <para>Pour ajouter un lanceur &agrave; l'arri&egrave;re-plan du bureau, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton-droit sur l'arri&egrave;re-plan du bureau, puis s&eacute;lectionnez <guimenuitem>Nouveau lanceur</guimenuitem>. Une bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel>  s'affiche.</para>
        </listitem>
        <listitem>
          <para>Pour plus d'informations concernant la mani&egrave;re d'entrer les propri&eacute;t&eacute;s du lanceur dans la bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel>, consultez <emphasis>Utilisation des tableaux de bord</emphasis>.</para>
          <para>La commande associ&eacute;e au lanceur est ex&eacute;cut&eacute;e lorsque vous utilisez celui-ci. Le tableau suivant pr&eacute;sente des exemples de commandes et les actions ex&eacute;cut&eacute;es par celles-ci.</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="47.36*"/>
              <colspec colname="colspec1" colwidth="52.64*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Exemple de commande</para>
                  </entry>
                  <entry valign="top">
                    <para>Action</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0" valign="top">
                    <para>
                      <command>gedit</command>
                    </para>
                  </entry>
                  <entry colname="colspec1" valign="top">
                    <para>D&eacute;marre l'application <application>gedit</application>.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <command>gedit /user123/loremipsum.txt</command>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Ouvre le fichier <filename>/user123/loremipsum.txt</filename> dans l'application <application>gedit</application>.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0" valign="top">
                    <para>
                      <command>nautilus /user123/Projects</command>
                    </para>
                  </entry>
                  <entry colname="colspec1" valign="top">
                    <para>Ouvre le dossier <filename>/user123/Projects</filename> dans une fen&ecirc;tre <application>Nautilus</application>.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gosdeskback-20">
      <title>Ajout d'un lien symbolique &agrave; l'arri&egrave;re-plan du bureau</title>
      <indexterm>
        <primary>arri&egrave;re-plan du bureau</primary>
        <secondary>ajout de liens symboliques</secondary>
      </indexterm>
      <indexterm>
        <primary>objets sur l'arri&egrave;re-plan du bureau</primary>
        <secondary>liens symboliques</secondary>
      </indexterm>
      <para>Vous pouvez cr&eacute;er des liens symboliques sur l'arri&egrave;re-plan du bureau pour proc&eacute;der comme suit : </para>
      <itemizedlist>
        <listitem>
          <para>ouvrir un fichier particulier dans une application donn&eacute;e ;</para>
        </listitem>
        <listitem>
          <para>ouvrir un dossier particulier dans une fen&ecirc;tre <application>Nautilus</application> ;</para>
        </listitem>
        <listitem>
          <para>ex&eacute;cuter un fichier binaire ou un script.</para>
        </listitem>
      </itemizedlist>
      <para>Pour cr&eacute;er un lien symbolique sur l'arri&egrave;re-plan du bureau, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Affichez le fichier ou dossier pour lequel vous souhaitez cr&eacute;er un lien dans une fen&ecirc;tre <application>Nautilus</application>.</para>
        </listitem>
        <listitem>
          <para>Cr&eacute;ez un lien symbolique vers le fichier ou le dossier. Pour cr&eacute;er un lien symbolique vers un fichier ou un dossier, s&eacute;lectionnez le fichier ou le dossier &agrave; lier. S&eacute;lectionnez <menuchoice><guimenu>&Eacute;diter</guimenu><guimenuitem>Cr&eacute;er un lien</guimenuitem></menuchoice>. Un lien vers le fichier ou le dossier est ajout&eacute; au dossier courant. Les liens symboliques peuvent &ecirc;tre identifi&eacute;s gr&acirc;ce &agrave; l'embl&egrave;me fl&eacute;ch&eacute; qui appara&icirc;t par d&eacute;faut sur chacun d'entre eux. La figure suivante illustre un lien symbolique vers un fichier :</para>
          <screenshot>
            <mediaobject>
              <imageobject>
                <imagedata fileref="figures/naut_samplesymlink_icon.png" format="PNG"/>
              </imageobject>
              <textobject>
                <phrase>Icône de fichier avec un emblème de lien symbolique.</phrase>
              </textobject>
            </mediaobject>
          </screenshot>
        </listitem>
        <listitem>
          <para>Faites glisser le lien symbolique sur l'arri&egrave;re-plan du bureau. L'ic&ocirc;ne associ&eacute;e &agrave; l'objet est d&eacute;plac&eacute;e vers l'arri&egrave;re-plan du bureau. </para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gosdeskback-16">
      <title>Ajout d'un fichier ou d'un dossier &agrave; l'arri&egrave;re-plan du bureau</title>
      <indexterm>
        <primary>arri&egrave;re-plan du bureau</primary>
        <secondary>ajout d'un fichier ou d'un dossier &agrave;</secondary>
      </indexterm>
      <indexterm>
        <primary>objets d'arri&egrave;re-plan du bureau</primary>
        <secondary>fichiers et dossiers</secondary>
      </indexterm>
      <para>La section suivante d&eacute;crit l'ajout d'objets fichier ou dossier &agrave; l'arri&egrave;re-plan du bureau.</para>
      <sect3 id="gosdeskback-18">
        <title>D&eacute;placement d'un fichier ou d'un dossier vers l'arri&egrave;re-plan du bureau</title>
        <indexterm>
          <primary>arri&egrave;re-plan du bureau</primary>
          <secondary>d&eacute;placement d'un fichier ou d'un dossier vers</secondary>
        </indexterm>
        <para>Vous pouvez d&eacute;placer un fichier ou un dossier d'une fen&ecirc;tre <application>Nautilus</application> vers l'arri&egrave;re-plan du bureau. Pour ce faire, proc&eacute;dez comme suit : </para>
        <orderedlist>
          <listitem>
            <para>Ouvrez une fen&ecirc;tre <application>Nautilus</application>. </para>
          </listitem>
          <listitem>
            <para>Dans le volet d'affichage, ouvrez le fichier ou le dossier &agrave; d&eacute;placer.</para>
          </listitem>
          <listitem>
            <para>Faites-le glisser vers l'arri&egrave;re-plan du bureau. L'ic&ocirc;ne du fichier ou du dossier est d&eacute;plac&eacute;e vers l'arri&egrave;re-plan du bureau. Le fichier ou le dossier est d&eacute;plac&eacute; vers le r&eacute;pertoire correspondant.</para>
            <para>Vous pouvez &eacute;galement s&eacute;lectionner le fichier ou le dossier, puis <menuchoice><guimenu> &Eacute;diter</guimenu><guimenuitem>Couper les fichiers</guimenuitem></menuchoice>. Cliquez avec le bouton droit sur l'un des objets de l'arri&egrave;re-plan, puis s&eacute;lectionnez <guimenuitem>Coller les fichiers</guimenuitem>. </para>
          </listitem>
        </orderedlist>
<!--<para><emphasis>Question</emphasis>: Do we need to document To Move a File or Folder>>From&lt;&lt; the Desktop Background? (with cut file and paste file)</para>
<para>What about Cut, Copy and Paste solely in reference to the desktop background.
Eg, to create a copy of a file by copying it from the desktop background,
then pasting it?</para>-->
      </sect3>
      <sect3 id="gosdeskback-17">
        <title>Copie d'un fichier ou d'un dossier sur l'arri&egrave;re-plan du bureau</title>
        <indexterm>
          <primary>arri&egrave;re-plan du bureau</primary>
          <secondary>copie d'un fichier ou d'un dossier vers</secondary>
        </indexterm>
        <para>Vous pouvez copier un fichier ou un dossier d'une fen&ecirc;tre <application>Nautilus</application> sur l'arri&egrave;re-plan du bureau. Pour ce faire, proc&eacute;dez comme suit : </para>
        <orderedlist>
          <listitem>
            <para>Ouvrez une fen&ecirc;tre <application>Nautilus</application>. </para>
          </listitem>
          <listitem>
            <para>Dans le volet d'affichage, ouvrez le fichier ou le dossier &agrave; d&eacute;placer.</para>
          </listitem>
          <listitem>
            <para>Maintenez la touche <keycap>Ctrl</keycap> enfonc&eacute;e, puis faites glisser le fichier ou le dossier sur l'arri&egrave;re-plan du bureau. Une ic&ocirc;ne repr&eacute;sentant le fichier ou le dossier appara&icirc;t sur l'arri&egrave;re-plan du bureau. Le fichier ou le dossier est copi&eacute; dans le r&eacute;pertoire correspondant.</para>
            <para>Vous pouvez &eacute;galement s&eacute;lectionner le fichier ou le dossier, puis <menuchoice><guimenu> &Eacute;diter</guimenu><guimenuitem>Copier les fichiers</guimenuitem></menuchoice>. Cliquez avec le bouton droit sur l'un des objets de l'arri&egrave;re-plan, puis s&eacute;lectionnez <guimenuitem>Coller les fichiers</guimenuitem>. </para>
          </listitem>
        </orderedlist>
      </sect3>
      <sect3 id="gosdeskback-19">
        <title>Cr&eacute;ation d'un objet dossier sur l'arri&egrave;re-plan du bureau</title>
        <indexterm>
          <primary>arri&egrave;re-plan du bureau</primary>
          <secondary>cr&eacute;ation d'un dossier sur</secondary>
        </indexterm>
        <para>Pour cr&eacute;er un objet dossier, cliquez avec le bouton droit sur l'arri&egrave;re-plan du bureau pour ouvrir le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu>. S&eacute;lectionnez <guimenuitem>Nouveau dossier</guimenuitem>. Un dossier <guilabel>sans titre</guilabel> appara&icirc;t. Entrez le nom du nouveau dossier, puis appuyez sur <keycap>Entr&eacute;e</keycap>. Le dossier s'affiche avec le nouveau nom. Le nouveau dossier r&eacute;side dans le r&eacute;pertoire correspondant.</para>
      </sect3>
    </sect2>
    <sect2 id="gosdeskback-25">
      <title>Suppression d'un objet de l'arri&egrave;re-plan du bureau</title>
      <indexterm>
        <primary>arri&egrave;re-plan du bureau</primary>
        <secondary>suppression d'un objet de</secondary>
      </indexterm>
      <indexterm>
        <primary>objets d'arri&egrave;re-plan du bureau </primary>
        <secondary>suppression</secondary>
      </indexterm>
      <para>Pour supprimer un objet de l'arri&egrave;re-plan du bureau, cliquez  sur celui-ci avec le bouton droit, puis s&eacute;lectionnez <guimenuitem>D&eacute;placer vers la corbeille</guimenuitem>. Vous pouvez &eacute;galement faire glisser l'objet dans la <guilabel>Corbeille</guilabel>.</para>
    </sect2>
    <sect2 id="gosdeskback-86">
      <title>Suppression d'un objet de l'arri&egrave;re-plan du bureau</title>
      <indexterm>
        <primary>arri&egrave;re-plan du bureau</primary>
        <secondary>suppression d'un objet de</secondary>
      </indexterm>
      <indexterm>
        <primary>objets d'arri&egrave;re-plan du bureau </primary>
        <secondary>suppression</secondary>
      </indexterm>
      <para>Lorsque vous supprimez un objet de l'arri&egrave;re-plan du bureau, celui-ci n'est pas d&eacute;plac&eacute; dans la <guilabel>Corbeille</guilabel>, mais il dispara&icirc;t imm&eacute;diatement du bureau. L'&eacute;l&eacute;ment de menu <guimenuitem>Supprimer</guimenuitem> n'est disponible que si vous s&eacute;lectionnez  <guilabel>Inclure une commande de suppression sans d&eacute;placement des fichiers dans la corbeille</guilabel> dans la bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences</guilabel> de <application>Nautilus</application>. </para>
      <para>Pour supprimer un objet de l'arri&egrave;re-plan du bureau, cliquez avec le bouton droit sur l'objet, puis s&eacute;lectionnez <guimenuitem>Supprimer</guimenuitem>. </para>
    </sect2>
  </sect1>
  <sect1 id="gosdeskback-8">
    <title>Utilisation de la corbeille sur l'arri&egrave;re-plan du bureau</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary>utilisation de la corbeille</secondary>
    </indexterm>
    <indexterm>
      <primary>corbeille</primary>
      <secondary>utilisation sur l'arri&egrave;re-plan du bureau</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_trash_launcher.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icône Corbeille de Nautilus.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Vous pouvez d&eacute;placer les &eacute;l&eacute;ments suivants dans la <guilabel>Corbeille</guilabel> :</para>
    <itemizedlist>
      <listitem>
        <para>Fichiers</para>
      </listitem>
      <listitem>
        <para>Dossiers</para>
      </listitem>
      <listitem>
        <para>des objets de l'arri&egrave;re-plan du bureau.</para>
      </listitem>
    </itemizedlist>
    <para>Si vous devez r&eacute;cup&eacute;rer un fichier dans la <guilabel>Corbeille</guilabel>, vous pouvez consulter <guilabel>Corbeille</guilabel>
et d&eacute;placez le fichier de la <guilabel>Corbeille</guilabel>. Lorsque vous videz la <guilabel>Corbeille</guilabel>, vous supprimez les &eacute;l&eacute;ments de la <guilabel>Corbeille</guilabel> de mani&egrave;re permanente. </para>
    <sect2 id="gosdeskback-44">
      <title>Affichage de la corbeille</title>
      <indexterm>
        <primary>Corbeille</primary>
        <secondary>affichage</secondary>
      </indexterm>
      <para>Vous pouvez afficher le contenu de la <guilabel>Corbeille</guilabel> en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
      <itemizedlist>
        <listitem>
          <para>Depuis l'arri&egrave;re-plan du bureau :</para>
          <para>Cliquez deux fois sur l'objet <guilabel>Corbeille</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. Son contenu s'affiche dans une fen&ecirc;tre <application> Nautilus</application>.</para>
        </listitem>
        <listitem>
          <para>Depuis une fen&ecirc;tre <application>Nautilus</application> :</para>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>Corbeille</guimenuitem></menuchoice>. Le contenu de la <guilabel>Corbeille</guilabel> s'affiche dans la fen&ecirc;tre.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosdeskback-10">
      <title>Purge de la corbeille</title>
      <indexterm>
        <primary>Corbeille</primary>
        <secondary>purge</secondary>
      </indexterm>
      <para>Vous pouvez vider le contenu de la  <guilabel>Corbeille</guilabel> en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
      <itemizedlist>
        <listitem>
          <para>Depuis l'arri&egrave;re-plan du bureau :</para>
          <para>Cliquez avec le bouton droit sur l'objet <guilabel>Corbeille</guilabel>, puis s&eacute;lectionnez <guimenuitem>Vider la corbeille</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>Depuis une fen&ecirc;tre <application>Nautilus</application> :</para>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Vider la corbeille</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosdeskback-9">
    <title>Utilisation du menu Arri&egrave;re-plan du bureau</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary>utilisation</secondary>
    </indexterm>
    <indexterm>
      <primary>menu Arri&egrave;re-plan du bureau</primary>
      <secondary>description</secondary>
    </indexterm>
    <indexterm>
      <primary>menus</primary>
      <secondary>menu Arri&egrave;re-plan du bureau</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/file_manager_menu.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Menu Arrière-plan du bureau. Le contexte décrit le graphique.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>menu Arri&egrave;re-plan du bureau</primary>
      <secondary>illustration </secondary>
    </indexterm>
    <para>Pour ouvrir le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu>, cliquez avec le bouton droit sur un espace libre de l'arri&egrave;re-plan du bureau. Ce menu permet d'ex&eacute;cuter des actions sur l'arri&egrave;re-plan du bureau.</para>
    <para><xref linkend="gosdeskback-TBL-85"/> d&eacute;crit les &eacute;l&eacute;ments du menu <guimenu>Arri&egrave;re-plan du bureau</guimenu>.</para>
    <table frame="topbot" id="gosdeskback-TBL-85">
      <title>&Eacute;l&eacute;ments du menu Arri&egrave;re-plan du bureau</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="35.94*"/>
        <colspec colname="colspec1" colwidth="64.06*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option de menu</para>
            </entry>
            <entry valign="top">
              <para>Fonction </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Nouvelle fen&ecirc;tre</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Ouvre une nouvelle fen&ecirc;tre <application>Nautilus</application> affichant le dossier personnel.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nouveau dossier</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cr&eacute;e un nouvel objet dossier sur l'arri&egrave;re-plan du bureau. Le dossier est cr&eacute;&eacute; dans le r&eacute;pertoire correspondant.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nouveau Terminal </guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>D&eacute;marre un <application>Terminal GNOME</application>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nouveau lanceur</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Cr&eacute;e un lanceur sur l'arri&egrave;re-plan du bureau. Pour plus d'informations, consultez <xref linkend="gosdeskback-3"/>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guisubmenu>Scripts</guisubmenu>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Ouvre un sous-menu contenant les scripts que vous pouvez ex&eacute;cuter.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nettoyer par nom</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Dispose les objets situ&eacute;s sur l'arri&egrave;re-plan du bureau dans l'ordre alphab&eacute;tique, en fonction de leur nom.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Couper les fichiers</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Supprime le ou les fichiers s&eacute;lectionn&eacute;s du dossier ou de l'arri&egrave;re-plan du bureau et les place dans un tampon.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Copier les fichiers</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Copie le ou les fichiers s&eacute;lectionn&eacute;s du dossier ou de l'arri&egrave;re-plan du bureau et les place dans un tampon.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Coller les fichiers</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Place le ou les fichiers du tampon dans le dossier s&eacute;lectionn&eacute; ou sur l'arri&egrave;re-plan du bureau.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Disques</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Vous permet de monter des disquettes, des CD et d'autres supports amovibles.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Modifier l'arri&egrave;re-plan du bureau</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>D&eacute;marre l'outil de pr&eacute;f&eacute;rence <application>Arri&egrave;re-plan</application> vous permettant de modifier l'arri&egrave;re-plan du bureau.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Utiliser l'arri&egrave;re-plan par d&eacute;faut</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>R&eacute;initialise le dernier motif s&eacute;lectionn&eacute; dans la bo&icirc;te de dialogue <guilabel>Arri&egrave;re-plans et embl&egrave;mes</guilabel>. Vous pouvez acc&eacute;der &agrave; celle-ci depuis les fen&ecirc;tres <application> Nautilus</application>.</para>
<!--<para><emphasis>Comment:</emphasis> It does not reset the last color that you chose from the <guilabel>Backgrounds and Emblems</guilabel> dialog.</para>-->
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="gosdeskback-12">
    <title>Modification du motif ou de la couleur de l'arri&egrave;re-plan du bureau</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary>modification du motif ou de la couleur</secondary>
    </indexterm>
    <indexterm>
      <primary>arri&egrave;re-plans</primary>
      <secondary>modification de l'arri&egrave;re-plan du bureau</secondary>
    </indexterm>
    <para>Vous pouvez modifier le motif ou la couleur de l'arri&egrave;re-plan du bureau selon vos pr&eacute;f&eacute;rences. <application> Nautilus</application> contient des motifs et des couleurs d'arri&egrave;re-plan que vous pouvez utiliser pour modifier l'aspect de l'arri&egrave;re-plan du bureau. </para>
    <para>Vous pouvez modifier le motif ou la couleur de l'arri&egrave;re-plan du bureau de l'une des fa&ccedil;ons suivantes : </para>
    <itemizedlist>
      <listitem>
        <para>en faisant glisser un motif ou une couleur depuis une fen&ecirc;tre ou une bo&icirc;te de dialogue vers l'arri&egrave;re-plan. </para>
        <para>Si l'arri&egrave;re-plan est une couleur, vous pouvez cr&eacute;er un d&eacute;grad&eacute; &agrave; partir d'une couleur d'arri&egrave;re-plan. Un d&eacute;grad&eacute; est un effet visuel dans lequel une couleur se fond progressivement en une autre couleur. Pour cr&eacute;er un d&eacute;grad&eacute;, faites glisser une couleur sur un c&ocirc;t&eacute; de l'&eacute;cran. La couleur se m&eacute;lange depuis le c&ocirc;t&eacute; de l'&eacute;cran o&ugrave; vous l'avez faite glisser jusqu'au c&ocirc;t&eacute; oppos&eacute;.</para>
        <para>Avant de faire glisser une couleur vers un c&ocirc;t&eacute; de l'&eacute;cran, v&eacute;rifiez s'il existe un volet sur le c&ocirc;t&eacute; de l'&eacute;cran. Si c'est le cas, vous devez cacher le volet avant de faire glisser la couleur.</para>
      </listitem>
      <listitem>
        <para>Utilisez l'outil de pr&eacute;f&eacute;rence <application>Arri&egrave;re-plan</application>. </para>
      </listitem>
      <listitem>
        <para>Choisissez un motif ou une couleur dans la bo&icirc;te de dialogue <guilabel> Arri&egrave;re-plans et embl&egrave;mes</guilabel>. Vous pouvez modifier le motif ou la couleur de l'arri&egrave;re-plan du bureau de l'une des fa&ccedil;ons suivantes : </para>
        <orderedlist>
          <listitem>
            <para>Ouvrez une fen&ecirc;tre <application>Nautilus</application>.</para>
          </listitem>
          <listitem>
            <para>S&eacute;lectionnez <menuchoice><guimenu>&Eacute;diter</guimenu><guimenuitem> Arri&egrave;re-plans et embl&egrave;mes</guimenuitem></menuchoice>. La bo&icirc;te de dialogue <guilabel>Arri&egrave;re-plans et embl&egrave;mes</guilabel> s'affiche. </para>
          </listitem>
          <listitem>
            <para>Pour afficher une liste des motifs, cliquez sur le bouton <guibutton>Motifs</guibutton>. Pour afficher une liste des couleurs, cliquez sur le bouton <guibutton>Couleurs</guibutton>. </para>
          </listitem>
          <listitem>
            <para>Pour remplacer l'arri&egrave;re-plan par un motif, faites glisser le motif sur l'arri&egrave;re-plan. Pour remplacer l'arri&egrave;re-plan par une couleur, faites glisser la couleur sur l'arri&egrave;re-plan. </para>
          </listitem>
          <listitem>
            <para>Cliquez sur <guibutton>Fermer</guibutton> pour fermer la bo&icirc;te de dialogue.</para>
          </listitem>
        </orderedlist>
      </listitem>
    </itemizedlist>
  </sect1>
</chapter>
