<?xml version="1.0" encoding="utf-8"?>
<chapter id="goseditmainmenu-1">
  <title>Utilisation des menus</title>
  <highlights>
    <para>Le pr&eacute;sent chapitre d&eacute;crit l'utilisation des menus du bureau. </para>
  </highlights>
  <sect1 id="goseditmainmenu-2">
    <title>Introduction aux menus</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>introduction</secondary>
    </indexterm>
    <para>Vous pouvez acc&eacute;der &agrave; toutes les fonctions du bureau par le biais des menus. Le Panneau de menus contient des menus que vous pouvez utiliser conjointement avec des tableaux de bord pour ex&eacute;cuter vos t&acirc;ches. Diff&eacute;rentes actions sont possibles depuis les menus, par exemple copier des &eacute;l&eacute;ments de menu dans des tableaux de bord.</para>
    <para>Vous pouvez ouvrir les menus suivants depuis le bureau :</para>
    <itemizedlist>
      <listitem>
        <para>Le menu <guimenu>Applications</guimenu> :Vous pouvez acc&eacute;der &agrave; de nombreuses applications, commandes et options de configuration depuis le menu <guimenu> Applications</guimenu>. Vous pouvez &eacute;galement acc&eacute;der aux outils de pr&eacute;f&eacute;rence du bureau par le biais du menu <guimenu> Applications</guimenu>. </para>
      </listitem>
      <listitem>
        <para>Le menu <guimenu>Actions</guimenu> :Le menu <guimenu>Actions</guimenu> contient diff&eacute;rentes commandes vous permettant d'ex&eacute;cuter diff&eacute;rentes t&acirc;ches sur l'arri&egrave;re-plan du bureau. Par exemple, vous pouvez d&eacute;marrer l'application <application>Outil de recherche</application> ou vous d&eacute;connecter du bureau. </para>
      </listitem>
      <listitem>
        <para><guimenu>Menu GNOME</guimenu> :Vous pouvez &eacute;galement ouvrir les &eacute;l&eacute;ments des menus <guimenu>Applications</guimenu> et <guimenu>Actions</guimenu> depuis le <guimenu>menu GNOME</guimenu>. Vos tableaux de bord peuvent contenir de nombreux boutons <guimenu>Menu GNOME</guimenu>. </para>
      </listitem>
    </itemizedlist>
    <para>Il est &eacute;galement possible d'ouvrir le menu <guimenu> Arri&egrave;re-plan du bureau</guimenu> en cliquant avec le bouton droit. Celui-ci vous permet d'ex&eacute;cuter des t&acirc;ches associ&eacute;es &agrave; l'arri&egrave;re-plan du bureau. </para>
    <para>Tous ces menus vous proposent diff&eacute;rentes m&eacute;thodes pour l'ex&eacute;cution des t&acirc;ches et vous permettent de travailler de la mani&egrave;re qui vous convient le mieux.</para>
  </sect1>
  <sect1 id="goseditmainmenu-5">
    <title>Caract&eacute;ristiques des menus</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>caract&eacute;ristiques</secondary>
    </indexterm>
    <para>Les menus peuvent contenir les &eacute;l&eacute;ments suivants : </para>
    <itemizedlist>
      <listitem>
        <para>des sous-menus ;</para>
      </listitem>
      <listitem>
        <para>des lanceurs ou des &eacute;l&eacute;ments de menu.</para>
      </listitem>
    </itemizedlist>
    <para>Une fl&egrave;che situ&eacute;e &agrave; droite d'un &eacute;l&eacute;ment de menu signifie qu'il s'agit d'un sous-menu. Lorsque vous pointez sur le sous-menu, celui-ci s'ouvre. Vous pouvez alors s&eacute;lectionner ses &eacute;l&eacute;ments. </para>
    <para>Lorsque vous s&eacute;lectionnez un lanceur, celui-ci d&eacute;marre une application ou ex&eacute;cute une commande. Vous pouvez &eacute;galement cliquer avec le bouton droit sur le lanceur pour ouvrir un menu contextuel. Celui-ci vous permet d'ajouter l'&eacute;l&eacute;ment choisi &agrave; un tableau de bord et d'ex&eacute;cuter d'autres t&acirc;ches. Pour plus d'informations sur les menus contextuels, consultez la section suivante. </para>
    <para>Vous pouvez changer le th&egrave;me de votre session pour modifier l'apparence de tous les menus. Pour modifier le th&egrave;me, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guimenuitem> Th&egrave;me</guimenuitem></menuchoice>.</para>
    <sect2 id="goseditmainmenu-11">
      <title>Menu contextuel d'un &eacute;l&eacute;ment de menu</title>
      <indexterm>
        <primary>menus</primary>
        <secondary>menu contextuel d'un &eacute;l&eacute;ment de menu</secondary>
      </indexterm>
      <indexterm>
        <primary>menu contextuel d'un &eacute;l&eacute;ment de menu</primary>
        <secondary> description</secondary>
      </indexterm>
      <para>A chaque &eacute;l&eacute;ment d'un menu est associ&eacute; un menu contextuel qui vous permet d'ex&eacute;cuter des t&acirc;ches li&eacute;es &agrave; celui-ci. Lorsque vous cliquez avec le bouton droit sur un &eacute;l&eacute;ment de menu, le menu contextuel de cet &eacute;l&eacute;ment s'affiche. Il contient &eacute;galement un sous-menu vous permettant d'ex&eacute;cuter des t&acirc;ches qui lui sont associ&eacute;es. </para>
      <para>Vous pouvez utiliser le menu contextuel du lanceur pour ex&eacute;cuter les t&acirc;ches suivantes : </para>
      <itemizedlist>
        <listitem>
          <para>ajouter des &eacute;l&eacute;ments de menu en tant que lanceurs aux panneaux ; </para>
        </listitem>
        <listitem>
          <para>supprimer des &eacute;l&eacute;ments des menus ;</para>
        </listitem>
        <listitem>
          <para>ouvrir la bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel> &agrave; l'aide de la commande de l'&eacute;l&eacute;ment de menu dans la bo&icirc;te de dialogue ;</para>
        </listitem>
        <listitem>
          <para>ajouter des menus aux panneaux ; ajouter un menu sous la forme d'un objet de menu ou de tiroir ; </para>
        </listitem>
        <listitem>
          <para>ajouter de nouveaux &eacute;l&eacute;ments aux menus ;</para>
        </listitem>
        <listitem>
          <para>modifier les propri&eacute;t&eacute;s des sous-menus et des &eacute;l&eacute;ments de menu ;</para>
        </listitem>
      </itemizedlist>
      <para><xref linkend="goseditmainmenu-FIG-39"/> affiche le menu contextuel.</para>
      <indexterm>
        <primary>menu contextuel d'un &eacute;l&eacute;ment de menu</primary>
        <secondary>illustration </secondary>
      </indexterm>
      <figure id="goseditmainmenu-FIG-39">
        <title>Menu contextuel d'un &eacute;l&eacute;ment de menu</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/launcher_popup.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Menu contextuel d'un élément de menu. Le contexte décrit le graphique.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para><xref linkend="goseditmainmenu-TBL-30"/> d&eacute;crit les menus contextuels d'un &eacute;l&eacute;ment de menu. <indexterm><primary>lanceurs</primary><secondary>ajout au tableau de bord </secondary></indexterm></para>
      <table frame="topbot" id="goseditmainmenu-TBL-30">
        <title>Menus contextuels d'un &eacute;l&eacute;ment de menu</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="42.71*"/>
          <colspec colname="colspec1" colwidth="57.29*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>&Eacute;l&eacute;ment</para>
              </entry>
              <entry valign="top">
                <para>Description</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guimenuitem>Ajouter ce lanceur au tableau de bord</guimenuitem>
                </para>
              </entry>
              <entry valign="top">
                <para>Ajoute le lanceur au tableau de bord depuis lequel vous ouvrez le menu.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <guimenuitem>Supprimer cet &eacute;l&eacute;ment</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Supprime le lanceur du menu.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guimenuitem>Mettre dans la bo&icirc;te de dialogue d'ex&eacute;cution</guimenuitem>
                </para>
              </entry>
              <entry valign="top">
                <para>Affiche la bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel> en y ins&eacute;rant la commande de la zone correspondante du lanceur. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <guimenuitem>Aide sur <replaceable>nom_application </replaceable></guimenuitem>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Ouvre l'aide en ligne relative &agrave; l'application.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Affiche une bo&icirc;te de dialogue vous permettant d'&eacute;diter les propri&eacute;t&eacute;s du lanceur.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <menuchoice>
                    <guimenu>Tout le menu</guimenu>
                    <guimenuitem>Ajouter ceci comme tiroir au tableau de bord</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Ajoute le sous-menu au tableau de bord depuis lequel vous ouvrez le menu sous la forme d'un tiroir.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <menuchoice>
                    <guimenu>Tout le menu</guimenu>
                    <guimenuitem>Ajouter ceci comme menu au tableau de bord</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Ajoute le sous-menu au tableau de bord depuis lequel vous ouvrez le menu sous la forme d'un &eacute;l&eacute;ment de menu. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <menuchoice>
                    <guimenu>Tout le menu</guimenu>
                    <guimenuitem>Ajouter une nouvelle option &agrave; ce menu</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Vous permet d'ajouter un &eacute;l&eacute;ment &agrave; un sous-menu. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>
                  <menuchoice>
                    <guimenu>Tout le menu</guimenu>
                    <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem>
                  </menuchoice>
                </para>
              </entry>
              <entry colname="colspec1">
                <para>Affiche une bo&icirc;te de dialogue vous permettant d'&eacute;diter les propri&eacute;t&eacute;s du sous-menu.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
      <indexterm>
        <primary>menus</primary>
        <secondary>ajout au tableau de bord</secondary>
      </indexterm>
    </sect2>
  </sect1>
  <sect1 id="goseditmainmenu-8">
    <title>Menu Applications</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>menu Applications</secondary>
    </indexterm>
    <para>Le menu <guimenu>Applications</guimenu> contient une hi&eacute;rarchie de sous-menus &agrave; partir desquels vous pouvez d&eacute;marrer les applications standard de GNOME et les outils de pr&eacute;f&eacute;rence. Le menu <guimenu>Applications</guimenu> contient le menu <guimenu> Pr&eacute;f&eacute;rences du bureau</guimenu>. Vous pouvez utiliser celui-ci pour d&eacute;marrer les outils de pr&eacute;f&eacute;rence du bureau. Le menu <guimenu>Applications </guimenu> comprend &eacute;galement le gestionnaire de fichiers et le navigateur de l'aide.</para>
    <para>Le menu <guimenu>Applications</guimenu> r&eacute;side aux endroits suivants : </para>
    <itemizedlist>
      <listitem>
        <para>le panneau de menus ;</para>
      </listitem>
      <listitem>
        <para>emplacement <guilabel>D&eacute;marrer ici</guilabel><application> Nautilus</application> ;</para>
      </listitem>
      <listitem>
        <para><guimenu>menu GNOME</guimenu>.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goseditmainmenu-51">
    <title>Menu Actions</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>menu Actions</secondary>
    </indexterm>
    <para>Le menu <guimenu>Actions</guimenu> contient diff&eacute;rentes commandes vous permettant d'ex&eacute;cuter des t&acirc;ches sur le bureau. <xref linkend="goseditmainmenu-TBL-52"/> d&eacute;crit les commandes du menu <guimenu>Actions</guimenu>.</para>
    <table frame="topbot" id="goseditmainmenu-TBL-52">
      <title>Commandes du menu Actions</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colwidth="38.48*"/>
        <colspec colwidth="61.52*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option de menu</para>
            </entry>
            <entry valign="top">
              <para> Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Lancer un programme</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Ouvre la bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel>. Utilisez cette bo&icirc;te de dialogue pour ex&eacute;cuter des commandes. Pour plus d'informations, consultez <xref linkend="gospanel-23"/>.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Rechercher des fichiers</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>D&eacute;marre l'application <application>Outil de recherche</application>. Pour plus d'informations, consultez le manuel <citetitle>Outil de recherche</citetitle>.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Capture d'&eacute;cran</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>R&eacute;alise une capture d'&eacute;cran de votre bureau et ouvre la bo&icirc;te de dialogue <guilabel>Capture d'&eacute;cran</guilabel>. Utilisez cette bo&icirc;te de dialogue pour enregistrer la capture.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Verrouiller l'&eacute;cran</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Verrouille votre &eacute;cran. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>D&eacute;connecter</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Vous d&eacute;connecte de la session en cours. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Le menu <guimenu>Actions</guimenu> r&eacute;side aux endroits suivants : </para>
    <itemizedlist>
      <listitem>
        <para>panneau de menus ; </para>
      </listitem>
      <listitem>
        <para><guimenu>menu GNOME</guimenu>. Les &eacute;l&eacute;ments du menu <guimenu> Actions</guimenu> se trouvent au niveau le plus &eacute;lev&eacute; du <guimenu>menu GNOME</guimenu>. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gospanel-23">
      <title>Utilisation de la bo&icirc;te de dialogue Lancer un programme</title>
      <indexterm>
        <primary>Bo&icirc;te de dialogue Lancer un programme, utilisation</primary>
      </indexterm>
      <para>La bo&icirc;te de dialogue <guilabel>Lancer  un programme</guilabel> vous donne acc&egrave;s &agrave; la ligne de commande. Lorsque vous ex&eacute;cutez une commande dans la bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel>, vous ne pouvez pas recevoir la sortie de la commande.</para>
      <para>Pour ex&eacute;cuter une commande depuis la ligne de commande, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Affichez la bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel>. Vous pouvez l'appeler en recourant &agrave; l'une des m&eacute;thodes suivantes :<itemizedlist><listitem><para>Depuis le panneau de menus :</para><para>S&eacute;lectionnez <menuchoice><guimenu>Actions</guimenu><guimenuitem>Lancer un programme</guimenuitem></menuchoice>.</para></listitem><listitem><para>Depuis le <guimenu>menu GNOME</guimenu> :</para><para>Ouvrez le <guimenu>menu GNOME</guimenu>, puis s&eacute;lectionnez <guimenuitem>Lancer un programme</guimenuitem>.</para></listitem><listitem><para>A l'aide des touches de raccourci :</para><para>Les touches de raccourci par d&eacute;faut pour afficher la bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel> sont <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo>. Vous pouvez modifier les touches de raccourci permettant d'appeler cette bo&icirc;te de dialogue dans l'outil de pr&eacute;f&eacute;rence <application>Raccourcis clavier</application>. Pour ce faire, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guimenuitem>Raccourcis clavier</guimenuitem></menuchoice>.</para></listitem><listitem><para>&Agrave; partir du menu contextuel d'un &eacute;l&eacute;ment de menu</para><para>Cliquez avec le bouton droit sur un &eacute;l&eacute;ment de menu, puis s&eacute;lectionnez <guilabel>Mettre dans la bo&icirc;te de dialogue d'ex&eacute;cution</guilabel> dans le menu contextuel. La bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel> s'ouvre et indique la commande du menu dans la zone de commande.</para></listitem></itemizedlist></para>
          <para>La bo&icirc;te de dialogue <guilabel>Lancer un programme</guilabel> s'affiche.</para>
        </listitem>
        <listitem>
          <para>Entrez la commande &agrave; ex&eacute;cuter dans la zone vide. Pour s&eacute;lectionner une commande d&eacute;j&agrave; ex&eacute;cut&eacute;e auparavant, cliquez sur la fl&egrave;che dirig&eacute;e vers le bas situ&eacute;e en regard de la zone de commande, puis s&eacute;lectionnez la commande &agrave; ex&eacute;cuter.</para>
          <para>Vous pouvez &eacute;galement cliquer sur le bouton <guibutton>Applications connues</guibutton> pour afficher une liste des applications disponibles.</para>
          <para>Il est &eacute;galement possible d'utiliser le bouton <guibutton>Joindre un fichier</guibutton> pour s&eacute;lectionner un fichier &agrave; joindre &agrave; la ligne de commande. Par exemple, vous pouvez entrer <application> emacs</application> comme commande, puis s&eacute;lectionner un fichier &agrave; &eacute;diter.</para>
          <para>L'option <guilabel>Ex&eacute;cuter dans un terminal</guilabel> permet d'ex&eacute;cuter l'application ou la commande dans une fen&ecirc;tre de terminal. Choisissez cette option pour une application ou une commande qui ne cr&eacute;e pas de fen&ecirc;tre dans laquelle s'ex&eacute;cuter.</para>
        </listitem>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>Ex&eacute;cuter</guibutton> dans la bo&icirc;te de dialogue <guilabel> Lancer un programme</guilabel>. </para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goseditmainmenu-53">
      <title>R&eacute;alisation d'une capture d'&eacute;cran</title>
      <indexterm>
        <primary>captures d'&eacute;cran, r&eacute;alisation</primary>
      </indexterm>
      <para>Vous pouvez r&eacute;aliser une capture d'&eacute;cran en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
      <itemizedlist>
        <listitem>
          <para>Utilisez le menu <guimenu>Actions</guimenu>.</para>
          <para>Pour r&eacute;aliser une capture de l'&eacute;cran entier, s&eacute;lectionnez <menuchoice><guimenu> Actions</guimenu><guimenuitem>Capture d'&eacute;cran</guimenuitem></menuchoice>. Une bo&icirc;te de dialogue <guilabel>Capture d'&eacute;cran</guilabel> s'affiche. Pour enregistrer la capture d'&eacute;cran, s&eacute;lectionnez l'option <guilabel>Enregistrer la capture d'&eacute;cran dans un fichier</guilabel>. Entrez le chemin et le nom de fichier de la capture d'&eacute;cran dans la zone de liste d&eacute;roulante modifiable. Pour enregistrer la capture d'&eacute;cran dans un autre r&eacute;pertoire, vous pouvez &eacute;galement cliquer sur <guibutton>Parcourir</guibutton>. Lorsque vous s&eacute;lectionnez un r&eacute;pertoire, cliquez sur <guibutton>OK</guibutton>. </para>
          <para>Vous pouvez &eacute;galement enregistrer la capture sur l'arri&egrave;re-plan du bureau. Pour ce faire, s&eacute;lectionnez l'option <guilabel>Enregistrer la capture d'&eacute;cran sur le bureau</guilabel>. </para>
        </listitem>
        <listitem>
          <para>A l'aide des touches de raccourci :</para>
          <para>Pour r&eacute;aliser une capture d'&eacute;cran, utilisez les touches de raccourci suivantes :</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="35.67*"/>
              <colspec colname="colspec1" colwidth="64.33*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Touches de raccourci par d&eacute;faut</para>
                  </entry>
                  <entry valign="top">
                    <para>Fonction</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <keycap>Impr. &eacute;cran</keycap>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>R&eacute;alise une capture de l'&eacute;cran entier et affiche la bo&icirc;te de dialogue <guilabel>Capture d'&eacute;cran</guilabel>. Utilisez cette bo&icirc;te de dialogue pour enregistrer la capture.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para><keycombo><keycap>Alt</keycap><keycap>Impr. &eacute;cran</keycap></keycombo></para>
                  </entry>
                  <entry colname="colspec1">
                    <para>R&eacute;alise une capture de la fen&ecirc;tre active et affiche la bo&icirc;te de dialogue <guilabel>Capture d'&eacute;cran</guilabel>. Utilisez cette bo&icirc;te de dialogue pour enregistrer la capture. </para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
          <para>Vous pouvez utiliser l'outil de  pr&eacute;f&eacute;rence <application>Raccourcis clavier</application> pour modifier les touches de raccourci par d&eacute;faut.</para>
        </listitem>
        <listitem>
          <para>Utilisez une commande.</para>
          <para>Vous pouvez utiliser la commande <command>gnome-panel-screenshot</command> pour r&eacute;aliser une capture d'&eacute;cran. Elle r&eacute;alise une capture de l'&eacute;cran entier et affiche la bo&icirc;te de dialogue <guilabel>Capture d'&eacute;cran</guilabel>. Utilisez cette bo&icirc;te de dialogue pour enregistrer la capture. </para>
          <para>Vous pouvez &eacute;galement utiliser les options de la commande <command>gnome-panel-screenshot</command> comme suit : </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="35.67*"/>
              <colspec colname="colspec1" colwidth="64.33*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Option</para>
                  </entry>
                  <entry valign="top">
                    <para> Fonction</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <command>--window</command>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>R&eacute;alise une capture de la fen&ecirc;tre active et affiche la bo&icirc;te de dialogue <guilabel>Capture d'&eacute;cran</guilabel>. La bo&icirc;te de dialogue <guilabel> Capture d'&eacute;cran</guilabel> vous permet d'enregistrer la capture d'&eacute;cran.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <command>--delay=<replaceable>seconds </replaceable></command>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>R&eacute;alise une capture d'&eacute;cran apr&egrave;s le nombre sp&eacute;cifi&eacute; de secondes et affiche la bo&icirc;te de dialogue <guilabel> Capture d'&eacute;cran</guilabel>. Utilisez cette bo&icirc;te de dialogue pour enregistrer la capture.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <command>--help</command>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Affiche les options de la commande.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="goseditmainmenu-7">
    <title>Menu GNOME</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>menu GNOME</secondary>
      <see>menu GNOME </see>
    </indexterm>
    <indexterm>
      <primary>menu GNOME </primary>
      <secondary> introduction</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/open_main_menu.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Menu GNOME ouvert. Eléments de menu : Applications, Menu CDE, Lancer un programme, Rechercher des fichiers, Capture d'écran, Verrouiller l'écran, Déconnecter.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Vous pouvez acc&eacute;der &agrave; la plupart des applications, commandes et options de configuration standard depuis le <guimenu> menu GNOME</guimenu>. </para>
    <para>Le <guimenu>menu GNOME</guimenu> contient les menus principaux et les &eacute;l&eacute;ments de menu sp&eacute;ciaux suivants : </para>
    <itemizedlist>
      <listitem>
        <para><guimenu>Applications</guimenu> :Contient tous les outils de pr&eacute;f&eacute;rence et applications. Ce menu comprend &eacute;galement le gestionnaire de fichiers et le navigateur d'aide.</para>
      </listitem>
      <listitem>
        <para><guimenu>Actions</guimenu> : Contient des commandes vous permettant d'ex&eacute;cuter des t&acirc;ches sur le bureau, par exemple les commandes <guimenuitem>Verrouiller l'&eacute;cran</guimenuitem> et <guimenuitem>D&eacute;connecter</guimenuitem>. Les &eacute;l&eacute;ments du menu <guimenu> Actions</guimenu> se trouvent au niveau le plus &eacute;lev&eacute; du <guimenu>menu GNOME</guimenu>. </para>
      </listitem>
    </itemizedlist>
    <para>Vous pouvez ajouter des boutons <guimenu>Menu GNOME</guimenu> &agrave; vos tableaux de bord. Par d&eacute;faut, le <guimenu>menu GNOME</guimenu> est repr&eacute;sent&eacute; par une ic&ocirc;ne d'empreinte stylis&eacute;e telle que celle-ci :</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icône du menu GNOME.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <sect2 id="goseditmainmenu-15">
      <title>Ouverture du menu GNOME</title>
      <indexterm>
        <primary>Menu GNOME</primary>
        <secondary>ouverture</secondary>
      </indexterm>
      <para>Vous pouvez ouvrir le <guimenu>menu GNOME</guimenu> en recourant &agrave; l'une des m&eacute;thodes suivantes : </para>
      <itemizedlist>
        <listitem>
          <para>Depuis un tableau de bord comportant le <guimenu>menu GNOME</guimenu> :</para>
          <para>Cliquez sur le <guimenu>menu GNOME</guimenu>. </para>
        </listitem>
        <listitem>
          <para>A l'aide des touches de raccourci :</para>
          <para>Vous pouvez employer des touches de raccourci pour ouvrir le <guimenu>menu GNOME</guimenu>. Dans ce cas, celui-ci appara&icirc;t au pointeur de la souris. </para>
          <para>Les touches de raccourci par d&eacute;faut permettant d'ouvrir le <guimenu>menu GNOME</guimenu> sont <keycombo><keycap>Alt</keycap><keycap>F1</keycap></keycombo>. Pour les modifier, s&eacute;lectionnez <menuchoice><guimenu> Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guimenuitem>Raccourcis clavier</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="goseditmainmenu-29">
      <title>Ajout d'un menu GNOME &agrave; un tableau de bord</title>
      <indexterm>
        <primary>Menu GNOME</primary>
        <secondary>ajout &agrave; un tableau de bord</secondary>
      </indexterm>
      <para>Vous pouvez ajouter autant de boutons <guimenu>Menu GNOME</guimenu> que vous le voulez &agrave; vos tableaux de bord. Pour ce faire, cliquez avec le bouton droit sur un espace libre du tableau de bord. S&eacute;lectionnez <menuchoice><guimenu> Ajouter au tableau de bord</guimenu><guimenuitem>Menu GNOME</guimenuitem></menuchoice>. </para>
    </sect2>
  </sect1>
  <sect1 id="goseditmainmenu-54">
    <title>Personnalisation des  menus</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>personnalisation</secondary>
    </indexterm>
    <para>Vous pouvez modifier le contenu des menus suivants :</para>
    <itemizedlist>
      <listitem>
        <para>Menu <guimenu>Applications</guimenu></para>
      </listitem>
      <listitem>
        <para>Menu <guimenu>Pr&eacute;f&eacute;rences du bureau</guimenu></para>
      </listitem>
    </itemizedlist>
    <para>Les composants suivants du bureau permettent de personnaliser les menus :</para>
    <itemizedlist>
      <listitem>
        <para>Menus sur les tableaux de bord</para>
      </listitem>
      <listitem>
        <para>Gestionnaire de fichiers <application>Nautilus</application></para>
      </listitem>
    </itemizedlist>
    <para>Lorsque vous avez recours aux panneaux pour personnaliser vos menus, vous utilisez le menu contextuel de l'&eacute;l&eacute;ment de menu. Pour plus d'informations, consultez <xref linkend="goseditmainmenu-11"/>.</para>
    <para>Lorsque vous utilisez <application>Nautilus</application> pour personnaliser vos menus, vous devez ouvrir le menu <guimenu>Applications</guimenu> ou le menu <guimenu> Pr&eacute;f&eacute;rences du bureau</guimenu> depuis <application>Nautilus</application>. Pour acc&eacute;der au menu <guimenu>Applications</guimenu> ou au menu <guimenu>Pr&eacute;f&eacute;rences du bureau</guimenu>, ouvrez une fen&ecirc;tre <application>Nautilus</application>. S&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici</guimenuitem></menuchoice>. Cliquez deux fois sur l'objet <guilabel>Applications</guilabel> ou sur l'objet <guilabel>Pr&eacute;f&eacute;rences du bureau</guilabel>. Pour plus d'informations sur <application>Nautilus</application>, consultez <emphasis>Gestionnaire de fichiers Nautilus </emphasis>.</para>
    <sect2 id="goseditmainmenu-61">
      <title>Ajout d'un menu</title>
      <indexterm>
        <primary>menus</primary>
        <secondary>ajout</secondary>
      </indexterm>
      <para>Pour ajouter un menu, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Dans une fen&ecirc;tre <application>Nautilus</application>, acc&eacute;dez &agrave; l'emplacement auquel le menu doit &ecirc;tre ajout&eacute;. Par exemple, pour ajouter un menu au menu <guimenu> Applications</guimenu>, s&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici</guimenuitem></menuchoice>, puis cliquez deux fois sur l'objet <guilabel> Applications</guilabel>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Fichier</guimenu><guimenuitem> Nouveau dossier</guimenuitem></menuchoice>. Un dossier sans titre est ajout&eacute; au volet d'affichage. Le nom du dossier est s&eacute;lectionn&eacute;.</para>
        </listitem>
        <listitem>
          <para>Donnez-lui un nom, puis appuyez sur <keycap>Entr&eacute;e</keycap>. </para>
        </listitem>
      </orderedlist>
      <para>Lorsque vous vous d&eacute;connectez et que vous vous reconnectez, le menu appara&icirc;t  &agrave; l'emplacement affect&eacute;.</para>
    </sect2>
    <sect2 id="goseditmainmenu-55">
      <title>Ajout d'un lanceur &agrave; un menu</title>
      <indexterm>
        <primary>menus</primary>
        <secondary>ajout de lanceurs</secondary>
      </indexterm>
      <para>Pour ajouter un lanceur &agrave; un menu, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur un &eacute;l&eacute;ment du menu auquel le lanceur doit &ecirc;tre ajout&eacute;. </para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Tout le menu</guimenu><guimenuitem>Ajouter une nouvelle option &agrave; ce menu</guimenuitem></menuchoice>. Une bo&icirc;te de dialogue <guilabel> Cr&eacute;er lanceur</guilabel> s'affiche.</para>
        </listitem>
        <listitem>
          <para>Entrez les propri&eacute;t&eacute;s du lanceur dans la bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel>. Pour plus d'informations sur les &eacute;l&eacute;ments de la bo&icirc;te de dialogue <guilabel> Cr&eacute;er un lanceur</guilabel>, consultez <emphasis>Utilisation des tableaux de bord</emphasis>. </para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>OK</guibutton>.</para>
        </listitem>
      </orderedlist>
      <sect3 id="goseditmainmenu-63">
        <title>Ajout d'un lanceur &agrave; un menu vide</title>
        <para>Pour ajouter un lanceur &agrave; un menu vide, proc&eacute;dez comme suit :</para>
        <orderedlist>
          <listitem>
            <para>Ouvrez une fen&ecirc;tre <application>Nautilus</application>, puis s&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici</guimenuitem></menuchoice>. Vous pouvez &eacute;galement cliquer deux fois sur l'objet <guilabel>D&eacute;marrer ici</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. L'emplacement <guilabel>D&eacute;marrer ici</guilabel> s'affiche. </para>
          </listitem>
          <listitem>
            <para>Dans la fen&ecirc;tre <application>Nautilus</application>, cliquez deux fois sur l'objet repr&eacute;sentant le menu auquel le lanceur doit &ecirc;tre ajout&eacute;. </para>
          </listitem>
          <listitem>
            <para>S&eacute;lectionnez <menuchoice><guimenu>Fichier</guimenu><guimenuitem> Nouveau lanceur</guimenuitem></menuchoice>. Une bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel>  s'affiche.</para>
          </listitem>
          <listitem>
            <para>Entrez les propri&eacute;t&eacute;s du lanceur dans la bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel>. Pour plus d'informations sur les &eacute;l&eacute;ments de la bo&icirc;te de dialogue <guilabel> Cr&eacute;er un lanceur</guilabel>, consultez <emphasis>Utilisation des tableaux de bord</emphasis>. </para>
          </listitem>
          <listitem>
            <para>Cliquez sur <guibutton>OK</guibutton>.</para>
          </listitem>
        </orderedlist>
      </sect3>
    </sect2>
    <sect2 id="goseditmainmenu-56">
      <title>Copie d'un lanceur dans un menu</title>
      <indexterm>
        <primary>menus</primary>
        <secondary>copie de lanceurs</secondary>
      </indexterm>
      <para>Pour copier un lanceur existant dans un menu, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Dans une fen&ecirc;tre <application>Nautilus</application>, acc&eacute;dez &agrave; l'emplacement d'origine du lanceur. Par exemple, pour copier un lanceur depuis le menu <guimenu>Applications</guimenu>, s&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici</guimenuitem></menuchoice>, puis cliquez deux fois sur l'objet <guilabel>Applications</guilabel>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez le lanceur &agrave; copier, puis <menuchoice><guimenu>&Eacute;diter</guimenu><guimenuitem>Copier le fichier</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>Dans une fen&ecirc;tre <application>Nautilus</application>, acc&eacute;dez &agrave; l'emplacement de destination.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>&Eacute;diter</guimenu><guimenuitem> Coller le fichier</guimenuitem></menuchoice>. Le lanceur est ajout&eacute; au nouvel emplacement. </para>
        </listitem>
      </orderedlist>
      <para>Vous pouvez &eacute;galement faire glisser le lanceur d'un emplacement &agrave; un autre. </para>
      <para>Lorsque vous vous d&eacute;connectez et que vous vous reconnectez, le lanceur appara&icirc;t au nouvel emplacement dans le menu.</para>
    </sect2>
    <sect2 id="goseditmainmenu-62">
      <title>&Eacute;dition des propri&eacute;t&eacute;s d'un menu</title>
      <indexterm>
        <primary>menus</primary>
        <secondary>&eacute;dition des propri&eacute;t&eacute;s</secondary>
      </indexterm>
      <para>Pour &eacute;diter les propri&eacute;t&eacute;s d'un menu, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit dans le menu &agrave; &eacute;diter. </para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Tout le menu</guimenu><guimenuitem>Propri&eacute;t&eacute;s</guimenuitem></menuchoice>. Une bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du lanceur </guilabel> s'affiche.</para>
        </listitem>
        <listitem>
          <para>Modifiez les propri&eacute;t&eacute;s du menu dans celle-ci. Pour plus d'informations sur les &eacute;l&eacute;ments de la bo&icirc;te de dialogue <guilabel> Propri&eacute;t&eacute;s du lanceur</guilabel>, consultez <emphasis>Utilisation des tableaux de bord</emphasis>. </para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>OK</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goseditmainmenu-57">
      <title>Edition d'un &eacute;l&eacute;ment de menu</title>
      <indexterm>
        <primary>menus</primary>
        <secondary>&eacute;dition des &eacute;l&eacute;ments de menu</secondary>
      </indexterm>
      <para>Pour &eacute;diter un &eacute;l&eacute;ment de menu, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur l'&eacute;l&eacute;ment &agrave; &eacute;diter.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem>. Une bo&icirc;te de dialogue <guilabel> Propri&eacute;t&eacute;s du lanceur</guilabel> s'affiche.</para>
        </listitem>
        <listitem>
          <para>Celle-ci permet de modifier les propri&eacute;t&eacute;s du lanceur. Pour plus d'informations sur les &eacute;l&eacute;ments de la bo&icirc;te de dialogue <guilabel> Propri&eacute;t&eacute;s du lanceur</guilabel>, consultez <emphasis>Utilisation des tableaux de bord</emphasis>. </para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>OK</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="goseditmainmenu-58">
      <title>Suppression d'un &eacute;l&eacute;ment d'un menu</title>
      <indexterm>
        <primary>menus</primary>
        <secondary>suppression d'&eacute;l&eacute;ments de menu</secondary>
      </indexterm>
      <para>Pour supprimer un &eacute;l&eacute;ment d'un menu, utilisez le menu contextuel de l'&eacute;l&eacute;ment de menu. Pour supprimer un &eacute;l&eacute;ment d'un menu, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur l'&eacute;l&eacute;ment &agrave; supprimer.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <guimenuitem>Supprimer cet &eacute;l&eacute;ment</guimenuitem>. </para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
</chapter>
