<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosmetacity-1">
  <title>Utilisation des fen&ecirc;tres</title>
  <highlights>
    <para>Ce chapitre pr&eacute;sente des informations relatives &agrave; l'utilisation des fen&ecirc;tres du bureau. Vous pouvez utiliser plusieurs types de gestionnaire de fen&ecirc;tres avec le bureau GNOME, par exemple <application>Metacity</application> et <application> Sawfish</application>. Un grand nombre des fonctions de <application>Metacity</application> sont &eacute;galement disponibles dans <application>Sawfish</application>. Le pr&eacute;sent chapitre d&eacute;crit les fonctions associ&eacute;es au gestionnaire de fen&ecirc;tres <application>Metacity</application>.</para>
  </highlights>
  <sect1 id="gosmetacity-712">
    <title>Fen&ecirc;tres et espaces de travail</title>
    <indexterm>
      <primary>fen&ecirc;tres</primary>
      <secondary>introduction</secondary>
    </indexterm>
    <indexterm>
      <primary>espaces de travail</primary>
      <secondary>introduction</secondary>
    </indexterm>
    <para>Vous pouvez afficher plusieurs fen&ecirc;tres simultan&eacute;ment sur le bureau. Celles-ci s'affichent dans des subdivisions du bureau appel&eacute;es espaces de travail. Un espace de travail est une zone dans laquelle vous pouvez travailler. Tous ceux-ci contiennent le m&ecirc;me arri&egrave;re-plan, les m&ecirc;mes tableaux de bord et les m&ecirc;mes menus. Toutefois, vous pouvez ex&eacute;cuter des applications et ouvrir des fen&ecirc;tres diff&eacute;rentes dans chacun d'entre eux. Il est impossible d'afficher plusieurs espaces de travail simultan&eacute;ment sur le bureau. Toutefois, tous peuvent contenir des fen&ecirc;tres ouvertes. </para>
    <para>L'applet <application>Changeur de bureau</application> propose une repr&eacute;sentation visuelle de vos fen&ecirc;tres et espaces de travail, tel qu'illustr&eacute; dans <xref linkend="gosmetacity-FIG-717"/>. </para>
    <figure id="gosmetacity-FIG-717">
      <title>Applet Changeur de bureau</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/workspace_switcher_applet.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Applet Changeur de bureau. Le contexte décrit le graphique.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <para>Vous pouvez ajouter des espaces de travail &agrave; tout moment. Pour ce faire, cliquez avec le bouton droit sur l'applet <application>Changeur de bureau</application>, puis s&eacute;lectionnez <guimenuitem>Pr&eacute;f&eacute;rences</guimenuitem>. La bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences de l'espace de travail</guilabel> s'affiche. La bo&icirc;te de s&eacute;lection num&eacute;rique <guilabel>Nombre de bureaux</guilabel> permet de sp&eacute;cifier le nombre d'espaces de travail requis.</para>
    <sect2 id="gosmetacity-15">
      <title>Comportement du gestionnaire de fen&ecirc;tres</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>gestionnaires de fen&ecirc;tres</secondary>
      </indexterm>
      <para>Un gestionnaire de fen&ecirc;tres d&eacute;termine l'affichage et le comportement des fen&ecirc;tres. Il g&egrave;re &eacute;galement l'emplacement et l'activation de celles-ci, ainsi que le th&egrave;me appliqu&eacute; &agrave; leurs cadres. Le cadre de la fen&ecirc;tre contient des boutons vous permettant d'ex&eacute;cuter des actions standard, telles que d&eacute;placer, fermer et redimensionner les fen&ecirc;tres.</para>
      <para>L'outil de pr&eacute;f&eacute;rence <application> Focus de fen&ecirc;tre</application> permet de configurer certains param&egrave;tres du gestionnaire de fen&ecirc;tres. Le pr&eacute;sent guide d&eacute;crit les fonctions associ&eacute;es au gestionnaire de fen&ecirc;tres <application>Metacity</application>. La configuration par d&eacute;faut est sp&eacute;cifi&eacute;e dans l'outil de pr&eacute;f&eacute;rence <application>Focus de fen&ecirc;tre</application>. Le pr&eacute;sent manuel d&eacute;crit &eacute;galement les fonctions par d&eacute;faut du th&egrave;me Crux.</para>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-713">
    <title>Types de fen&ecirc;tres</title>
    <indexterm>
      <primary>fen&ecirc;tres</primary>
      <secondary>types de</secondary>
    </indexterm>
    <para>Le bureau propose les types de fen&ecirc;tres suivants : </para>
    <itemizedlist>
      <listitem>
        <para>Fen&ecirc;tres d'application </para>
        <para>Lorsque vous d&eacute;marrez une application, une fen&ecirc;tre d'application s'ouvre. Le gestionnaire de fen&ecirc;tres lui applique un cadre. Par d&eacute;faut, le bord sup&eacute;rieur de la fen&ecirc;tre d'application contient une barre de titre. Celle-ci contient des boutons que vous pouvez employer pour travailler dans la fen&ecirc;tre. Les boutons du cadre d'une fen&ecirc;tre d'application permettent d'ex&eacute;cuter des actions telles qu'ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu> ou fermer la fen&ecirc;tre. Ce menu propose plusieurs actions applicables &agrave; la fen&ecirc;tre. </para>
      </listitem>
      <listitem>
        <para>Fen&ecirc;tres de dialogue</para>
        <para>Une fen&ecirc;tre de dialogue permet d'entrer des informations ou des commandes. La bo&icirc;te de dialogue s'inscrit dans un cadre de fen&ecirc;tre. </para>
        <para>Le bord sup&eacute;rieur de celui-ci permet de travailler dans la fen&ecirc;tre. Par exemple, vous pouvez avoir recours &agrave; la barre de titre pour d&eacute;placer la bo&icirc;te de dialogue. Le cadre contient &eacute;galement des boutons vous permettant :</para>
        <itemizedlist>
          <listitem>
            <para>d'ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu> ; </para>
          </listitem>
          <listitem>
            <para>de fermer la fen&ecirc;tre de dialogue.</para>
          </listitem>
        </itemizedlist>
        <para>G&eacute;n&eacute;ralement, les fen&ecirc;tres de dialogue sont appel&eacute;es depuis une fen&ecirc;tre d'application. Lorsque vous ouvrez une fen&ecirc;tre de dialogue, celle-ci est g&eacute;n&eacute;ralement activ&eacute;e et situ&eacute;e &agrave; l'avant-plan. Certaines d'entre elles vous emp&ecirc;chent d'utiliser l'application jusqu'&agrave; ce que vous les fermiez. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosmetacity-16">
      <title>Cadres de fen&ecirc;tres</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>cadres</secondary>
      </indexterm>
      <para>Le cadre d&eacute;signe la bordure qui entoure la fen&ecirc;tre. Il contient une barre de titre. Celle-ci contient des boutons vous permettant d'utiliser la fen&ecirc;tre.</para>
      <sect3 id="gosmetacity-10">
        <title>Th&egrave;mes</title>
        <indexterm>
          <primary>fen&ecirc;tres</primary>
          <secondary>th&egrave;mes</secondary>
        </indexterm>
        <para>Vous pouvez appliquer plusieurs th&egrave;mes &agrave; vos cadres de fen&ecirc;tres. Les th&egrave;mes permettent de d&eacute;terminer leur apparence. Pour choisir un th&egrave;me pour tous vos cadres de fen&ecirc;tres,  s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guimenuitem>Th&egrave;me</guimenuitem></menuchoice>. </para>
        <para>Le th&egrave;me par d&eacute;faut est Crux. Le pr&eacute;sent manuel d&eacute;crit les fonctions associ&eacute;es au th&egrave;me Crux. </para>
      </sect3>
      <sect3 id="gosmetacity-17">
        <title>&Eacute;l&eacute;ments de contr&ocirc;le</title>
        <indexterm>
          <primary>fen&ecirc;tres</primary>
          <secondary>&eacute;l&eacute;ments de contr&ocirc;le du cadre</secondary>
        </indexterm>
        <para>Les cadres permettent d'ex&eacute;cuter diverses actions sur les fen&ecirc;tres. La barre de titre, en particulier, contient diff&eacute;rents boutons. La figure suivante illustre la barre de titre d'une fen&ecirc;tre d'application.</para>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/titlebar_anno_window.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Barre de titre de la fenêtre. Légende : bouton du menu Fenêtre, barre de titre, boutons Réduire, Agrandir et Fermer la fenêtre.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
        <para>Les fen&ecirc;tres de dialogue contiennent &eacute;galement certains &eacute;l&eacute;ments de contr&ocirc;le associ&eacute;s au cadre. <xref linkend="gosmetacity-TBL-1"/> d&eacute;crit les &eacute;l&eacute;ments de contr&ocirc;le actifs des cadres, de gauche &agrave; droite.</para>
        <table frame="topbot" id="gosmetacity-TBL-1">
          <title>&Eacute;l&eacute;ments de contr&ocirc;le des cadres de fen&ecirc;tres</title>
          <tgroup cols="2" colsep="0" rowsep="0">
            <colspec colname="colspec0" colwidth="41.65*"/>
            <colspec colname="colspec1" colwidth="58.35*"/>
            <thead>
              <row rowsep="1">
                <entry valign="top">
                  <para>&Eacute;l&eacute;ment de contr&ocirc;le</para>
                </entry>
                <entry valign="top">
                  <para>Description </para>
                </entry>
              </row>
            </thead>
            <tbody>
              <row>
                <entry colname="colspec0" valign="top">
                  <para>Bouton <guibutton>Menu Fen&ecirc;tre</guibutton></para>
                </entry>
                <entry colname="colspec1" valign="top">
                  <para>Ce bouton permet d'ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>. </para>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Barre de titre</para>
                </entry>
                <entry valign="top">
                  <para>La barre de titre permet d'ex&eacute;cuter les actions suivantes : </para>
                  <itemizedlist>
                    <listitem>
                      <para>Pour activer la fen&ecirc;tre, cliquez sur la barre de titre.</para>
                    </listitem>
                    <listitem>
                      <para>Pour d&eacute;placer la fen&ecirc;tre, capturez la barre de titre et faites glisser la fen&ecirc;tre vers son nouvel emplacement. </para>
                    </listitem>
                    <listitem>
                      <para>Pour r&eacute;duire la fen&ecirc;tre &agrave; sa barre de titre, cliquez deux fois sur celle-ci. Pour annuler cette op&eacute;ration, cliquez &agrave; nouveau deux fois sur la barre de titre.</para>
                    </listitem>
                  </itemizedlist>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Bouton <guibutton>R&eacute;duire</guibutton></para>
                </entry>
                <entry valign="top">
                  <para>Ce bouton permet de r&eacute;duire la fen&ecirc;tre. </para>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Bouton <guibutton>Agrandir</guibutton></para>
                </entry>
                <entry valign="top">
                  <para>Ce bouton permet d'agrandir la fen&ecirc;tre. </para>
                </entry>
              </row>
              <row>
                <entry colname="colspec0">
                  <para>Bouton <guibutton>Fermer la fen&ecirc;tre</guibutton></para>
                </entry>
                <entry colname="colspec1">
                  <para>Cliquez sur le bouton <guibutton>Fermer la fen&ecirc;tre</guibutton> pour fermer la fen&ecirc;tre. </para>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Bordure</para>
                </entry>
                <entry valign="top">
                  <para>Bordure entourant la fen&ecirc;tre. La bordure permet d'ex&eacute;cuter les actions suivantes : </para>
                  <itemizedlist>
                    <listitem>
                      <para>Pour redimensionner la fen&ecirc;tre, capturez la bordure et faites-la glisser jusqu'&agrave; ce qu'elle atteigne la taille requise. </para>
                    </listitem>
                    <listitem>
                      <para>Pour ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>, cliquez avec le bouton droit sur la bordure.</para>
                    </listitem>
                  </itemizedlist>
                </entry>
              </row>
              <row>
                <entry colname="colspec0" valign="top">
                  <para>Contenu des fen&ecirc;tres</para>
                </entry>
                <entry colname="colspec1">
                  <para>Zone situ&eacute;e &agrave; l'int&eacute;rieur du cadre de la fen&ecirc;tre Le contenu de la fen&ecirc;tre permet d'ex&eacute;cuter les actions suivantes :</para>
                  <itemizedlist>
                    <listitem>
                      <para>Pour d&eacute;placer une fen&ecirc;tre, maintenez la touche <keycap>Alt</keycap> enfonc&eacute;e, cliquez sur le contenu de la fen&ecirc;tre, puis faites glisser celle-ci vers son nouvel emplacement.</para>
                    </listitem>
                    <listitem>
                      <para>Pour redimensionner une fen&ecirc;tre, maintenez la touche <keycap>Alt</keycap> enfonc&eacute;e, puis cliquez avec le bouton du milieu &agrave; proximit&eacute; de l'angle requis. Pour redimensionner la fen&ecirc;tre, faites-la glisser depuis l'angle sur lequel vous avez cliqu&eacute;.</para>
                    </listitem>
                    <listitem>
                      <para>Pour ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>, maintenez la touche <keycap> Alt</keycap> enfonc&eacute;e, puis cliquez avec le bouton droit sur le contenu de la fen&ecirc;tre.</para>
                    </listitem>
                  </itemizedlist>
                </entry>
              </row>
            </tbody>
          </tgroup>
        </table>
      </sect3>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-714">
    <title>Menus et applets utilisables avec les fen&ecirc;tres et les espaces de travail</title>
    <indexterm>
      <primary>fen&ecirc;tres</primary>
      <secondary>applets et menus utilisables avec</secondary>
    </indexterm>
    <para>La pr&eacute;sente section d&eacute;crit les menus et applets utilisables en synergie avec les fen&ecirc;tres et les espaces de travail.</para>
    <sect2 id="gosmetacity-24">
      <title>Menu de la fen&ecirc;tre</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/window_menu.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Menu Fenêtre. Éléments de menu : Réduire, Agrandir, Réduire à la barre de titre, Déplacer, Redimensionner, Fermer, Placer sur tous les espaces de travail, Déplacer vers workspace_name.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>Menu Fen&ecirc;tre</secondary>
      </indexterm>
      <indexterm>
        <primary>menus</primary>
        <secondary>Menu Fen&ecirc;tre</secondary>
      </indexterm>
      <para>Le <guimenu>menu Fen&ecirc;tre</guimenu> contient des commandes vous permettant d'ex&eacute;cuter des actions sur vos fen&ecirc;tres. Pour ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>, proc&eacute;dez comme suit :</para>
      <itemizedlist>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>Menu Fen&ecirc;tre</guibutton> situ&eacute; sur la fen&ecirc;tre requise.</para>
        </listitem>
        <listitem>
          <para>Appuyez sur <keycombo><keycap>Alt</keycap><keycap>barre d'espace</keycap></keycombo>.</para>
        </listitem>
        <listitem>
          <para>Maintenez la touche <keycap>Alt</keycap> enfonc&eacute;e, puis cliquez avec le bouton droit sur une partie quelconque de la fen&ecirc;tre requise. </para>
        </listitem>
      </itemizedlist>
      <para><xref linkend="gosmetacity-TBL-25"/> d&eacute;crit les commandes et sous-menus du <guimenu>menu Fen&ecirc;tre</guimenu>.</para>
      <table frame="topbot" id="gosmetacity-TBL-25">
        <title>Commandes et sous-menus du menu Fen&ecirc;tre</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec2" colwidth="32.34*"/>
          <colspec colname="colspec3" colwidth="67.66*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Option de menu</para>
              </entry>
              <entry valign="top">
                <para>Fonction </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guimenuitem>R&eacute;duire</guimenuitem>
                </para>
              </entry>
              <entry valign="top">
                <para>R&eacute;duit la fen&ecirc;tre.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para><guimenuitem>Agrandir</guimenuitem> ou <guimenuitem> Annuler l'agrandissement</guimenuitem></para>
              </entry>
              <entry valign="top">
                <para>Agrandit la fen&ecirc;tre. Si la fen&ecirc;tre a d&eacute;j&agrave; &eacute;t&eacute; agrandie, s&eacute;lectionnez <guimenuitem>Annuler l'agrandissement</guimenuitem> pour restaurer la taille initiale de la fen&ecirc;tre. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para><guimenuitem>R&eacute;duire &agrave; la barre de titre</guimenuitem> ou <guimenuitem>Restaurer la fen&ecirc;tre &agrave; sa taille normale</guimenuitem></para>
              </entry>
              <entry valign="top">
                <para>R&eacute;duit la fen&ecirc;tre &agrave; sa barre de titre. Si cette option a d&eacute;j&agrave; &eacute;t&eacute; s&eacute;lectionn&eacute;e, choisissez <guimenuitem>Restaurer la fen&ecirc;tre &agrave; sa taille normale</guimenuitem> pour restaurer la taille initiale de la fen&ecirc;tre. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>
                  <guimenuitem>D&eacute;placer</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>permet d'utiliser les touches fl&egrave;ches pour d&eacute;placer la fen&ecirc;tre.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>
                  <guimenuitem>Redimensionner</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>permet d'utiliser les touches fl&egrave;ches pour redimensionner la fen&ecirc;tre.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>
                  <guimenuitem>Fermer</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Ferme la fen&ecirc;tre.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para><guimenuitem>Placer sur tous les espaces de travail</guimenuitem> ou <guimenuitem>Uniquement sur cet espace de travail</guimenuitem></para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Place la fen&ecirc;tre sur tous vos espaces de travail. Si c'est d&eacute;j&agrave; le cas, s&eacute;lectionnez <guimenuitem>Uniquement sur cet espace de travail</guimenuitem> pour ne placer la fen&ecirc;tre que sur l'espace de travail courant. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para><guimenuitem>D&eacute;placer vers <replaceable>workspace_name</replaceable></guimenuitem> ou <guimenuitem>Uniquement sur <replaceable>workspace_name</replaceable></guimenuitem></para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>D&eacute;place la fen&ecirc;tre vers l'espace de travail choisi. Si la fen&ecirc;tre figure sur tous les espaces de travail, s&eacute;lectionnez <guimenuitem>Uniquement sur <replaceable>workspace_name</replaceable></guimenuitem>pour placer la fen&ecirc;tre sur l'espace de travail requis. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="gosmetacity-18">
      <title>Applet Liste de fen&ecirc;tres</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>Applet Liste de fen&ecirc;tres</secondary>
        <see>Applet Liste de fen&ecirc;tres</see>
      </indexterm>
      <indexterm>
        <primary>Applet Liste de fen&ecirc;tres </primary>
        <secondary>introduction</secondary>
      </indexterm>
      <indexterm>
        <primary>listes de fen&ecirc;tres</primary>
        <secondary>applet Listes de fen&ecirc;tres</secondary>
      </indexterm>
      <indexterm>
        <primary>applets</primary>
        <secondary>Liste de fen&ecirc;tres</secondary>
      </indexterm>
      <para>La <application>Liste de fen&ecirc;tres</application> contient un bouton pour chaque fen&ecirc;tre d'application ouverte. Vous pouvez utiliser la <application>Liste de fen&ecirc;tres</application> pour ex&eacute;cuter les t&acirc;ches suivantes :</para>
      <itemizedlist>
        <listitem>
          <para>R&eacute;duire une fen&ecirc;tre</para>
          <para>Cliquez sur le bouton repr&eacute;sentant la fen&ecirc;tre.</para>
        </listitem>
        <listitem>
          <para>Restaurer une fen&ecirc;tre r&eacute;duite.</para>
          <para>Cliquez sur le bouton repr&eacute;sentant la fen&ecirc;tre.</para>
        </listitem>
        <listitem>
          <para>Activer une fen&ecirc;tre</para>
          <para>Cliquez sur le bouton repr&eacute;sentant la fen&ecirc;tre.</para>
        </listitem>
      </itemizedlist>
      <para>Lorsque vous ouvrez une fen&ecirc;tre d'application, la <application>Liste de fen&ecirc;tres</application> affiche un bouton la repr&eacute;sentant. Les boutons de la liste de fen&ecirc;tres indiquent les fen&ecirc;tres ouvertes. Vous pouvez les voir toutes m&ecirc;me si certaines d'entre elles sont r&eacute;duites ou se chevauchent. La <application>Liste de fen&ecirc;tres</application> permet d'afficher les boutons des fen&ecirc;tres de votre espace de travail courant ou de tous les espaces de travail. Pour s&eacute;lectionner cette option, vous devez modifier les pr&eacute;f&eacute;rences de la <application>Liste de fen&ecirc;tres</application>.</para>
      <para>Vous pouvez &eacute;galement cliquer avec le bouton droit sur un bouton de la liste pour ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu> associ&eacute; &agrave; la fen&ecirc;tre correspondante. Lorsque vous ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu> depuis la <application>Liste de fen&ecirc;tres</application>, celui-ci ne contient pas les commandes de l'espace de travail. Pour plus d'informations sur les commandes du <guimenu>menu Fen&ecirc;tre</guimenu>, consultez <xref linkend="gosmetacity-24"/>.</para>
      <para><xref linkend="gosmetacity-FIG-8"/> affiche la <application>Liste de fen&ecirc;tres</application> lorsque les fen&ecirc;tres suivantes sont ouvertes :</para>
      <itemizedlist>
        <listitem>
          <para><application>gedit</application> ;</para>
        </listitem>
        <listitem>
          <para><application>Dictionnaire</application> ;</para>
        </listitem>
        <listitem>
          <para><application>GHex</application> ;</para>
        </listitem>
        <listitem>
          <para><application>Terminal GNOME</application>.</para>
        </listitem>
      </itemizedlist>
      <figure id="gosmetacity-FIG-8">
        <title>Applet Liste de fen&ecirc;tres</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/window_list_applet.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Applet Liste de fenêtres. Le contexte décrit le graphique.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Les boutons de l'applet indiquent l'&eacute;tat des fen&ecirc;tres. <xref linkend="gosmetacity-TBL-3"/> explique les informations fournies par les boutons de la liste sur les fen&ecirc;tres. Les exemples de <xref linkend="gosmetacity-TBL-3"/> se r&eacute;f&egrave;rent &agrave; <xref linkend="gosmetacity-FIG-8"/>. </para>
      <indexterm>
        <primary>applet Liste de fen&ecirc;tres</primary>
        <secondary>informations relatives &agrave; l'&eacute;tat des fen&ecirc;tres</secondary>
      </indexterm>
      <table frame="topbot" id="gosmetacity-TBL-3">
        <title>Informations relatives &agrave; l'&eacute;tat des fen&ecirc;tres sur les boutons de la liste de fen&ecirc;tres</title>
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="33*"/>
          <colspec colname="colspec1" colwidth="33*"/>
          <colspec colname="colspec2" colwidth="33*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>&Eacute;tat</para>
              </entry>
              <entry valign="top">
                <para>Indique</para>
              </entry>
              <entry valign="top">
                <para>Exemple</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Bouton enfonc&eacute;.</para>
              </entry>
              <entry valign="top">
                <para>La fen&ecirc;tre est active.</para>
              </entry>
              <entry valign="top">
                <para>
                  <guilabel> gedit</guilabel>
                </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Titre de la fen&ecirc;tre entre crochets.</para>
              </entry>
              <entry valign="top">
                <para>La fen&ecirc;tre est minimis&eacute;e.</para>
              </entry>
              <entry valign="top">
                <para>
                  <guilabel> [Dictionnaire]</guilabel>
                </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Bouton enfonc&eacute;, aucun crochet autour du titre.</para>
              </entry>
              <entry valign="top">
                <para>La fen&ecirc;tre s'affiche et n'est pas r&eacute;duite.</para>
              </entry>
              <entry valign="top">
                <para>
                  <guilabel>ghex </guilabel>
                </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Chiffre entre parenth&egrave;ses sur un bouton. </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Le bouton repr&eacute;sente un groupe de boutons. </para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>
                  <guilabel> Gnome-terminal (3)</guilabel>
                </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
      <sect3 id="gosmetacity-708">
        <title>Regroupement de boutons</title>
        <indexterm>
          <primary>applet Liste de fen&ecirc;tres</primary>
          <secondary>regroupement de boutons </secondary>
        </indexterm>
        <para>La <application>Liste de fen&ecirc;tres</application> peut regrouper les boutons repr&eacute;sentant des fen&ecirc;tres de la m&ecirc;me classe sous un seul bouton. Le bouton <guibutton>Gnome-terminal</guibutton> de <xref linkend="gosmetacity-FIG-8"/> en constitue un exemple. La figure suivante illustre un exemple de <application>Liste de fen&ecirc;tres</application> avec un groupe de boutons ouvert :</para>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/window_list_group_applet.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Applet Liste de fenêtres avec un groupe de boutons ouvert.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
        <para>Pour ouvrir la liste des fen&ecirc;tres d'un groupe, cliquez sur le bouton correspondant. Vous pouvez cliquer sur les &eacute;l&eacute;ments de la liste pour les activer, les r&eacute;duire et les restaurer.</para>
        <para>Pour ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu> de l'une des fen&ecirc;tres du groupe, cliquez avec le bouton droit sur le bouton correspondant. Une liste des fen&ecirc;tres du groupe s'affiche. Pour ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu> de l'une d'entre elles, cliquez sur celle-ci dans la liste. Lorsque vous ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu> depuis la <application>Liste de fen&ecirc;tres</application>, celui-ci ne contient pas les commandes de l'espace de travail. Pour plus d'informations sur les commandes du <guimenu>menu Fen&ecirc;tre</guimenu>, consultez <xref linkend="gosmetacity-24"/>.</para>
      </sect3>
    </sect2>
    <sect2 id="gosmetacity-20">
      <title>Applet Changeur de bureau</title>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>applet Changeur de bureau </secondary>
      </indexterm>
      <indexterm>
        <primary>applets</primary>
        <secondary>Changeur de bureau</secondary>
      </indexterm>
      <para>Le <application>Changeur de bureau</application> pr&eacute;sente une repr&eacute;sentation visuelle des espaces de travail, tel qu'illustr&eacute; dans <xref linkend="gosmetacity-FIG-722"/>. <xref linkend="gosmetacity-FIG-722"/> montre l'applet lorsque la session GNOME contient quatre espaces de travail. Vos espaces de travail apparaissent sous la forme de boutons sur l'applet. L'arri&egrave;re-plan du bouton de l'applet qui repr&eacute;sente l'espace de travail actuel est mis en surbrillance. L'espace de travail courant dans <xref linkend="gosmetacity-FIG-722"/> se situe &agrave; gauche de l'applet. Pour passer &agrave; un autre espace de travail, cliquez sur celui-ci.</para>
      <figure id="gosmetacity-FIG-722">
        <title>Applet Changeur de bureau</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/workspace_switcher_applet.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Applet Changeur de bureau. Le contexte décrit le graphique.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Le <application>Changeur de bureau</application> affiche &eacute;galement les fen&ecirc;tres d'application et les bo&icirc;tes de dialogues ouvertes dans vos espaces de travail.</para>
      <para>Cette applet contient des lignes qui affichent les espaces de travail de gauche &agrave; droite. Dans <xref linkend="gosmetacity-FIG-722"/>, elle est configur&eacute;e pour afficher les espaces de travail sur une seule ligne. Vous pouvez sp&eacute;cifier le nombre de lignes requis pour afficher vos espaces de travail dans le <application>Changeur de bureau</application>. Vous pouvez &eacute;galement modifier le comportement par d&eacute;faut de l'applet pour que celle-ci affiche les noms de vos espaces de travail.</para>
    </sect2>
    <sect2 id="gosmetacity-27">
      <title>Utilisation du panneau de menus avec les fen&ecirc;tres</title>
      <indexterm>
        <primary>Panneau de menus</primary>
        <secondary>ic&ocirc;ne Liste de fen&ecirc;tres</secondary>
      </indexterm>
      <indexterm>
        <primary>listes de fen&ecirc;tres</primary>
        <secondary>Panneau de menus</secondary>
      </indexterm>
      <para>Le panneau de menus permet d'afficher une liste de toutes les fen&ecirc;tres actuellement ouvertes. Vous pouvez choisir d'en activer une. Pour consulter la liste de fen&ecirc;tres, cliquez sur l'ic&ocirc;ne situ&eacute;e &agrave; l'extr&ecirc;me droite du panneau de menus. La figure suivante montre un exemple de la liste de fen&ecirc;tres affich&eacute;e depuis le panneau de menus :</para>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/openwindows_menu.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Liste de fenêtres affichée depuis le panneau de menus.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <para>Lorsqu'un autre &eacute;l&eacute;ment est activ&eacute;, l'ic&ocirc;ne sur laquelle il faut cliquer pour afficher la liste change. Elle repr&eacute;sente la fen&ecirc;tre active. Pour activer une fen&ecirc;tre, choisissez-la dans la liste.</para>
      <para>La liste comprend les fen&ecirc;tres de tous les espaces de travail. Les fen&ecirc;tres des espaces de travail inactifs figurent sous une ligne de s&eacute;paration.</para>
      <para>Il est impossible de d&eacute;placer l'ic&ocirc;ne situ&eacute;e &agrave; l'extr&ecirc;me droite du panneau de menus.</para>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-715">
    <title>Manipulation des fen&ecirc;tres</title>
    <indexterm>
      <primary>fen&ecirc;tres</primary>
      <secondary>manipulation</secondary>
    </indexterm>
    <para>La pr&eacute;sente section d&eacute;crit la manipulation des fen&ecirc;tres.</para>
    <sect2 id="gosmetacity-28">
      <title>Activation d'une fen&ecirc;tre</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>activation</secondary>
      </indexterm>
      <indexterm>
        <primary>activation, fen&ecirc;tre</primary>
      </indexterm>
      <para>Il est possible de proc&eacute;der &agrave; des entr&eacute;es &agrave; l'aide de la souris ou du clavier dans une fen&ecirc;tre activ&eacute;e. Vous ne pouvez activer qu'une seule fen&ecirc;tre &agrave; la fois. L'apparence de celle-ci diff&egrave;re de celle des autres. </para>
      <para>Les &eacute;l&eacute;ments suivants permettent d'activer une fen&ecirc;tre.</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="33.62*"/>
          <colspec colname="colspec1" colwidth="66.38*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>&Eacute;l&eacute;ment</para>
              </entry>
              <entry valign="top">
                <para> Action</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Souris</para>
              </entry>
              <entry valign="top">
                <para>Cliquer sur la fen&ecirc;tre si celle-ci est visible. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Touches de raccourci</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Les touches de raccourci permettent de passer d'une fen&ecirc;tre ouverte &agrave; l'autre. Pour activer une fen&ecirc;tre, rel&acirc;chez les touches. Les touches de raccourci par d&eacute;faut permettant de passer d'une fen&ecirc;tre &agrave; l'autre sont <keycombo><keycap>Alt</keycap><keycap> Tab</keycap></keycombo>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Liste de fen&ecirc;tres</application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Cliquez sur le bouton qui repr&eacute;sente la fen&ecirc;tre dans la <application>Liste de fen&ecirc;tres</application>.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Changeur de bureau</application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Cliquez sur la fen&ecirc;tre &agrave; activer dans l'&eacute;cran <application>Changeur de bureau</application>. Si vous cliquez sur une fen&ecirc;tre situ&eacute;e dans un autre espace de travail, le <application>Changeur de bureau</application> active celui-ci ainsi que la fen&ecirc;tre. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>le panneau de menus ;</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Cliquez sur l'ic&ocirc;ne situ&eacute;e &agrave; l'extr&ecirc;me droite du panneau de menus. Une liste des fen&ecirc;tres ouvertes s'affiche. S&eacute;lectionnez la fen&ecirc;tre requise parmi celles-ci.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gosmetacity-29">
      <title>R&eacute;duction d'une fen&ecirc;tre</title>
      <indexterm>
        <primary>fen&ecirc;tre</primary>
        <secondary>r&eacute;duction</secondary>
      </indexterm>
      <indexterm>
        <primary>r&eacute;duction</primary>
        <secondary>fen&ecirc;tres</secondary>
      </indexterm>
      <para>Pour r&eacute;duire une fen&ecirc;tre, proc&eacute;dez comme suit : </para>
      <itemizedlist>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>R&eacute;duire</guibutton> du cadre de la fen&ecirc;tre.</para>
        </listitem>
        <listitem>
          <para>Ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu>, puis s&eacute;lectionnez <guimenuitem>R&eacute;duire</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>Si la fen&ecirc;tre est active, cliquez sur le bouton qui la repr&eacute;sente dans la <application>Liste de fen&ecirc;tres</application>. Dans le cas contraire, cliquez deux fois sur le bouton correspondant. </para>
        </listitem>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton correspondant de la <application>Liste de fen&ecirc;tres</application>, puis s&eacute;lectionnez <guimenuitem>R&eacute;duire</guimenuitem> dans le menu contextuel.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-30">
      <title>Agrandissement d'une fen&ecirc;tre</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>agrandissement</secondary>
      </indexterm>
      <indexterm>
        <primary>agrandissement des fen&ecirc;tres</primary>
      </indexterm>
      <para>Lorsque vous agrandissez une fen&ecirc;tre, celle-ci se d&eacute;veloppe autant que possible. Pour ce faire, proc&eacute;dez comme suit : </para>
      <itemizedlist>
        <listitem>
          <para>Pour agrandir la fen&ecirc;tre, cliquez sur le bouton <guibutton>Agrandir</guibutton> du cadre de la fen&ecirc;tre. Vous pouvez &eacute;galement ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>, puis s&eacute;lectionnez <guimenuitem>Agrandir</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton correspondant &agrave; la fen&ecirc;tre dans la <application>Liste de fen&ecirc;tres</application>, puis s&eacute;lectionnez <guimenuitem>Agrandir</guimenuitem> dans le <guimenu>menu Fen&ecirc;tre</guimenu>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-31">
      <title>Restauration d'une fen&ecirc;tre</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>restauration</secondary>
      </indexterm>
      <indexterm>
        <primary>restauration</primary>
        <secondary>fen&ecirc;tres</secondary>
      </indexterm>
      <para>Pour restaurer une fen&ecirc;tre agrandie, proc&eacute;dez comme suit : </para>
      <itemizedlist>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>Agrandir</guibutton> situ&eacute; sur le cadre de la fen&ecirc;tre.</para>
        </listitem>
        <listitem>
          <para>Ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu>. S&eacute;lectionnez <guimenuitem>Annuler l'agrandissement</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton correspondant &agrave; la fen&ecirc;tre dans la <application>Liste de fen&ecirc;tres</application> pour ouvrir le <guimenu>menu Fen&ecirc;tres</guimenu>. S&eacute;lectionnez <guimenuitem>Annuler l'agrandissement</guimenuitem>.</para>
        </listitem>
      </itemizedlist>
      <para>Pour restaurer une fen&ecirc;tre r&eacute;duite, cliquez sur le bouton repr&eacute;sentant la fen&ecirc;tre dans la <application>Liste de fen&ecirc;tres</application>.</para>
    </sect2>
    <sect2 id="gosmetacity-32">
      <title>Fermeture d'une fen&ecirc;tre</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>fermeture</secondary>
      </indexterm>
      <indexterm>
        <primary>fermeture des fen&ecirc;tres</primary>
      </indexterm>
      <para>Pour fermer une fen&ecirc;tre, proc&eacute;dez comme suit : </para>
      <itemizedlist>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>Fermer la fen&ecirc;tre</guibutton> du cadre de la fen&ecirc;tre.</para>
        </listitem>
        <listitem>
          <para>Ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu>. S&eacute;lectionnez <guimenuitem>Fermer</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton repr&eacute;sentant la fen&ecirc;tre dans la <application>Liste de fen&ecirc;tres</application>, puis s&eacute;lectionnez <guimenuitem>Fermer</guimenuitem>dans le  <guimenu>menu Fen&ecirc;tre</guimenu>.</para>
        </listitem>
      </itemizedlist>
      <para>SI vous n'avez pas enregistr&eacute; les donn&eacute;es de la fen&ecirc;tre, vous &ecirc;tes invit&eacute; &agrave; le faire.</para>
    </sect2>
    <sect2 id="gosmetacity-34">
      <title>Redimensionnement d'une fen&ecirc;tre</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>redimensionnement</secondary>
      </indexterm>
      <indexterm>
        <primary>redimensionnement des fen&ecirc;tres</primary>
      </indexterm>
      <para>Pour redimensionner une fen&ecirc;tre, proc&eacute;dez comme suit :</para>
      <itemizedlist>
        <listitem>
          <para>Pointez sur un angle de la fen&ecirc;tre. Le pointeur de la souris change pour indiquer que vous pouvez redimensionner la fen&ecirc;tre. Capturez l'angle et faites glisser la fen&ecirc;tre jusqu'&agrave; ce qu'elle atteigne la taille requise.</para>
        </listitem>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton correspondant &agrave; la fen&ecirc;tre dans la <application>Liste de fen&ecirc;tres</application>. S&eacute;lectionnez <guimenuitem>Redimensionner</guimenuitem> dans le <guimenu>menu Fen&ecirc;tre</guimenu>. Les touches fl&egrave;ches permettent de redimensionner la fen&ecirc;tre.</para>
        </listitem>
        <listitem>
          <para>Maintenez la touche <keycap>Alt</keycap> enfonc&eacute;e, puis cliquez avec le bouton du milieu &agrave; proximit&eacute; de l'angle &agrave; redimensionner. Le pointeur de la souris change pour indiquer que vous pouvez redimensionner la fen&ecirc;tre depuis cet angle. Pour redimensionner la fen&ecirc;tre, faites-la glisser depuis l'angle sur lequel vous avez cliqu&eacute;.</para>
        </listitem>
        <listitem>
          <para>Pour redimensionner une fen&ecirc;tre horizontalement, pointez sur l'un des bords verticaux de la fen&ecirc;tre. Le pointeur de la souris change pour indiquer que vous pouvez redimensionner la fen&ecirc;tre. Capturez le bord et faites glisser la fen&ecirc;tre jusqu'&agrave; ce qu'elle atteigne la taille requise.</para>
        </listitem>
        <listitem>
          <para>Pour redimensionner une fen&ecirc;tre verticalement, pointez sur le bord inf&eacute;rieur de la fen&ecirc;tre. Le pointeur de la souris change pour indiquer que vous pouvez redimensionner la fen&ecirc;tre. Capturez le bord et faites glisser la fen&ecirc;tre jusqu'&agrave; ce qu'elle atteigne la taille requise.</para>
        </listitem>
      </itemizedlist>
      <note>
        <para>Il est impossible de redimensionner certaines bo&icirc;tes de dialogue. De la m&ecirc;me mani&egrave;re, certaines fen&ecirc;tres d'application ne peuvent pas ne peuvent pas &ecirc;tre redimensionn&eacute;es en de&ccedil;&agrave; d'une certaine taille.</para>
      </note>
    </sect2>
    <sect2 id="gosmetacity-35">
      <title>D&eacute;placement d'une fen&ecirc;tre</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>d&eacute;placement</secondary>
      </indexterm>
      <indexterm>
        <primary>d&eacute;placement de fen&ecirc;tres</primary>
      </indexterm>
      <para>Pour d&eacute;placer une fen&ecirc;tre, proc&eacute;dez comme suit : </para>
      <itemizedlist>
        <listitem>
          <para>Capturez la barre de titre de la fen&ecirc;tre et faites glisser celle-ci jusqu'&agrave; son nouvel emplacement. </para>
        </listitem>
        <listitem>
          <para>Maintenez la touche <keycap>Alt</keycap> enfonc&eacute;e, puis faites glisser la fen&ecirc;tre vers son nouvel emplacement. </para>
        </listitem>
        <listitem>
          <para>Ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu>, puis s&eacute;lectionnez <guimenuitem>D&eacute;placer</guimenuitem>. Les touches fl&egrave;ches permettent de d&eacute;placer la fen&ecirc;tre vers son nouvel emplacement. </para>
        </listitem>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton repr&eacute;sentant la fen&ecirc;tre dans la <application> Liste des fen&ecirc;tres</application>, puis s&eacute;lectionnez <guimenuitem>D&eacute;placer</guimenuitem> dans le <guimenu>menu Fen&ecirc;tre</guimenu>. Les touches fl&egrave;ches permettent de d&eacute;placer la fen&ecirc;tre vers son nouvel emplacement. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-36">
      <title>R&eacute;duction d'une fen&ecirc;tre &agrave; sa barre de titre</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>r&eacute;duction &agrave; la barre de titre</secondary>
      </indexterm>
      <indexterm>
        <primary>r&eacute;duction des fen&ecirc;tres &agrave; la barre de titre</primary>
      </indexterm>
      <para>Vous pouvez r&eacute;duire les fen&ecirc;tres &agrave; la barre de titre et restaurer leur taille normale en proc&eacute;dant comme suit :</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="24.94*"/>
          <colspec colwidth="75.06*"/>
          <tbody>
            <row>
              <entry valign="top">
                <para>R&eacute;duire &agrave; la barre de titre</para>
              </entry>
              <entry valign="top">
                <para>R&eacute;duit la fen&ecirc;tre de telle sorte que seule la barre de titre reste visible.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Restaurer la taille normale</para>
              </entry>
              <entry valign="top">
                <para>Affiche en entier une fen&ecirc;tre r&eacute;duite &agrave; sa barre de titre. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Pour r&eacute;duire une fen&ecirc;tre &agrave; sa barre de titre, proc&eacute;dez comme suit : </para>
      <itemizedlist>
        <listitem>
          <para>Cliquez deux fois sur la barre de titre de la fen&ecirc;tre. Pour annuler cette op&eacute;ration, cliquez &agrave; nouveau deux fois sur la barre de titre.</para>
        </listitem>
        <listitem>
          <para>Ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu>. S&eacute;lectionnez <guimenuitem>R&eacute;duire &agrave; la barre de titre</guimenuitem>. Pour annuler cette op&eacute;ration, s&eacute;lectionnez <guimenuitem>Restaurer la taille normale</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton correspondant &agrave; la fen&ecirc;tre dans la <application> Liste de fen&ecirc;tres</application>, puis s&eacute;lectionnez <guimenuitem>R&eacute;duire &agrave; la barre de titre</guimenuitem> dans le <guimenu>menu Fen&ecirc;tre</guimenu>. Pour restaurer la taille normale d'une fen&ecirc;tre, s&eacute;lectionnez <guimenuitem>Restaurer la fen&ecirc;tre &agrave; sa taille normale</guimenuitem>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-38">
      <title>Placement d'une fen&ecirc;tre sur tous les espaces de travail</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>placement sur tous les espaces de travail</secondary>
      </indexterm>
      <para>Pour placer une fen&ecirc;tre sur tous les espaces de travail, ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu>. S&eacute;lectionnez <guimenuitem>Placer sur tous les espaces de travail</guimenuitem>. Pour qu'une fen&ecirc;tre ne s'affiche que sur l'espace de travail courant, s&eacute;lectionnez <guimenuitem>Seulement sur cet espace de travail</guimenuitem>.</para>
    </sect2>
    <sect2 id="gosmetacity-46">
      <title>D&eacute;placement d'une fen&ecirc;tre vers un autre espace de travail</title>
      <indexterm>
        <primary>fen&ecirc;tres</primary>
        <secondary>d&eacute;placement vers un autre espace de travail </secondary>
      </indexterm>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>d&eacute;placement de fen&ecirc;tres vers </secondary>
      </indexterm>
      <para>Vous pouvez d&eacute;placer une fen&ecirc;tre vers un autre espace de travail en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
      <itemizedlist>
        <listitem>
          <para>A l'aide du <application>Changeur de bureau</application> :</para>
          <para>Dans l'&eacute;cran <application>Changeur de bureau</application>, faites glisser la fen&ecirc;tre vers l'espace de travail requis.</para>
        </listitem>
        <listitem>
          <para>A l'aide du <guimenu>menu Fen&ecirc;tre</guimenu> :</para>
          <para>Ouvrez le <guimenu>menu Fen&ecirc;tre</guimenu>. Pour d&eacute;placer une fen&ecirc;tre vers un autre espace de travail, s&eacute;lectionnez <guimenuitem>D&eacute;placer vers <replaceable>workspace_name</replaceable></guimenuitem>. </para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-716">
    <title>Manipulation des espaces de travail</title>
    <indexterm>
      <primary>espaces de travail</primary>
      <secondary>manipulation</secondary>
    </indexterm>
    <para>La pr&eacute;sente section d&eacute;crit la manipulation des espaces de travail.</para>
    <sect2 id="gosmetacity-49">
      <title>Passage d'un espace de travail &agrave; l'autre</title>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>navigation</secondary>
      </indexterm>
      <para>Vous pouvez passer d'un espace de travail &agrave; l'autre en recourant &agrave; l'une des m&eacute;thodes suivantes : </para>
      <itemizedlist>
        <listitem>
          <para>A l'aide du <application>Changeur de bureau</application> :</para>
          <para>Cliquez sur l'espace de travail auquel vous souhaitez passer dans le <application>Changeur de bureau</application>.</para>
        </listitem>
        <listitem>
          <para>A l'aide des touches de raccourci :</para>
          <para>Les touches de raccourci par d&eacute;faut permettant de passer d'un espace de travail &agrave; l'autre sont les suivantes : </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colwidth="50*"/>
              <colspec colwidth="50*"/>
              <thead>
                <row rowsep="1">
                  <entry>
                    <para>Touches de raccourci par d&eacute;faut</para>
                  </entry>
                  <entry>
                    <para> Fonction</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry>
                    <para><keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>fl&egrave;che droite</keycap></keycombo></para>
                  </entry>
                  <entry>
                    <para>S&eacute;lectionne l'espace de travail situ&eacute; &agrave; droite. </para>
                  </entry>
                </row>
                <row>
                  <entry>
                    <para><keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>fl&egrave;che gauche</keycap></keycombo></para>
                  </entry>
                  <entry>
                    <para>S&eacute;lectionne l'espace de travail situ&eacute; &agrave; gauche. </para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-50">
      <title>Ajout d'espaces de travail</title>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>ajout</secondary>
      </indexterm>
      <para>Pour ajouter des espaces de travail &agrave; votre bureau, cliquez avec le bouton droit sur le <application>Changeur de bureau</application>, puis s&eacute;lectionnez <guimenuitem>Pr&eacute;f&eacute;rences</guimenuitem>. La bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences de l'espace de travail</guilabel> s'affiche. La bo&icirc;te de s&eacute;lection num&eacute;rique <guilabel>Nombre d'espaces de travail</guilabel> permet de sp&eacute;cifier le nombre d'espaces de travail requis. Le <application>Changeur de travail</application> ajoute de nouveaux espaces de travail &agrave; la suite de la liste.</para>
    </sect2>
    <sect2 id="gosmetacity-51">
      <title>Attribution d'un nom aux espaces de travail</title>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>nommer</secondary>
      </indexterm>
      <para>Les noms par d&eacute;faut des espaces de travail sont <literal>Workspace 1</literal>, <literal> Workspace 2</literal>, <literal>Workspace 3</literal>, etc. Pour les renommer, cliquez avec le bouton droit sur le <application>Changeur de bureau</application>, puis s&eacute;lectionnez <guimenuitem>Pr&eacute;f&eacute;rences</guimenuitem>. La bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences de l'espace de travail</guilabel> s'affiche. La zone de liste <guilabel>Espaces de travail</guilabel> permet de sp&eacute;cifier les noms des espaces de travail. S&eacute;lectionnez un espace de travail, puis entrez son nom.</para>
    </sect2>
    <sect2 id="gosmetacity-52">
      <title>Suppression d'espaces de travail</title>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>suppression</secondary>
      </indexterm>
      <para>Lorsque vous supprimez un espace de travail, les fen&ecirc;tres de celui-ci sont d&eacute;plac&eacute;es vers un autre espace de travail et il est supprim&eacute;. </para>
      <para>Pour supprimer des espaces de travail du bureau, cliquez avec le bouton droit sur le <application>Changeur de bureau</application>, puis s&eacute;lectionnez <guimenuitem>Pr&eacute;f&eacute;rences</guimenuitem>. La bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences de l'espace de travail</guilabel> s'affiche. La bo&icirc;te de s&eacute;lection num&eacute;rique <guilabel>Nombre d'espaces de travail</guilabel> permet de sp&eacute;cifier le nombre d'espaces de travail requis. Le <application>Changeur de bureau</application> supprime les espaces de travail du bas de la liste.</para>
    </sect2>
  </sect1>
</chapter>
