<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosoverview-1">
  <title>Pr&eacute;sentation du bureau</title>
  <highlights>
    <para>Le pr&eacute;sent chapitre traite des caract&eacute;ristiques et des principaux composants du bureau GNOME. Nous vous conseillons de lire ce chapitre avant de commencer &agrave; utiliser le bureau, afin de vous familiariser avec les diff&eacute;rentes caract&eacute;ristiques et avec le fonctionnement des principaux composants. La configuration du bureau est tr&egrave;s souple. Par cons&eacute;quent, le pr&eacute;sent chapitre d&eacute;crit les param&egrave;tres par d&eacute;faut standard et aborde les aspects suivants :</para>
  </highlights>
  <sect1 id="gosoverview-5">
    <title>Pr&eacute;sentation des composants du bureau</title>
    <indexterm>
      <primary>composants du bureau, pr&eacute;sentation</primary>
    </indexterm>
    <para>Lorsque vous d&eacute;marrez une session du bureau pour la premi&egrave;re fois, vous devez en principe voir s'afficher un &eacute;cran de d&eacute;marrage par d&eacute;faut, avec des tableaux de bord, des fen&ecirc;tres et diff&eacute;rentes ic&ocirc;nes. <xref linkend="gosoverview-FIG-1"/>pr&eacute;sente un bureau standard. </para>
    <figure id="gosoverview-FIG-1">
      <title>Bureau standard</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/typical_anno_desktop.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Bureau standard. Légende : Menu, Panneau de menus, Arrière-plan du bureau, Fenêtres, applet Liste de fenêtres, Tableau de bord inférieur, applet Changeur de bureau.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <para>Les principaux composants du bureau sont les suivants : <itemizedlist><listitem><para>Les tableaux de bord</para><para>Les tableaux de bord sont des zones du bureau &agrave; partir desquelles il est possible d'acc&eacute;der &agrave; tous les menus et applications du syst&egrave;me. La configuration des tableaux de bord est tr&egrave;s souple. Parmi les &eacute;l&eacute;ments de <xref linkend="gosoverview-FIG-1"/>, le panneau de menus rev&ecirc;t une importance particuli&egrave;re. Il couvre toute la longueur du bord sup&eacute;rieur du bureau. Le panneau de menus comprend les deux menus sp&eacute;ciaux suivants :</para><itemizedlist><listitem><para>Le menu <guimenu>Applications</guimenu> :contient tous les outils de configuration et applications. Ce menu comprend &eacute;galement le gestionnaire de fichiers et le navigateur d'aide.</para></listitem><listitem><para>Le menu <guimenu>Actions</guimenu> :Contient diff&eacute;rentes commandes permettant d'ex&eacute;cuter des fonctions sur le bureau, par exemple <guimenuitem>Rechercher des fichiers </guimenuitem> et <guimenuitem>D&eacute;connecter</guimenuitem>. </para></listitem></itemizedlist><para>L'ic&ocirc;ne situ&eacute;e &agrave; l'extr&ecirc;me droite du panneau de menus permet d'afficher une liste de toutes les fen&ecirc;tres ouvertes.</para></listitem><listitem><para>Menus</para><para>Vous pouvez acc&eacute;der &agrave; toutes les fonctions du bureau par le biais des menus. Le Panneau de menus contient des menus que vous pouvez utiliser conjointement avec des tableaux de bord pour ex&eacute;cuter vos t&acirc;ches. Les menus <guimenu>Applications</guimenu> et <guimenu>Actions </guimenu> permettent d'acc&eacute;der &agrave; presque toutes les applications, commandes et options de configuration standard. </para><para>Vous pouvez aussi acc&eacute;der &agrave; la plupart des applications, commandes et options de configuration standard depuis le <guimenu> menu GNOME</guimenu>. Les &eacute;l&eacute;ments de ces menus sont &eacute;galement accessibles depuis le <guimenu>menu GNOME</guimenu>. Vous pouvez ajouter le <guimenu> menu GNOME</guimenu> en tant que bouton sur vos tableaux de bord.</para></listitem><listitem><para>Fen&ecirc;tres</para><para>Vous pouvez afficher plusieurs fen&ecirc;tres simultan&eacute;ment. Chacune d'entre elles peut accueillir une application diff&eacute;rente. Le gestionnaire de fen&ecirc;tres propose des cadres et des boutons pour celles-ci. Il permet d'effectuer des actions standard, telles que d&eacute;placer, fermer et redimensionner les fen&ecirc;tres. </para></listitem><listitem><para>Espaces de travail</para><para>Vous pouvez subdiviser votre bureau en <firstterm>espaces de travail</firstterm> distincts. Un espace de travail est une zone discr&egrave;te du bureau dans laquelle vous pouvez travailler. Il est possible d'en sp&eacute;cifier le nombre sur le bureau. Vous pouvez vous d&eacute;placer entre les espaces de travail, mais vous ne pouvez en afficher qu'un seul &agrave; la fois.</para></listitem><listitem><para>Gestionnaire de fichiers <application>Nautilus</application></para><para>Le gestionnaire de fichiers <application>Nautilus</application> propose un point d'acc&egrave;s int&eacute;gr&eacute; &agrave; vos fichiers et applications. Vous pouvez afficher le contenu de vos fichiers dans une fen&ecirc;tre <application>Nautilus</application> ou les ouvrir dans l'application appropri&eacute;e depuis <application>Nautilus</application>. Le gestionnaire de fichiers <application>Nautilus</application> permet de g&eacute;rer vos fichiers et dossiers. </para></listitem><listitem><para>Arri&egrave;re-plan du bureau</para><para>L'arri&egrave;re-plan du bureau se trouve derri&egrave;re tous les autres composants du bureau. Il s'agit d'un composant actif de l'interface utilisateur. Vous pouvez placer des objets sur l'arri&egrave;re-plan du bureau pour acc&eacute;der rapidement &agrave; vos fichiers et r&eacute;pertoires ou pour d&eacute;marrer les applications fr&eacute;quemment utilis&eacute;es. Il est &eacute;galement possible de cliquer avec le bouton droit sur l'arri&egrave;re-plan pour ouvrir un menu.</para></listitem><listitem><para>Emplacement <guilabel>D&eacute;marrer ici</guilabel></para><para>L'emplacement <guilabel>D&eacute;marrer ici</guilabel> permet d'acc&eacute;der aux principales caract&eacute;ristiques du bureau GNOME. Vous pouvez ouvrir vos applications et outils de configuration GNOME depuis l'emplacement <guilabel>D&eacute;marrer ici</guilabel>. Il est &eacute;galement possible de lancer des programmes permettant de configurer le syst&egrave;me en tant que serveur et de choisir d'autres param&egrave;tres syst&egrave;me.</para></listitem><listitem><para>Pr&eacute;f&eacute;rences du bureau</para><para>Le bureau GNOME contient des <firstterm>outils de pr&eacute;f&eacute;rence</firstterm> d&eacute;di&eacute;s. Chacun d'entre eux d&eacute;termine une facette donn&eacute;e du comportement du bureau. Pour d&eacute;marrer un outil de pr&eacute;f&eacute;rence, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Pr&eacute;f&eacute;rences du bureau</guimenuitem></menuchoice>. Choisissez l'&eacute;l&eacute;ment &agrave; configurer dans les sous-menus.</para></listitem></itemizedlist></para>
    <para>Les caract&eacute;ristiques les plus performantes du bureau r&eacute;sident dans la souplesse extr&ecirc;me de sa configuration et dans la multiplicit&eacute; des m&eacute;thodes permettant d'ex&eacute;cuter des t&acirc;ches.</para>
    <para>Le bureau garantit l'interop&eacute;rabilit&eacute; de ses composants. G&eacute;n&eacute;ralement, une m&ecirc;me action peut &ecirc;tre effectu&eacute;e de plusieurs mani&egrave;res. Par exemple, vous pouvez d&eacute;marrer les applications depuis les tableaux de bord, les menus ou l'arri&egrave;re-plan du bureau. </para>
    <para>L'administrateur syst&egrave;me peut modifier la configuration afin de mieux r&eacute;pondre &agrave; vos besoins. Par cons&eacute;quent, votre bureau peut l&eacute;g&egrave;rement diverger de celui d&eacute;crit dans le pr&eacute;sent chapitre. Toutefois, ce chapitre constitue un pr&eacute;cieux guide de r&eacute;f&eacute;rence rapide relatif &agrave; l'utilisation du bureau. </para>
  </sect1>
  <sect1 id="gosoverview-502">
    <title>Tableaux de bord</title>
    <indexterm>
      <primary>tableaux de bord</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <para>Vous pouvez ajouter ou supprimer des tableaux de bord &agrave; tout moment. Lorsque vous d&eacute;marrez une session pour la premi&egrave;re fois, le bureau contient g&eacute;n&eacute;ralement au moins les deux tableaux de bord suivants : </para>
    <itemizedlist>
      <listitem>
        <para>le panneau de menus ;</para>
      </listitem>
      <listitem>
        <para>le tableau de bord situ&eacute; en bas du bureau.</para>
      </listitem>
    </itemizedlist>
    <para>Les tableaux de bord permettent d'ex&eacute;cuter les actions suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>cr&eacute;er des tableaux de bord ;</para>
      </listitem>
      <listitem>
        <para>supprimer des tableaux de bord ;</para>
      </listitem>
      <listitem>
        <para>masquer des tableaux de bord ;</para>
      </listitem>
      <listitem>
        <para>ajouter des objets aux tableaux de bord ;</para>
      </listitem>
      <listitem>
        <para>manipuler des objets de tableaux de bord.</para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosoverview-26">
      <title>Cr&eacute;ation de tableaux de bord</title>
      <para>Pour cr&eacute;er un tableau de bord, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur un espace libre dans l'un des tableaux de bord, puis s&eacute;lectionnez <guimenuitem>Nouveau tableau de bord</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez le type de tableau de bord &agrave; cr&eacute;er dans le sous-menu. Le tableau de bord est ajout&eacute; au bureau.</para>
        </listitem>
      </orderedlist>
      <para>Il est possible de cr&eacute;er un nombre illimit&eacute; de tableaux de bord, mais il ne peut exister qu'un seul panneau de menus. Vous pouvez cr&eacute;er diff&eacute;rents types de tableaux de bord pour r&eacute;pondre &agrave; vos besoins. Leur comportement et leur apparence peuvent &ecirc;tre personnalis&eacute;s. Par exemple, vous pouvez modifier l'arri&egrave;re-plan des tableaux de bord.</para>
    </sect2>
    <sect2 id="gosoverview-508">
      <title>Suppression de tableaux de bord</title>
      <para>Pour supprimer un tableau de bord, cliquez avec le bouton droit sur celui-ci, puis choisissez  <guimenuitem>Supprimer ce tableau de bord</guimenuitem>.</para>
    </sect2>
    <sect2 id="gosoverview-24">
      <title>Masquage des tableaux de bord</title>
      <para>&Agrave; l'exception du panneau de menus, tous les tableaux de bord peuvent comporter des boutons de masquage &agrave; chacune de leurs extr&eacute;mit&eacute;s. Ces boutons permettent de masquer ou d'afficher le tableau de bord.</para>
    </sect2>
    <sect2 id="gosoverview-4">
      <title>Ajout d'objet aux tableaux de bord</title>
      <para>Les tableaux de bord peuvent comporter plusieurs types d'objets. L'exemple de <xref linkend="gosoverview-FIG-28"/> contient chaque type d'objet. </para>
      <figure id="gosoverview-FIG-28">
        <title>Tableau de bord avec diff&eacute;rents objets</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/sample_anno_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Tableau de bord avec différents objets. Légende : Lanceur de la calculatrice, Menu, applet Lecteur CD, Tiroir, Verrouiller l'écran.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Vous pouvez ajouter les objets suivants &agrave; tous les types de tableaux de bord :</para>
      <itemizedlist>
        <listitem>
          <para>applets ;</para>
          <indexterm>
            <primary>applets</primary>
            <secondary> pr&eacute;sentation</secondary>
          </indexterm>
          <para>Les <firstterm>applets</firstterm> sont de petites applications interactives r&eacute;sidant dans un tableau de bord, par exemple <application>CD Player</application> dans <xref linkend="gosoverview-FIG-28"/>. Chacune poss&egrave;de une interface utilisateur simple dont vous pouvez vous servir &agrave; l'aide de la souris ou du clavier. Les applets suivantes s'affichent dans vos tableaux de bord par d&eacute;faut.</para>
          <itemizedlist>
            <listitem>
              <para><application>Liste de fen&ecirc;tres</application> :Affiche un bouton pour chaque fen&ecirc;tre ouverte. Vous pouvez cliquer sur l'un des boutons de la liste de fen&ecirc;tres pour r&eacute;duire ou restaurer la fen&ecirc;tre correspondante. Par d&eacute;faut, la <application>Liste de fen&ecirc;tres</application> appara&icirc;t dans le tableau de bord situ&eacute; en bas du bureau.</para>
            </listitem>
            <listitem>
              <para><application>Changeur de bureau</application> :Affiche une repr&eacute;sentation visuelle des tableaux de bord. Le <application>Changeur de bureau</application> permet de passer d'un espace de travail &agrave; l'autre. Par d&eacute;faut, <application>Changement de bureau</application> appara&icirc;t dans le tableau de bord situ&eacute; en bas du bureau.</para>
            </listitem>
          </itemizedlist>
          <para>Pour ajouter une applet &agrave; un tableau de bord, cliquez avec le bouton droit sur un espace disponible de celui-ci, puis s&eacute;lectionnez <guimenuitem>Ajouter au tableau de bord</guimenuitem>. Choisissez l'applet requise dans l'un des sous-menus suivants :</para>
          <itemizedlist>
            <listitem>
              <para>Accessoires ;</para>
            </listitem>
            <listitem>
              <para>Divertissement ;</para>
            </listitem>
            <listitem>
              <para>Internet</para>
            </listitem>
            <listitem>
              <para>Multim&eacute;dia</para>
            </listitem>
            <listitem>
              <para>Utilitaires</para>
            </listitem>
          </itemizedlist>
        </listitem>
        <listitem>
          <para>des lanceurs ;</para>
          <para>Un  <firstterm>lanceur</firstterm> d&eacute;marre une application donn&eacute;e, ex&eacute;cute une commande ou ouvre un fichier. L'ic&ocirc;ne de la calculatrice de <xref linkend="gosoverview-FIG-28"/> est un lanceur de l'application <application>Calculatrice</application>. Les lanceurs peuvent r&eacute;sider dans un tableau de bord ou dans un menu. Cliquez sur le lanceur pour ex&eacute;cuter l'action qui lui est associ&eacute;e.</para>
          <para>Vous pouvez cr&eacute;er vos propres lanceurs d'application. Par exemple, vous pouvez cr&eacute;er un lanceur associ&eacute; &agrave; une application de traitement de texte fr&eacute;quemment utilis&eacute;e et le placer dans un tableau de bord pour pouvoir y acc&eacute;der ais&eacute;ment. Pour ajouter un lanceur &agrave; un tableau de bord, cliquez avec le bouton droit sur un espace libre de celui-ci, puis s&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Lanceur</guimenuitem></menuchoice>. </para>
          <para>Vous pouvez &eacute;galement ajouter un lanceur depuis un menu en cliquant sur un espace libre du tableau de bord, puis en s&eacute;lectionnant <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Lanceur depuis le menu</guimenuitem></menuchoice>. S&eacute;lectionnez le lanceur &agrave; ajouter dans les sous-menus.</para>
        </listitem>
        <listitem>
          <para>Menus</para>
          <para>Vous pouvez acc&eacute;der &agrave; toutes les fonctions du bureau par le biais des menus. Les tableaux de bord par d&eacute;faut contiennent des menus que vous pouvez utiliser conjointement avec des tableaux de bord pour ex&eacute;cuter vos t&acirc;ches. Pour ouvrir un menu depuis un tableau de bord, s&eacute;lectionnez l'ic&ocirc;ne qui lui est associ&eacute;e. Pour ouvrir un menu depuis le panneau de menus, cliquez sur le texte correspondant. </para>
          <para>Les menus ajout&eacute;s aux tableaux de bord sont repr&eacute;sent&eacute;s par une ic&ocirc;ne contenant une fl&egrave;che. La fl&egrave;che indique que l'ic&ocirc;ne repr&eacute;sente un menu. L'ic&ocirc;ne de <xref linkend="gosoverview-FIG-28"/> s'affiche lorsque vous ajoutez le menu <guimenuitem>Pr&eacute;f&eacute;rences du bureau</guimenuitem> &agrave; un tableau de bord.</para>
          <para>Vous pouvez &eacute;galement ajouter le <guimenu>menu GNOME</guimenu> &agrave; l'un de vos tableaux de bord. Pour ce faire, cliquez avec le bouton droit sur un espace libre dans celui-ci, puis s&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Menu GNOME</guimenuitem></menuchoice>.</para>
        </listitem>
        <listitem>
          <para>des tiroirs ;</para>
          <para>Les <firstterm>tiroirs</firstterm> repr&eacute;sentent des extensions coulissantes apport&eacute;es &agrave; un tableau de bord, que vous pouvez ouvrir ou fermer &agrave; l'aide d'une ic&ocirc;ne de tiroir, tel qu'illustr&eacute; dans <xref linkend="gosoverview-FIG-28"/>. Ils peuvent vous aider &agrave; organiser votre travail lorsque vous ex&eacute;cutez de nombreuses applications simultan&eacute;ment. Vous pouvez placer tous les &eacute;l&eacute;ments fonctionnels corr&eacute;l&eacute;s dans un tiroir et ins&eacute;rer celui-ci sur tous les types de tableaux de bord. </para>
          <para>Pour ajouter un tiroir &agrave; un tableau de bord, cliquez avec le bouton droit sur un espace libre de celui-ci, puis s&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem> Tiroir</guimenuitem></menuchoice>. </para>
          <para>Pour ouvrir un tiroir, cliquez sur celui-ci. Pour le fermer, cliquez une nouvelle fois.</para>
        </listitem>
        <listitem>
          <para>Boutons <guibutton>Verrouiller</guibutton> et <guibutton>D&eacute;connecter </guibutton></para>
          <para>Le bouton <guibutton>Verrouiller</guibutton> vous permet de verrouiller votre &eacute;cran. L'ic&ocirc;ne de verrouillage de <xref linkend="gosoverview-FIG-28"/> est le bouton <guibutton>Verrouiller </guibutton>. Celui-ci vous permet de mettre un terme &agrave; votre session. </para>
          <para>Pour ajouter les boutons  &agrave; un tableau de bord, cliquez avec le bouton droit sur un espace disponible de celui-ci, puis s&eacute;lectionnez <guimenuitem>Ajouter au tableau de bord</guimenuitem>. Ensuite, vous pouvez choisir les boutons souhait&eacute;s. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosoverview-21">
      <title>Manipulation d'objets de tableau de bord</title>
      <para>Vous pouvez manipuler les objets de tableau de bord en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
      <itemizedlist>
        <listitem>
          <para>D&eacute;placer les objets dans un m&ecirc;me tableau de bord ou d'un tableau de bord &agrave; l'autre.</para>
          <para>Vous pouvez d&eacute;placer les objets vers un autre emplacement du tableau de bord. Vous pouvez &eacute;galement d&eacute;placer un objet d'un tableau de bord &agrave; l'autre. Le bouton du milieu de la souris permet de faire glisser l'objet de tableau de bord vers son nouvel emplacement.</para>
        </listitem>
        <listitem>
          <para>Copier des &eacute;l&eacute;ments de menu dans un tableau de bord.</para>
          <para>Faites glisser l'&eacute;l&eacute;ment du menu sur le tableau de bord. S'il s'agit d'un lanceur, vous pouvez &eacute;galement cliquer avec le bouton droit sur celui-ci, puis s&eacute;lectionner <guimenuitem> Ajouter ce lanceur au tableau de bord</guimenuitem>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-42">
    <title>Menus</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <para>Vous pouvez acc&eacute;der &agrave; toutes les fonctions du bureau par le biais des menus. Les tableaux de bord par d&eacute;faut contiennent des menus que vous pouvez utiliser conjointement avec des tableaux de bord pour ex&eacute;cuter vos t&acirc;ches. Le panneau de menus contient les menus <guimenu>Applications</guimenu> et <guimenu> Actions</guimenu>. Vous pouvez &eacute;galement ajouter le <guimenu>menu GNOME</guimenu> &agrave; vos tableaux de bord. </para>
    <para>Les menus <guimenu>Applications</guimenu> et <guimenu>Actions </guimenu> permettent d'acc&eacute;der &agrave; presque toutes les applications, commandes et options de configuration standard. Vous pouvez &eacute;galement acc&eacute;der aux menus <guimenu>Applications</guimenu> et <guimenu>Actions</guimenu> depuis le <guimenu>GNOME Menu</guimenu>. Les &eacute;l&eacute;ments du menu <guimenu> Actions</guimenu> se trouvent au niveau le plus &eacute;lev&eacute; du <guimenu>menu GNOME</guimenu>. </para>
    <para>Pour ajouter un <guimenu>menu GNOME</guimenu> &agrave; un tableau de bord, cliquez avec le bouton droit sur celui-ci, puis s&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Menu GNOME</guimenuitem></menuchoice>. Le <guimenu>menu GNOME</guimenu> est repr&eacute;sent&eacute; par une empreinte de pied stylis&eacute;e, tel qu'illustr&eacute; ci-dessous :</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icône du menu GNOME.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Le bouton <guibutton>Menu GNOME</guibutton> situ&eacute; sur un tableau de bord permet d'ouvrir le <guimenu>menu GNOME</guimenu>. </para>
    <para>Vous pouvez ajouter autant de menus suppl&eacute;mentaires que vous le souhaitez aux tableaux de bord. Pour ouvrir un tel menu, cliquez sur l'ic&ocirc;ne correspondante dans le tableau de bord. D'autres actions sont possibles depuis les menus, par exemple copier des &eacute;l&eacute;ments de menu dans des tableaux de bord. </para>
  </sect1>
  <sect1 id="gosoverview-18">
    <title>Fen&ecirc;tres du bureau</title>
    <indexterm>
      <primary>fen&ecirc;tre</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <para>Vous pouvez afficher plusieurs fen&ecirc;tres simultan&eacute;ment sur le bureau. Chaque fen&ecirc;tre poss&egrave;de un cadre. Celui-ci contient des &eacute;l&eacute;ments de contr&ocirc;le actifs utilisables en synergie avec la fen&ecirc;tre.</para>
    <sect2 id="gosoverview-16">
      <title>Types de fen&ecirc;tres</title>
      <para>Le bureau propose les types de fen&ecirc;tres suivants :</para>
      <itemizedlist>
        <listitem>
          <para>Fen&ecirc;tres d'application</para>
          <para>Lorsque vous ex&eacute;cutez une application, g&eacute;n&eacute;ralement, un cadre entoure la fen&ecirc;tre. Le bord sup&eacute;rieur de la fen&ecirc;tre d'application contient une barre de titre. Celle-ci contient des boutons que vous pouvez employer pour travailler dans la fen&ecirc;tre. Les boutons du cadre d'une fen&ecirc;tre d'application permettent d'ex&eacute;cuter des actions telles qu'ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu> ou fermer la fen&ecirc;tre. Ce menu propose des commandes applicables &agrave; la fen&ecirc;tre. </para>
        </listitem>
        <listitem>
          <para>Fen&ecirc;tres de dialogue</para>
          <para>Les fen&ecirc;tres dialogue sont associ&eacute;es aux processus interactifs. Elles se composent d&quot;un cadre et d'un seul volet interactif contenant des informations et des contr&ocirc;les destin&eacute;s &agrave; l'utilisateur. Le pr&eacute;sent manuel d&eacute;signe la partie interactive d'une fen&ecirc;tre de dialogue par &quot;bo&icirc;te de dialogue&quot;. Le cadre de la fen&ecirc;tre de dialogue contient des boutons vous permettant d'ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>ou de fermer la fen&ecirc;tre.</para>
        </listitem>
      </itemizedlist>
<!--<para>To change the theme of your window frames, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Desktop Preferences</guisubmenu><guisubmenu>Advanced</guisubmenu><guimenuitem>FIXME</guimenuitem></menuchoice>, then choose the theme that you require. </para>-->
    </sect2>
    <sect2 id="gosoverview-32">
      <title>Manipulation des fen&ecirc;tres</title>
      <para>Le cadre d'une fen&ecirc;tre d'application ou de dialogue permet d'ex&eacute;cuter diff&eacute;rentes actions dans celles-ci. La plupart des &eacute;l&eacute;ments de contr&ocirc;le se situe sur le bord sup&eacute;rieur du cadre. <xref linkend="gosoverview-FIG-33"/> pr&eacute;sente le bord sup&eacute;rieur du cadre d'une fen&ecirc;tre d'application standard.</para>
      <figure id="gosoverview-FIG-33">
        <title>Bord sup&eacute;rieur du cadre d'une fen&ecirc;tre d'application standard</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/titlebar_anno_window.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Bord supérieur de la fenêtre d'application. Légende : bouton Menu de la fenêtre, Barre de titre, boutons Réduire, Agrandir, Fermer la fenêtre.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Les &eacute;l&eacute;ments de contr&ocirc;le actifs du cadre de la fen&ecirc;tre sont les suivants : </para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="41.65*"/>
          <colspec colname="colspec1" colwidth="58.35*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>&Eacute;l&eacute;ment de contr&ocirc;le</para>
              </entry>
              <entry valign="top">
                <para>Description </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Bouton <guibutton>Menu Fen&ecirc;tre</guibutton></para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Ce bouton permet d'ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Barre de titre</para>
              </entry>
              <entry valign="top">
                <para>La barre de titre permet de d&eacute;placer la fen&ecirc;tre ou de la r&eacute;duire &agrave; sa plus simple expression. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Bouton <guibutton>R&eacute;duire</guibutton></para>
              </entry>
              <entry valign="top">
                <para>Ce bouton permet de r&eacute;duire la fen&ecirc;tre. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Bouton <guibutton>Agrandir</guibutton></para>
              </entry>
              <entry valign="top">
                <para>Ce bouton permet d'agrandir et de restaurer la fen&ecirc;tre.</para>
                <para>Cliquez sur celui-ci pour agrandir la fen&ecirc;tre. Pour restaurer la fen&ecirc;tre, cliquez une nouvelle fois sur le bouton <guibutton>Agrandir</guibutton>. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Bouton <guibutton>Fermer la fen&ecirc;tre</guibutton></para>
              </entry>
              <entry valign="top">
                <para>Ce bouton permet de fermer la fen&ecirc;tre. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>Bordure</para>
              </entry>
              <entry colname="colspec1">
                <para>Pour ouvrir le <guimenu>menu Fen&ecirc;tre</guimenu>, cliquez avec le bouton droit sur la bordure.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Pour modifier la taille de la fen&ecirc;tre, capturez la bordure, mais pas la barre de titre. Faites glisser le bord jusqu'&agrave; ce que la fen&ecirc;tre atteigne la taille requise. </para>
    </sect2>
    <sect2 id="gosoverview-20">
      <title>Activation d'une fen&ecirc;tre</title>
      <para>Il est possible de proc&eacute;der &agrave; des entr&eacute;es &agrave; l'aide de la souris ou du clavier dans une fen&ecirc;tre activ&eacute;e. Vous ne pouvez activer qu'une seule fen&ecirc;tre &agrave; la fois. L'apparence de celle-ci diff&egrave;re de celle des autres. </para>
      <para>Les &eacute;l&eacute;ments suivants permettent d'activer une fen&ecirc;tre.</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="33.62*"/>
          <colspec colname="colspec1" colwidth="66.38*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>&Eacute;l&eacute;ment</para>
              </entry>
              <entry valign="top">
                <para> Action</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Souris</para>
              </entry>
              <entry valign="top">
                <para>Cliquer sur la fen&ecirc;tre si celle-ci est visible. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Touches de raccourci</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Les touches de raccourci permettent de passer d'une fen&ecirc;tre ouverte &agrave; l'autre. Pour activer une fen&ecirc;tre, rel&acirc;chez les touches. Les touches de raccourci par d&eacute;faut permettant de passer d'une fen&ecirc;tre &agrave; l'autre sont <keycombo><keycap>Alt</keycap><keycap> Tab</keycap></keycombo>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Liste de fen&ecirc;tres</application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Cliquez sur le bouton qui repr&eacute;sente la fen&ecirc;tre dans la <application>Liste de fen&ecirc;tres</application>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Changeur de bureau</application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Cliquez sur la fen&ecirc;tre &agrave; activer dans l'&eacute;cran <application>Changement de bureau</application>. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-39">
    <title>Espaces de travail</title>
    <indexterm>
      <primary>espaces de travail</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <para>Vous pouvez afficher plusieurs fen&ecirc;tres simultan&eacute;ment sur le bureau. Celles-ci s'affichent dans des subdivisions du bureau appel&eacute;es espaces de travail. Un espace de travail est une zone dans laquelle vous pouvez travailler. </para>
    <para>Tous ceux-ci contiennent le m&ecirc;me arri&egrave;re-plan, les m&ecirc;mes tableaux de bord et les m&ecirc;mes menus. Toutefois, vous pouvez ex&eacute;cuter des applications et ouvrir des fen&ecirc;tres diff&eacute;rentes dans chacun d'entre eux. Il est impossible d'afficher plusieurs espaces de travail simultan&eacute;ment sur le bureau. Toutefois, tous peuvent contenir des fen&ecirc;tres ouvertes. </para>
    <para>Les espaces de travail permettent d'organiser le bureau lorsque vous ex&eacute;cutez de nombreuses applications simultan&eacute;ment. Lorsque votre espace de travail comporte trop de fen&ecirc;tres, vous pouvez d&eacute;placer votre travail vers un autre espace. Vous pouvez &eacute;galement passer &agrave; un autre espace de travail et y d&eacute;marrer d'autres applications.</para>
    <para>Les espaces de travail sont affich&eacute;s dans l'applet <application>Changeur de bureau</application>. Dans <xref linkend="gosoverview-FIG-42"/>, le <application>Changeur de bureau</application> contient quatre espaces de travail. Les trois premiers comportent des fen&ecirc;tres ouvertes. Le dernier ne contient pas de fen&ecirc;tre active. </para>
    <figure id="gosoverview-FIG-42">
      <title>Espaces de travail affich&eacute;s dans le Changeur de bureau</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/workspace_switcher_applet.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Applet Changeur de bureau. Le contexte décrit le graphique.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <sect2 id="gosoverview-41">
      <title>Passage d'un espace de travail &agrave; l'autre</title>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>navigation</secondary>
      </indexterm>
      <para>Vous pouvez passer d'un espace de travail &agrave; l'autre en recourant &agrave; l'une des m&eacute;thodes suivantes : </para>
      <itemizedlist>
        <listitem>
          <para>Dans <application>Changeur de bureau</application>, cliquez sur l'espace de travail dans lequel vous souhaitez travailler.</para>
        </listitem>
        <listitem>
          <para>Appuyez sur <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>fl&egrave;che droite</keycap></keycombo> pour passer &agrave; l'espace de travail situ&eacute; &agrave; droite de celui en cours.</para>
        </listitem>
        <listitem>
          <para>Appuyez sur <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>fl&egrave;che gauche</keycap></keycombo> pour passer &agrave; l'espace de travail situ&eacute; &agrave; gauche de celui en cours.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosoverview-40">
      <title>Ajout d'espaces de travail</title>
      <indexterm>
        <primary>espaces de travail</primary>
        <secondary>sp&eacute;cification du nombre de</secondary>
      </indexterm>
      <para>Pour ce faire, cliquez avec le bouton droit sur l'applet <application>Changeur de bureau</application>, puis s&eacute;lectionnez <guimenuitem>Pr&eacute;f&eacute;rences</guimenuitem>. La bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences de l'espace de travail</guilabel> s'affiche. La bo&icirc;te de s&eacute;lection num&eacute;rique <guilabel>Nombre de bureaux</guilabel> permet de sp&eacute;cifier le nombre d'espaces de travail requis.</para>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-56">
    <title>Gestionnaire de fichiers Nautilus</title>
    <indexterm>
      <primary>gestionnaire de fichiers Nautilus</primary>
      <see>gestionnaire de fichiers</see>
    </indexterm>
    <indexterm>
      <primary>gestionnaire de fichiers</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <para>Le gestionnaire de fichiers <application>Nautilus</application> propose un point d'acc&egrave;s int&eacute;gr&eacute; &agrave; vos fichiers et applications ainsi qu'aux sites FTP. Pour ouvrir une fen&ecirc;tre <application>Nautilus</application>, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Dossier personnel</guimenuitem></menuchoice>. La figure suivante illustre une fen&ecirc;tre <application> Nautilus</application> pr&eacute;sentant le contenu d'un dossier.</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_iconview_window.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Fenêtre Nautilus. Le contexte décrit le graphique.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Une fen&ecirc;tre <application>Nautilus</application> contient les tableaux de bord suivants.</para>
    <itemizedlist>
      <listitem>
        <para>Panneau lat&eacute;ral</para>
        <para>permet de naviguer dans les fichiers. Ce panneau pr&eacute;sente &eacute;galement des informations relatives au fichier ou au dossier courant. Le panneau lat&eacute;ral est situ&eacute; &agrave; gauche de la fen&ecirc;tre.</para>
      </listitem>
      <listitem>
        <para>Volet d'affichage</para>
        <para>Affiche le contenu des fichiers et dossiers. Le volet d'affichage est situ&eacute; &agrave; droite de la fen&ecirc;tre.</para>
      </listitem>
    </itemizedlist>
    <para><application>Nautilus</application> vous permet : </para>
    <itemizedlist>
      <listitem>
        <para>d'afficher vos fichiers et dossiers.</para>
        <para>Vous pouvez afficher vos fichiers et dossiers sous la forme d'ic&ocirc;nes ou sous la forme d'une liste. Le contenu de certains types de fichiers peut &ecirc;tre consult&eacute; dans une fen&ecirc;tre <application>Nautilus</application>. Vous pouvez &eacute;galement ouvrir les fichiers dans l'application appropri&eacute;e depuis <application>Nautilus</application>. </para>
      </listitem>
      <listitem>
        <para>de g&eacute;rer vos fichiers et dossiers.</para>
        <para><application>Nautilus</application> permet de cr&eacute;er, d&eacute;placer, copier, renommer et supprimer des fichiers et des dossiers.</para>
      </listitem>
      <listitem>
        <para>d'ex&eacute;cuter des scripts.</para>
        <para>Vous pouvez ex&eacute;cuter des scripts depuis <application>Nautilus</application> et s&eacute;lectionner des fichiers et des dossiers dans lesquels les ex&eacute;cuter.</para>
      </listitem>
      <listitem>
        <para>de personnaliser vos fichiers et dossiers.</para>
        <para>il est possible d'ajouter des embl&egrave;mes aux fichiers et dossiers pour indiquer des &eacute;tats particuliers. Par exemple, vous pouvez ajouter un embl&egrave;me Important &agrave; un fichier pour indiquer que celui-ci est important. Vous pouvez &eacute;galement personnaliser les dossiers en recourant &agrave; l'une des m&eacute;thodes suivantes : <itemizedlist><listitem><para>ajouter une note &agrave; un dossier ;</para></listitem><listitem><para>sp&eacute;cifier un motif d'arri&egrave;re-plan personnalis&eacute; pour le dossier ;</para></listitem><listitem><para>sp&eacute;cifier un param&egrave;tre de zoom pour un dossier.</para></listitem></itemizedlist></para>
      </listitem>
    </itemizedlist>
    <para><application>Nautilus</application> cr&eacute;e &eacute;galement l'arri&egrave;re-plan du bureau. </para>
    <sect2 id="gosoverview-58">
      <title>Ouverture de fichiers depuis le gestionnaire de fichiers Nautilus</title>
      <para>Pour naviguer jusqu'au dossier o&ugrave; r&eacute;side le fichier requis, cliquez deux fois sur les ic&ocirc;nes de dossier dans le volet d'affichage. Lorsque le dossier &agrave; ouvrir s'affiche, cliquez deux fois sur celui-ci. </para>
    </sect2>
    <sect2 id="gosoverview-57">
      <title>D&eacute;placement de fichiers entre des dossiers</title>
      <para>Vous pouvez d&eacute;placer des fichiers entre des dossiers en ouvrant deux fen&ecirc;tres <application> Nautilus</application> ou plus. Ouvrez un dossier diff&eacute;rent dans chaque fen&ecirc;tre, puis faites glisser les fichiers d'une fen&ecirc;tre &agrave; l'autre. </para>
    </sect2>
  </sect1>
  <sect1 id="gosgetstarted-11">
    <title>Arri&egrave;re-plan du bureau</title>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau Nautilus</primary>
      <see>arri&egrave;re-plan du bureau </see>
    </indexterm>
    <indexterm>
      <primary>arri&egrave;re-plan du bureau</primary>
      <secondary> pr&eacute;sentation</secondary>
    </indexterm>
    <para>Il s'agit d'un composant actif du bureau. Vous pouvez utiliser l'arri&egrave;re-plan du bureau pour ex&eacute;cuter les actions suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>D&eacute;marrer vos applications et ouvrir vos fichiers ou dossiers. </para>
        <para>Vous pouvez ajouter des <firstterm>objets &agrave; l'arri&egrave;re-plan du bureau</firstterm> pour pouvoir acc&eacute;der plus ais&eacute;ment aux applications, fichiers et dossiers fr&eacute;quemment utilis&eacute;s. Par exemple, vous ajoutez un lanceur permettant d'ouvrir une application fr&eacute;quemment utilis&eacute;e.</para>
      </listitem>
      <listitem>
        <para>Ouvrir le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu>.</para>
        <para>Cliquez avec le bouton droit sur l'arri&egrave;re-plan du bureau pour ouvrir le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu>. Ce menu permet d'ex&eacute;cuter des actions sur l'arri&egrave;re-plan du bureau.</para>
      </listitem>
    </itemizedlist>
    <para>Le gestionnaire de fichiers <application>Nautilus</application> g&egrave;re l'arri&egrave;re-plan du bureau.</para>
    <sect2 id="gosoverview-29">
      <title>Ouverture d'objets d'arri&egrave;re-plan du bureau</title>
      <para>Pour ouvrir un objet depuis l'arri&egrave;re-plan du bureau, cliquez deux fois sur celui-ci. Vous pouvez d&eacute;finir vos pr&eacute;f&eacute;rences dans une fen&ecirc;tre  <application>Nautilus</application> de mani&egrave;re &agrave; ne devoir cliquer qu'une seule fois sur un objet pour ex&eacute;cuter l'action par d&eacute;faut.</para>
    </sect2>
    <sect2 id="gosoverview-19">
      <title>Ajout d'objets &agrave; l'arri&egrave;re-plan du bureau</title>
      <para>Vous pouvez ajouter des objets &agrave; l'arri&egrave;re-plan du bureau pour pouvoir acc&eacute;der plus ais&eacute;ment aux applications, fichiers et dossiers fr&eacute;quemment utilis&eacute;s. Pour ce faire, proc&eacute;dez comme suit :</para>
      <itemizedlist>
        <listitem>
          <para>Le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu> permet d'ajouter un lanceur &agrave; l'arri&egrave;re-plan du bureau.</para>
        </listitem>
        <listitem>
          <para>Faites glisser un objet d'une fen&ecirc;tre du gestionnaire de fichiers sur l'arri&egrave;re-plan du bureau. Par exemple, vous pouvez cr&eacute;er un lien symbolique vers un fichier souvent utilis&eacute;, puis le faire glisser sur l'arri&egrave;re-plan du bureau. L'ic&ocirc;ne relative au lien est d&eacute;plac&eacute;e sur l'arri&egrave;re-plan du bureau. Pour ouvrir le fichier, cliquez deux fois sur l'ic&ocirc;ne. Vous pouvez &eacute;galement faire glisser des fichiers et des dossiers sur l'arri&egrave;re-plan du bureau. </para>
        </listitem>
        <listitem>
          <para>Faites glisser un lanceur d'application d'un menu vers l'arri&egrave;re-plan du bureau. Par exemple, vous pouvez ouvrir un menu contenant un lanceur associ&eacute; &agrave; une application souvent utilis&eacute;e, puis le faire glisser sur l'arri&egrave;re-plan du bureau. </para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-509">
    <title>Emplacement D&eacute;marrer ici</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_starthere_launcher.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icône Démarrer ici.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>emplacement D&eacute;marrer ici</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <indexterm>
      <primary>gestionnaire de fichiers</primary>
      <secondary>emplacement D&eacute;marrer ici</secondary>
      <see>emplacement D&eacute;marrer ici</see>
    </indexterm>
    <para>L'emplacement <guilabel>D&eacute;marrer ici</guilabel> permet d'acc&eacute;der aux fonctions suivantes : </para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Applications</guilabel>
        </para>
        <para>Cliquez deux fois sur <guilabel>Applications</guilabel> pour acc&eacute;der aux principales applications GNOME. Vous pouvez &eacute;galement acc&eacute;der au menu <guimenu>Applications</guimenu> par le biais du <guimenu>menu GNOME</guimenu> et du panneau de menus.</para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Pr&eacute;f&eacute;rences du bureau</guilabel>
        </para>
        <para>Cliquez deux fois sur <guilabel>Pr&eacute;f&eacute;rences du bureau</guilabel> pour personnaliser votre bureau. </para>
      </listitem>
      <listitem>
        <para>Programmes vous permettant de configurer votre syst&egrave;me comme serveur et de s&eacute;lectionner d'autres param&egrave;tres syst&egrave;me.</para>
      </listitem>
    </itemizedlist>
    <para>Vous pouvez acc&eacute;der &agrave; l'emplacement <guilabel>D&eacute;marrer ici</guilabel> en utilisant l'une des m&eacute;thodes suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>Depuis une fen&ecirc;tre <application>Nautilus</application> :</para>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Aller</guimenu><guimenuitem>D&eacute;marrer ici </guimenuitem></menuchoice>. Le contenu de l'emplacement <guilabel>D&eacute;marrer ici</guilabel> s'affiche dans la fen&ecirc;tre.</para>
      </listitem>
      <listitem>
        <para>Depuis l'arri&egrave;re-plan du bureau :</para>
        <para>Cliquez deux fois sur l'objet <guilabel>D&eacute;marrer ici</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. Le contenu de l'emplacement <guilabel>D&eacute;marrer ici</guilabel> s'affiche dans une fen&ecirc;tre <application>Nautilus</application>.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-55">
    <title>Pr&eacute;f&eacute;rences du bureau</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <para>Les outils de pr&eacute;f&eacute;rence du bureau permettent de configurer la plupart des caract&eacute;ristiques de celui-ci. Chacun d'entre eux d&eacute;termine une facette donn&eacute;e du comportement du bureau. Par exemple, vous pouvez utiliser un outil de pr&eacute;f&eacute;rence pour s&eacute;lectionner un th&egrave;me pour le bureau. Un <firstterm>th&egrave;me</firstterm> repr&eacute;sente un groupe de param&egrave;tres coordonn&eacute;s qui sp&eacute;cifient l'apparence d'une partie de l'interface. </para>
    <para>A des fins de convivialit&eacute;, les outils sont regroup&eacute;s sous les intitul&eacute;s suivants : </para>
    <itemizedlist>
      <listitem>
        <para>De base</para>
      </listitem>
      <listitem>
        <para><guilabel>Accessibilit&eacute;</guilabel> ;</para>
      </listitem>
      <listitem>
        <para><guilabel>Avanc&eacute;</guilabel>.</para>
      </listitem>
    </itemizedlist>
    <para>Vous pouvez ouvrir vos outils de pr&eacute;f&eacute;rence en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
    <itemizedlist>
      <listitem>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Pr&eacute;f&eacute;rences du bureau</guimenuitem></menuchoice>. S&eacute;lectionnez l'&eacute;l&eacute;ment requis dans les sous-menus. </para>
      </listitem>
      <listitem>
        <para>Cliquez deux fois sur l'objet <guilabel>D&eacute;marrer ici</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. Une fen&ecirc;tre <application>Nautilus</application> s'ouvre &agrave; l'emplacement <guilabel>D&eacute;marrer ici</guilabel>. Cliquez deux fois sur l'objet <guilabel> Pr&eacute;f&eacute;rences du bureau</guilabel> de la fen&ecirc;tre <application>Nautilus</application> pour afficher vos outils de pr&eacute;f&eacute;rence. Cliquez deux fois sur l'&eacute;l&eacute;ment requis. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-54">
    <title>Applications</title>
    <indexterm>
      <primary>applications</primary>
      <secondary>pr&eacute;sentation</secondary>
    </indexterm>
    <para>Les applications fournies avec le bureau GNOME pr&eacute;sente plusieurs caract&eacute;ristiques communes. Par exemple, leur apparence est identique. Ces ressemblances sont dues au fait qu'elles utilisent les m&ecirc;mes biblioth&egrave;ques de programmation. Les applications qui utilisent les biblioth&egrave;ques de programmation standard de GNOME sont appel&eacute;es <firstterm>applications compatibles GNOME</firstterm>. Par exemple, <application>Nautilus</application> et l'&eacute;diteur de texte <application> gedit</application> sont des applications compatibles GNOME.</para>
    <para>GNOME propose des biblioth&egrave;ques compl&eacute;mentaires &agrave; celles du syst&egrave;me d'exploitation. Les librairies permettent &agrave; GNOME d'ex&eacute;cuter les applications existantes ainsi que des applications compatibles GNOME. Par exemple, si votre syst&egrave;me d'exploitation est bas&eacute; sur UNIX, vous pouvez ex&eacute;cuter vos applications X11 et Motif courantes depuis le bureau GNOME.</para>
    <para>Certaines caract&eacute;ristiques des applications compatibles GNOME se pr&eacute;sentent comme suit : </para>
    <itemizedlist>
      <listitem>
        <para>Apparence identique</para>
        <para>Les applications compatibles GNOME poss&egrave;dent une apparence identique. Elles utilisent les param&egrave;tres sp&eacute;cifi&eacute;s dans les outils de pr&eacute;f&eacute;rence du bureau. Les outils suivants permettent de modifier leur apparence :<itemizedlist><listitem><para><menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guimenuitem>Menus &amp; Barre d'outils </guimenuitem></menuchoice></para></listitem><listitem><para><menuchoice><guimenu>Applications</guimenu><guisubmenu> Pr&eacute;f&eacute;rences du bureau</guisubmenu><guimenuitem>Th&egrave;me</guimenuitem></menuchoice></para></listitem></itemizedlist></para>
      </listitem>
      <listitem>
        <para>Barres de menus, d'outils et d'&eacute;tat</para>
        <para>La plupart des applications compatibles GNOME poss&egrave;dent une barre de menus, une barre d'outils et une barre d'&eacute;tat. La barre de menu contient toujours un menu <guimenu>Fichier</guimenu> et un menu <guimenu> Aide</guimenu>. Le menu <guimenu>Fichier</guimenu> n'est jamais d&eacute;pourvu d'un &eacute;l&eacute;ment <guimenuitem>Quitter</guimenuitem> ni le menu <guimenu>Aide</guimenu> d'un &eacute;l&eacute;ment <guimenuitem>&Agrave; propos de</guimenuitem>.</para>
        <para>La <firstterm>barre d'outils</firstterm> appara&icirc;t sous la barre de menus. Elle contient des boutons correspondant aux commandes les plus fr&eacute;quemment utilis&eacute;es. La <firstterm>barre d'&eacute;tat</firstterm> est situ&eacute;e en bas d'une fen&ecirc;tre. Elle fournit des informations relatives &agrave; l'&eacute;tat actuel des objets affich&eacute;s dans celle-ci. Les applications compatibles GNOME peuvent &eacute;galement contenir d'autres barres. Par exemple, <application>Nautilus </application> contient une barre d'emplacement.</para>
        <para>Certaines barres des applications compatibles GNOME sont d&eacute;tachables. Cela signifie que la barre poss&egrave;de une poign&eacute;e permettant de la faire glisser vers un autre emplacement. Vous pouvez faire glisser la barre pour l'attacher &agrave; l'autre extr&eacute;mit&eacute; de la fen&ecirc;tre ou &agrave; une autre partie du bureau. Par exemple, vous pouvez d&eacute;tacher la barre d'emplacement du gestionnaire de fichiers <application>Nautilus</application>. </para>
      </listitem>
      <listitem>
        <para>Touches de raccourci par d&eacute;faut</para>
        <para>Les applications compatibles GNOME utilisent les m&ecirc;mes touches de raccourci pour ex&eacute;cuter les m&ecirc;mes actions. Par exemple, pour quitter l'une d'entre elles, appuyez sur <keycombo><keycap> Ctrl</keycap><keycap>Q</keycap></keycombo>. Pour d&eacute;faire une action dans l'une de ces applications, appuyez sur <keycombo><keycap>Ctrl</keycap><keycap>Z</keycap></keycombo>. </para>
      </listitem>
      <listitem>
        <para>Glisser-d&eacute;placer</para>
        <para>Les applications compatibles GNOME utilisent le m&ecirc;me protocole pour mettre en oeuvre les op&eacute;rations glisser-d&eacute;placer. C'est pourquoi le retour d'informations est coh&eacute;rent entre elles.</para>
        <para>Le recours au m&ecirc;me protocole garantit &eacute;galement aux applications GNOME une interop&eacute;rabilit&eacute; sophistiqu&eacute;e. Par exemple, les applications compatibles GNOME reconnaissent le format des &eacute;l&eacute;ments gliss&eacute;s. Lorsque vous faites glisser un fichier HTML d'une fen&ecirc;tre <application>Nautilus</application> vers un navigateur Web, le fichier s'affiche au format HTML. Toutefois, si vous le faites glisser vers un &eacute;diteur de texte, il s'affiche au format &quot;texte standard&quot;. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-12">
    <title>Informations compl&eacute;mentaires</title>
    <indexterm>
      <primary>aide</primary>
      <secondary>recherche</secondary>
    </indexterm>
    <para>Le bureau vous propose de l'aide si vous souhaitez en savoir plus sur les zones suivantes : </para>
    <itemizedlist>
      <listitem>
        <para>rubriques du bureau ;</para>
      </listitem>
      <listitem>
        <para>applets ;</para>
      </listitem>
      <listitem>
        <para>Applications</para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosoverview-31">
      <title>Informations compl&eacute;mentaires sur les rubriques du bureau</title>
      <indexterm>
        <primary>aide</primary>
        <secondary>d&eacute;marrage du syst&egrave;me d'aide</secondary>
      </indexterm>
      <indexterm>
        <primary>aide</primary>
        <secondary>rubriques du bureau</secondary>
      </indexterm>
      <para>Vous trouverez des informations compl&eacute;mentaires sur les rubriques du bureau dans le syst&egrave;me d'aide int&eacute;gr&eacute; <application>Yelp</application>. Pour d&eacute;marrer le syst&egrave;me d'aide <application> Yelp</application>, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Aide</guimenuitem></menuchoice>. </para>
    </sect2>
    <sect2 id="gosgetstarted-33">
      <title>Informations compl&eacute;mentaires sur les applets</title>
      <indexterm>
        <primary>applets</primary>
        <secondary>aide</secondary>
      </indexterm>
      <indexterm>
        <primary>aide</primary>
        <secondary>applets</secondary>
      </indexterm>
      <para>Pour en savoir plus sur une applet sp&eacute;cifique, s&eacute;lectionnez <guimenuitem>Aide</guimenuitem>. </para>
    </sect2>
    <sect2 id="gosgetstarted-35">
      <title>Informations compl&eacute;mentaires sur les applications</title>
      <indexterm>
        <primary>applications</primary>
        <secondary>aide</secondary>
      </indexterm>
      <indexterm>
        <primary>aide</primary>
        <secondary>applications</secondary>
      </indexterm>
      <para>Pour en savoir plus sur une application sp&eacute;cifique, s&eacute;lectionnez <menuchoice><guimenu>Aide</guimenu><guimenuitem>Sommaire</guimenuitem></menuchoice>. Vous pouvez &eacute;galement d&eacute;marrer l'application, puis appuyer sur <keycap> F1</keycap>.</para>
    </sect2>
  </sect1>
</chapter>
