<?xml version="1.0" encoding="utf-8"?>
<chapter id="gospanel-1">
  <title>Utilisation des tableaux de bord</title>
  <highlights>
    <para>Le pr&eacute;sent chapitre d&eacute;crit l'utilisation des tableaux de bord. </para>
  </highlights>
  <sect1 id="gospanel-2">
    <title>Introduction aux tableaux de bord</title>
    <indexterm>
      <primary>tableaux de bord</primary>
      <secondary>introduction</secondary>
    </indexterm>
    <para>Un tableau de bord repr&eacute;sente une zone de votre bureau &agrave; partir de laquelle il est possible d'ex&eacute;cuter des applications et des applets ainsi que d'autres t&acirc;ches. Lorsque vous d&eacute;marrez une session pour la premi&egrave;re fois, le bureau contient les tableaux de bord suivants : </para>
    <itemizedlist>
      <listitem>
        <para>le panneau de menus ;</para>
      </listitem>
      <listitem>
        <para>le tableau de bord situ&eacute; en bas du bureau.</para>
      </listitem>
    </itemizedlist>
    <para>Les sections suivantes d&eacute;crivent ces tableaux de bord.</para>
    <sect2 id="gospanel-6">
      <title>Panneau de menus</title>
      <indexterm>
        <primary>Panneau de menus</primary>
        <secondary>introduction</secondary>
      </indexterm>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>Panneau de menus</secondary>
        <see>Panneau de menus</see>
      </indexterm>
      <para>Le panneau de menus couvre toute la longueur du bord sup&eacute;rieur de l'&eacute;cran. Ses menus sont davantage textuels que graphiques. <xref linkend="gospanel-FIG-60"/>Affiche le Panneau de menus. Il est possible que votre administrateur syst&egrave;me ait d&eacute;fini votre panneau de menus par d&eacute;faut en fonction des besoins locaux. Par cons&eacute;quent, il peut l&eacute;g&egrave;rement diff&eacute;rer de celui-ci.</para>
      <figure id="gospanel-FIG-60">
        <title>Panneau de menus par d&eacute;faut</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/menu_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Panneau de menus par défaut. Le contexte décrit le graphique.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <indexterm>
        <primary>Panneau de menus</primary>
        <secondary>contenu par d&eacute;faut</secondary>
      </indexterm>
      <para>Le panneau de menus par d&eacute;faut contient les objets suivants : </para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec3" colwidth="30.95*"/>
          <colspec colname="colspec4" colwidth="69.05*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Objet</para>
              </entry>
              <entry valign="top">
                <para>Description </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Menu <guimenu>Applications</guimenu></para>
              </entry>
              <entry valign="top">
                <para>Le menu <guimenu>Applications</guimenu> contient les applications GNOME standard.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Menu <guimenu>Actions</guimenu></para>
              </entry>
              <entry valign="top">
                <para>Le menu <guimenu>Actions</guimenu> propose des commandes vous permettant d'ex&eacute;cuter des t&acirc;ches sur le bureau. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3">
                <para>Lanceur du dossier personnel</para>
              </entry>
              <entry colname="colspec4">
                <para>Cliquez sur ce lanceur pour ouvrir votre dossier personnel dans une fen&ecirc;tre du gestionnaire de fichiers <application>Nautilus</application>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3">
                <para>Lanceur <application>Terminal</application></para>
              </entry>
              <entry colname="colspec4">
                <para>Cliquez sur ce lanceur pour d&eacute;marrer l'application <application>Terminal</application>. <application>Terminal </application> permet d'acc&eacute;der &agrave; une ligne de commande UNIX.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3" valign="top">
                <para>Applet <application>Contr&ocirc;le du volume</application></para>
              </entry>
              <entry colname="colspec4" valign="top">
                <para>Le <application>Contr&ocirc;leur de volume</application> permet de contr&ocirc;ler le volume du haut-parleur de votre syst&egrave;me</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Applet <application>Horloge</application></para>
              </entry>
              <entry valign="top">
                <para>L'<application>Horloge</application> affiche l'heure courante. Cliquez sur l'&eacute;cran de l'horloge pour afficher un menu contenant les commandes correspondantes.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3" valign="top">
                <indexterm>
                  <primary>Panneau de menus</primary>
                  <secondary>ic&ocirc;ne La liste de fen&ecirc;tres</secondary>
                </indexterm>
                <para>Ic&ocirc;ne Liste de fen&ecirc;tres</para>
              </entry>
              <entry colname="colspec4" valign="top">
                <para>La liste des fen&ecirc;tres reprend toutes les fen&ecirc;tres ouvertes. Pour activer une fen&ecirc;tre, cliquez sur l'ic&ocirc;ne situ&eacute;e &agrave; l'extr&ecirc;me droite du panneau de menus, puis s&eacute;lectionnez la fen&ecirc;tre requise. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Contrairement aux autres types de tableaux de bord, le panneau de menus ne peut &ecirc;tre affich&eacute; qu'une seule fois sur le bureau.</para>
    </sect2>
    <sect2 id="gospanel-3">
      <title>Tableau de bord inf&eacute;rieur</title>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>tableau de bord inf&eacute;rieur</secondary>
        <see>tableau de bord inf&eacute;rieur</see>
      </indexterm>
      <indexterm>
        <primary>tableau de bord inf&eacute;rieur</primary>
        <secondary>introduction</secondary>
      </indexterm>
      <para>Au d&eacute;marrage, un tableau de bord couvre toute la longueur du bord inf&eacute;rieur du bureau. <xref linkend="gospanel-FIG-58"/>affiche un tableau de bord inf&eacute;rieur par d&eacute;faut. Il est possible que votre administrateur syst&egrave;me ait d&eacute;fini votre tableau de bord inf&eacute;rieur en fonction de vos besoins propres. Par cons&eacute;quent, il se peut qu'il diverge l&eacute;g&egrave;rement de celui pr&eacute;sent&eacute; ici. </para>
      <figure id="gospanel-FIG-58">
        <title>Tableau de bord inf&eacute;rieur par d&eacute;faut</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/gnome_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Tableau de bord inférieur. Le contexte décrit le graphique.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <indexterm>
        <primary>tableau de bord inf&eacute;rieur</primary>
        <secondary>contenu par d&eacute;faut </secondary>
      </indexterm>
      <para>Le tableau de bord inf&eacute;rieur contient les applets suivantes :</para>
      <itemizedlist>
        <listitem>
          <para><application>Liste de fen&ecirc;tres</application> :Affiche un bouton pour chaque fen&ecirc;tre ouverte. La <application>Liste de fen&ecirc;tres</application> permet de r&eacute;duire ou de restaurer les fen&ecirc;tres.</para>
        </listitem>
        <listitem>
          <para><application>Changeur de bureau</application> :permet de naviguer entre vos espaces de travail.</para>
        </listitem>
      </itemizedlist>
      <para>Le comportement et l'apparence du tableau de bord inf&eacute;rieur sont personnalisables. N'h&eacute;sitez pas &agrave; les adapter &agrave; vos besoins. Vous pouvez &eacute;galement ajouter ou supprimer des objets dans votre tableau de bord inf&eacute;rieur. Il est possible de cr&eacute;er plusieurs tableaux de bord et de choisir des propri&eacute;t&eacute;s, des objets et des arri&egrave;re-plans diff&eacute;rents pour chacun d'entre eux. Les tableaux de bord peuvent &eacute;galement &ecirc;tre masqu&eacute;s.</para>
    </sect2>
  </sect1>
  <sect1 id="gospanel-5">
    <title>Gestion des tableaux de bord</title>
    <indexterm>
      <primary>tableaux de bord</primary>
      <secondary>gestion</secondary>
    </indexterm>
    <para>Les sections suivantes d&eacute;crivent les m&eacute;thodes de gestion des tableaux de bord.</para>
    <sect2 id="gospanel-10">
      <title>Ajout d'un nouveau tableau de bord</title>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>ajout de nouveaux</secondary>
      </indexterm>
      <para>Vous pouvez ajouter diff&eacute;rents types de tableaux de bord &agrave; votre bureau. <xref linkend="gospanel-TBL-47"/>&eacute;num&egrave;re les types de tableaux de bord qui peuvent &ecirc;tre ajout&eacute;s ainsi que leurs caract&eacute;ristiques. </para>
      <table frame="topbot" id="gospanel-TBL-47">
        <title>Types de tableaux de bord</title>
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="24.28*"/>
          <colspec colname="colspec1" colwidth="37.36*"/>
          <colspec colname="colspec2" colwidth="37.36*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Type de tableau de bord</para>
              </entry>
              <entry valign="top">
                <para>Comportement d'attachement </para>
              </entry>
              <entry valign="top">
                <para>Taille</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Tableau de bord d'angle</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>S'attache &agrave; l'un des bords de l'&eacute;cran, mais ne peut s'attacher qu'au centre ou &agrave; l'angle du bord. </para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>S'&eacute;tire de mani&egrave;re &agrave; pouvoir afficher tous les objets requis.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Panneau lat&eacute;ral</para>
              </entry>
              <entry valign="top">
                <para>S'attache &agrave; l'un des bords de l'&eacute;cran. Le tableau de d&eacute;marrage situ&eacute; en bas du bureau constitue un exemple de panneau lat&eacute;ral. </para>
              </entry>
              <entry valign="top">
                <para>S'&eacute;tire sur toute la longueur du bord auquel il s'attache.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Tableau de bord flottant</para>
              </entry>
              <entry valign="top">
                <para>Ne s'attache pas. Vous pouvez placer un tableau de bord flottant &agrave; un endroit quelconque du bureau.</para>
              </entry>
              <entry valign="top">
                <para>S'&eacute;tire de mani&egrave;re &agrave; pouvoir afficher tous les objets requis.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Tableau de bord coulissant</para>
              </entry>
              <entry valign="top">
                <para>S'attache &agrave; l'un des bords de l'&eacute;cran, peut s'attacher &agrave; un point quelconque du bord. </para>
              </entry>
              <entry valign="top">
                <para>S'&eacute;tire de mani&egrave;re &agrave; pouvoir afficher tous les objets requis.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>le panneau de menus ;</para>
              </entry>
              <entry colname="colspec1">
                <para>S'attache au bord sup&eacute;rieur de l'&eacute;cran. Il est impossible de d&eacute;placer le panneau de menus.</para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>Couvre toute la longueur du bord sup&eacute;rieur de l'&eacute;cran. Un seul panneau de menus peut figurer sur votre bureau.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
      <para>Pour ajouter un tableau de bord, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur un espace libre dans l'un des tableaux de bord, puis s&eacute;lectionnez <guimenuitem>Nouveau tableau de bord</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez le type de tableau de bord &agrave; ajouter. Le nouveau tableau de bord est ajout&eacute; au bureau. Il ne contient aucun objet, &agrave; l'exception d'un panneau de menus. </para>
          <para>Vous pouvez personnaliser le nouveau tableau de bord afin qu'il r&eacute;ponde &agrave; vos pr&eacute;f&eacute;rences.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gospanel-11">
      <title>Interaction avec un tableau de bord</title>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>interaction avec</secondary>
      </indexterm>
      <para>Pour interagir avec un tableau de bord, cliquez avec le bouton droit sur un espace libre du tableau. Il est &eacute;galement possible de cliquer avec le bouton du milieu sur l'un des boutons de masquage pour s&eacute;lectionner le tableau de bord si celui-ci ne comporte aucun espace libre. Si les boutons de masquage n'apparaissent pas sur un tableau de bord, modifiez les propri&eacute;t&eacute;s de celui-ci de mani&egrave;re &agrave; les rendre visibles. </para>
      <para>Les boutons de la souris permettent d'interagir avec un tableau de bord de la mani&egrave;re suivante :</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="30.65*"/>
          <colspec colname="colspec1" colwidth="69.35*"/>
          <tbody>
            <row>
              <entry valign="top">
                <para>Cliquer avec le bouton du milieu</para>
              </entry>
              <entry valign="top">
                <para>permet de capturer un tableau de bord, puis de le faire glisser vers un autre emplacement.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Cliquer avec le bouton droit</para>
              </entry>
              <entry valign="top">
                <para>Ouvre le menu contextuel du tableau de bord.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gospanel-12">
      <title>D&eacute;placement d'un tableau de bord</title>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>d&eacute;placement</secondary>
      </indexterm>
      <para>Vous pouvez d&eacute;placer des tableaux de bord vers diff&eacute;rents emplacements de votre bureau. Pour ce faire, cliquez sur un espace libre du tableau de bord en appuyant sur le bouton de milieu de la souris, puis faites glisser le tableau vers un nouvel emplacement.</para>
      <para>Lorsque vous faites glisser un tableau de bord flottant, celui-ci suit le pointeur de la souris. Il ne s'attache pas au bureau. Lorsque vous faites glisser un tableau de bord d'angle, un panneau lat&eacute;ral ou un tableau de bord coulissant, celui-ci s'attache au bord de l'&eacute;cran.</para>
      <note>
        <para>Il est impossible de d&eacute;placer le panneau de menus.</para>
      </note>
    </sect2>
    <sect2 id="gospanel-7">
      <title>Masquage d'un tableau de bord</title>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>masquage</secondary>
      </indexterm>
      <para>Vous pouvez masquer ou afficher tous les tableaux de bord, &agrave; l'exception du tableau de bord Menu. Pour masquer un tableau de bord, ayez recours &agrave; un bouton de masquage. Si les boutons de masquage n'apparaissent pas sur un tableau de bord, modifiez les propri&eacute;t&eacute;s de celui-ci de sorte qu'il les affiche. </para>
      <para>Les boutons de masquage se trouvent de part et d'autre d'un tableau de bord. Ils contiennent une ic&ocirc;ne fl&eacute;ch&eacute;e optionnelle. L'illustration suivante pr&eacute;sente des boutons de masquage. </para>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/four_hide_button.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Tableaux de bord horizontal et vertical, comportant tous les deux des boutons de masquage.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <para>Pour masquer un tableau de bord, cliquez sur l'un des boutons de masquage. Le tableau de bord se trouve r&eacute;duit dans la direction de la fl&egrave;che figurant sur le bouton. Le bouton situ&eacute; &agrave; l'autre extr&eacute;mit&eacute; du tableau de bord reste visible.</para>
      <para>Pour r&eacute;afficher un tableau de bord masqu&eacute;, cliquez sur le bouton de masquage visible. Le tableau de bord s'&eacute;tend dans la direction de la fl&egrave;che figurant sur le bouton. Les deux boutons de masquage sont &agrave; nouveau visibles.</para>
      <para>Il est possible de d&eacute;finir une fonction de masquage automatique pour les tableaux de bord. Dans ce cas, le tableau de bord est automatiquement masqu&eacute; lorsque la souris ne pointe pas sur lui. Il r&eacute;appara&icirc;t d&egrave;s que vous pointez sur la partie de l'&eacute;cran o&ugrave; il r&eacute;side. Pour d&eacute;finir cette fonction, modifiez les propri&eacute;t&eacute;s du tableau de bord.</para>
      <note>
        <para>Dans un tableau de bord d'angle, le comportement des boutons de masquage est l&eacute;g&egrave;rement diff&eacute;rent. Si le tableau de bord se trouve dans l'un des angles de l'&eacute;cran, vous pouvez utiliser les boutons de masquage de la mani&egrave;re suivante :</para>
        <itemizedlist>
          <listitem>
            <para>Pour masquer le tableau de bord, cliquez sur le bouton de masquage le plus proche du bord de l'&eacute;cran, tout &agrave; fait normalement.</para>
          </listitem>
          <listitem>
            <para>Pour d&eacute;placer le tableau de bord vers l'angle oppos&eacute; de l'&eacute;cran, cliquez sur le bouton de masquage le plus &eacute;loign&eacute; du bord de l'&eacute;cran.</para>
          </listitem>
        </itemizedlist>
      </note>
    </sect2>
    <sect2 id="gospanel-28">
      <title>Modification des propri&eacute;t&eacute;s du tableau de bord</title>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>modification des propri&eacute;t&eacute;s</secondary>
      </indexterm>
      <para>Pour modifier les pr&eacute;f&eacute;rences de tous les tableaux de bord, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;es</guisubmenu><guimenuitem>Tableau de bord</guimenuitem></menuchoice>, puis apportez les modifications requises. Par exemple, vous pouvez sp&eacute;cifier diff&eacute;rents param&egrave;tres relatifs &agrave; l'apparence et au comportement des objets de tableau de bord. </para>
      <para>Il est &eacute;galement possible de modifier les propri&eacute;t&eacute;s de chaque tableau de bord. Vous pouvez modifier les caract&eacute;ristiques de chaque tableau de bord, par exemple le type, le comportement de masquage et l'apparence visuelle. </para>
      <note>
        <para>Par contre, les propri&eacute;t&eacute;s du panneau de menus ne peuvent pas &ecirc;tre modifi&eacute;es.</para>
      </note>
      <para>Pour modifier les propri&eacute;t&eacute;s d'un tableau de bord, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur un espace libre du tableau de bord, puis s&eacute;lectionnez <guimenuitem> Propri&eacute;t&eacute;s</guimenuitem> pour afficher la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du tableau de bord</guilabel>. </para>
          <para>La bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du tableau de bord</guilabel> contient les onglets suivants : </para>
          <itemizedlist>
            <listitem>
              <para>
                <guilabel>Tableau de bord <replaceable>type_tableau</replaceable></guilabel>
              </para>
            </listitem>
            <listitem>
              <para>
                <guilabel>Arri&egrave;re-plan</guilabel>
              </para>
            </listitem>
          </itemizedlist>
        </listitem>
        <listitem>
          <para>Pour modifier la taille du tableau de bord, sa position et ses propri&eacute;t&eacute;s de masquage, cliquez sur l'onglet <guilabel>Tableau de bord <replaceable>type_tableau</replaceable></guilabel>. La table suivante d&eacute;crit les &eacute;l&eacute;ments de dialogue de cet onglet : </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="28.57*"/>
              <colspec colname="colspec1" colwidth="71.43*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>&Eacute;l&eacute;ment de la bo&icirc;te de dialogue</para>
                  </entry>
                  <entry valign="top">
                    <para>Description </para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>Position</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>S&eacute;lectionnez la position du tableau de bord sur votre bureau. Pour ce faire, cliquez sur la position requise. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Taille</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>S&eacute;lectionnez la taille du panneau.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Orienter le tableau de bord horizontalement</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Uniquement pour les tableaux de bord flottants. Cette option permet d'afficher le tableau de bord horizontalement. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Orienter le tableau de bord verticalement</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Uniquement pour les tableaux de bord flottants. Cette option permet d'afficher le tableau de bord verticalement.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>D&eacute;calage horizontal</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Uniquement pour les tableaux de bord flottants. Cette zone de s&eacute;lection num&eacute;rique permet de sp&eacute;cifier la distance du tableau de bord par rapport au bord gauche du bureau. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>D&eacute;calage vertical</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Uniquement pour les tableaux de bord flottants. Cette zone de s&eacute;lection num&eacute;rique permet de sp&eacute;cifier la distance du tableau de bord par rapport au bord sup&eacute;rieur du bureau. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>D&eacute;calage du bord de l'&eacute;cran</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Uniquement pour les tableaux de bord coulissants. Cette zone de s&eacute;lection num&eacute;rique permet de sp&eacute;cifier la distance du tableau de bord par rapport au bord du bureau, en pixels. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Masquage automatique</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'activer le masquage automatique. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Affichage des boutons de masquage</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'afficher les boutons de masquage de votre tableau de bord.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Fl&egrave;ches sur le bouton de masquage</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'afficher des fl&egrave;ches sur les boutons de masquage si ceux-ci sont activ&eacute;s.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Pour modifier l'arri&egrave;re-plan du tableau de bord, cliquez sur l'onglet <guilabel>Arri&egrave;re-plan</guilabel>. L'onglet <guilabel>Arri&egrave;re-plan</guilabel> contient les &eacute;l&eacute;ments suivants : </para>
          <informaltable frame="topbot">
            <tgroup cols="3" colsep="0" rowsep="0">
              <colspec colwidth="27.00*"/>
              <colspec colname="colspec5" colwidth="29.14*"/>
              <colspec colname="colspec6" colwidth="42.86*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>&Eacute;l&eacute;ment de la bo&icirc;te de dialogue</para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Description</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Type d'arri&egrave;re-plan</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>S&eacute;lectionnez le type de l'arri&egrave;re-plan du tableau de bord. Les options sont les suivantes :</para>
                    <itemizedlist>
                      <listitem>
                        <para><guilabel>D&eacute;faut</guilabel> :Type d'arri&egrave;re-plan par d&eacute;faut L'arri&egrave;re-plan par d&eacute;faut d&eacute;pend des param&egrave;tres de <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guimenuitem> Th&egrave;me</guimenuitem></menuchoice>. </para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Couleur</guilabel> :Permet de s&eacute;lectionner une couleur pour l'arri&egrave;re-plan du tableau de bord.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Image</guilabel> :Permet de s&eacute;lectionner une image pour l'arri&egrave;re-plan du tableau de bord. </para>
                      </listitem>
                    </itemizedlist>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Couleur d'arri&egrave;re-plan</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Si le<guilabel>Type d'arri&egrave;re-plan</guilabel> est <guilabel>Couleur</guilabel>, cliquez sur le bouton <guibutton> Couleur &agrave; utiliser</guibutton> pour afficher la bo&icirc;te de dialogue de s&eacute;lection de couleur. Choisissez la couleur requise. </para>
                  </entry>
                </row>
                <row>
                  <entry morerows="4" valign="top">
                    <para>
                      <guilabel>Image</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Si le <guilabel> Type d'arri&egrave;re-plan</guilabel> est <guilabel>Image</guilabel>, s&eacute;lectionnez l'image &agrave; utiliser sur l'arri&egrave;re-plan du tableau de bord. Sp&eacute;cifiez les param&egrave;tres suivants pour l'arri&egrave;re-plan de l'image.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Ne pas &eacute;tirer l'image pour l'adapter</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet de cr&eacute;er une mosa&iuml;que de l'image afin de l'adapter &agrave; l'arri&egrave;re-plan du tableau de bord.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>&Eacute;tirer l'image pour l'adapter</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'&eacute;tirer l'image pour l'adapter &agrave; l'arri&egrave;re-plan. Les proportions de l'image sont respect&eacute;es. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>&Eacute;tirer l'image</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'&eacute;tirer l'image pour l'adapter &agrave; l'arri&egrave;re-plan. Les proportions de l'image ne sont pas respect&eacute;es. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Tourne l'image pour les tableaux de bord verticaux</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet de faire pivoter l'image sur un tableau de bord vertical.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
          <para>Vous pouvez &eacute;galement faire glisser une couleur ou une image sur un tableau de bord afin d'en d&eacute;finir l'arri&egrave;re-plan. Pour plus d'informations, consultez <xref linkend="gospanel-61"/>. </para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>Fermer</guibutton> pour fermer la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s de tableau</guilabel>.</para>
        </listitem>
      </orderedlist>
      <sect3 id="gospanel-61">
        <title>Glissement d'une couleur ou d'une image sur l'arri&egrave;re-plan d'un tableau de bord</title>
        <indexterm>
          <primary>tableaux</primary>
          <secondary>modification de l'arri&egrave;re-plan</secondary>
        </indexterm>
        <para>Vous pouvez faire glisser une couleur ou une image vers un tableau de bord pour en d&eacute;finir l'arri&egrave;re-plan. Vous pouvez faire glisser une couleur ou une image depuis de nombreuses applications. Par exemple, vous pouvez faire glisser une couleur depuis le gestionnaire de fichiers <application> Nautilus</application> vers un tableau de bord pour en d&eacute;finir l'arri&egrave;re-plan. Il est &eacute;galement possible de faire glisser une couleur depuis une bo&icirc;te de s&eacute;lection de couleur.</para>
        <para>La m&ecirc;me proc&eacute;dure s'applique aux images. Vous pouvez &eacute;galement faire glisser des images de motif depuis l'application de gestionnaire de fichiers <application>Nautilus </application> pour d&eacute;finir l'arri&egrave;re-plan du tableau de bord. </para>
      </sect3>
    </sect2>
    <sect2 id="gospanel-31">
      <title>Suppression d'un tableau de bord</title>
      <indexterm>
        <primary>tableaux de bord</primary>
        <secondary>suppression</secondary>
      </indexterm>
      <para>Pour supprimer un tableau de bord du bureau, cliquez avec le bouton droit sur le tableau &agrave; supprimer, puis s&eacute;lectionnez <menuchoice><guimenuitem>Supprimer ce tableau de bord</guimenuitem></menuchoice>.</para>
      <note>
        <para>Vous devez toujours conserver au moins un tableau de bord sur votre bureau. S'il n'en reste qu'un, il est impossible de le supprimer.</para>
      </note>
    </sect2>
  </sect1>
  <sect1 id="gospanel-8">
    <title>Objets de tableau de bord</title>
    <indexterm>
      <primary>tableaux de bord</primary>
      <secondary>objets de tableau de bord</secondary>
      <see> objets de tableau de bord</see>
    </indexterm>
    <para>Cette section d&eacute;crit les objets que vous pouvez ajouter &agrave; vos tableaux de bord et utiliser dans ceux-ci.</para>
    <sect2 id="gospanel-100">
      <title>Interaction avec les objets de tableau de bord</title>
      <indexterm>
        <primary>objets de tableau de bord</primary>
        <secondary>interaction avec</secondary>
      </indexterm>
      <para>Les boutons de la souris permettent d'interagir avec les objets d'un tableau de bord de la mani&egrave;re suivante :</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="30.65*"/>
          <colspec colname="colspec1" colwidth="69.35*"/>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Cliquer avec le bouton gauche</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Lance l'objet de tableau de bord.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Cliquer avec le bouton du milieu</para>
              </entry>
              <entry valign="top">
                <para>permet de capturer un objet, puis de le faire glisser jusqu'&agrave; un nouvel emplacement.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Cliquer avec le bouton droit</para>
              </entry>
              <entry valign="top">
                <para>Ouvre le menu contextuel de l'objet de tableau de bord.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Il est possible d'interagir de diff&eacute;rentes mani&egrave;res avec les objets de tableau de bord d'une applet. Pour plus d'informations, consultez <xref linkend="gospanel-39"/>.</para>
    </sect2>
    <sect2 id="gospanel-15">
      <title>Ajout d'un objet &agrave; un tableau de bord</title>
      <indexterm>
        <primary>objets de tableau de bord</primary>
        <secondary>ajout</secondary>
      </indexterm>
      <para>Vous pouvez ajouter un objet &agrave; un tableau de bord en recourant aux m&eacute;thodes suivantes : </para>
      <itemizedlist>
        <listitem>
          <para>Depuis le menu contextuel du tableau de bord :</para>
          <para>Cliquez avec le bouton droit sur un espace libre du tableau de bord afin d'ouvrir le menu contextuel associ&eacute; &agrave; celui-ci. Ce menu contient un sous-menu <guisubmenu>Ajouter au tableau de bord</guisubmenu>. Celui-ci permet d'ajouter les objets suivants &agrave; vos tableaux de bord : <itemizedlist><listitem><para>des applets d'accessoires ;</para></listitem><listitem><para>des applets de divertissement ;</para></listitem><listitem><para>des applets Internet ;</para></listitem><listitem><para>des applets multim&eacute;dia ;</para></listitem><listitem><para>des applets d'utilitaires ;</para></listitem><listitem><para>des lanceurs ;</para></listitem><listitem><para>Lanceurs des menus</para></listitem><listitem><para>le menu GNOME ;</para></listitem><listitem><para>des tiroirs ;</para></listitem><listitem><para>bouton <guibutton>D&eacute;connecter</guibutton> ;</para></listitem><listitem><para>bouton <guibutton>Verrouiller</guibutton>.</para></listitem></itemizedlist></para>
        </listitem>
        <listitem>
          <para>Depuis n'importe quel menu :</para>
          <para>Lorsque vous cliquez avec le bouton droit sur un lanceur quelconque, un menu contextuel s'affiche. Vous pouvez l'utiliser pour ajouter le lanceur &agrave; un tableau de bord. </para>
          <para>Vous pouvez &eacute;galement faire glisser des menus, des lanceurs et des applets depuis les menus vers les tableaux de bord. </para>
        </listitem>
        <listitem>
          <para>Depuis le gestionnaire de fichiers :</para>
          <para>Chaque lanceur et applet correspond &agrave; un fichier <filename>.desktop</filename>. Vous pouvez faire glisser le fichier <filename>.desktop</filename> sur un tableau de bord pour ajouter le lanceur ou l'applet &agrave; celui-ci. </para>
<!--<para><emphasis>Question:</emphasis> Are applets still represented by .desktop files?</para>-->
          <para>Chaque menu correspond &agrave; un r&eacute;pertoire. Il est possible de faire glisser le r&eacute;pertoire sur un tableau de bord afin de l'y ajouter en tant qu'objet de menu.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-9">
      <title>Modification des propri&eacute;t&eacute;s d'un objet</title>
      <indexterm>
        <primary>objets de tableau de bord</primary>
        <secondary>modification des propri&eacute;t&eacute;s</secondary>
      </indexterm>
      <para>A certains objets de tableau de bord sont associ&eacute;es des propri&eacute;t&eacute;s. Les propri&eacute;t&eacute;s sont diff&eacute;rentes pour chaque type d'objet. Elles sp&eacute;cifient des d&eacute;tails, tels que : <itemizedlist><listitem><para>la commande qui d&eacute;marre une application de lancement ;</para></listitem><listitem><para>l'emplacement des fichiers source pour un menu ;</para></listitem><listitem><para>l'ic&ocirc;ne qui repr&eacute;sente l'objet.</para></listitem></itemizedlist></para>
      <para>Pour modifier les propri&eacute;t&eacute;s d'un objet, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <indexterm>
            <primary>illustration du menu contextuel de l'objet de tableau de bord</primary>
          </indexterm>
          <para>Cliquez avec le bouton droit de la souris pour ouvrir le menu contextuel de l'objet de tableau de bord, tel qu'illustr&eacute; dans <xref linkend="gospanel-FIG-54"/>.</para>
          <figure id="gospanel-FIG-54">
            <title>Menu contextuel de l'objet de tableau de bord</title>
            <screenshot>
              <mediaobject>
                <imageobject>
                  <imagedata fileref="figures/panel_object_popup_menu.png" format="PNG"/>
                </imageobject>
                <textobject>
                  <phrase>Menu contextuel Objet de tableau de bord. Éléments de menu :  Propriétés, Aide, Supprimer du tableau de bord, Déplacer.</phrase>
                </textobject>
              </mediaobject>
            </screenshot>
          </figure>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem>. La bo&icirc;te de dialogue <guilabel> Propri&eacute;t&eacute;s</guilabel> permet de modifier les propri&eacute;t&eacute;s de la mani&egrave;re requise. Les propri&eacute;t&eacute;s de la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s</guilabel> d&eacute;pendent de l'objet s&eacute;lectionn&eacute; &agrave; l'&eacute;tape 1. </para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>OK</guibutton> pour appliquer les modifications, puis fermez la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gospanel-32">
      <title>D&eacute;placement d'un objet de tableau de bord</title>
      <indexterm>
        <primary>objets de tableau de bord</primary>
        <secondary>d&eacute;placement</secondary>
      </indexterm>
      <para>Vous pouvez d&eacute;placer les objets au sein d'un m&ecirc;me tableau de bord ou d'un tableau de bord &agrave; l'autre. Il est &eacute;galement possible de d&eacute;placer les objets entre les tableaux de bord et les tiroirs.</para>
      <para>Pour d&eacute;placer un objet de tableau de bord, cliquez sur celui-ci en appuyant sur le bouton du milieu et faites-le glisser vers un nouvel emplacement. Lorsque vous rel&acirc;chez le bouton de la souris, l'objet s'ancre au nouvel emplacement.</para>
      <para>Vous pouvez &eacute;galement utiliser le menu contextuel de l'objet de tableau de bord pour d&eacute;placer l'objet, en proc&eacute;dant comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit, puis s&eacute;lectionnez <guimenuitem>D&eacute;placer</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>Pointez sur le nouvel emplacement de l'objet, puis cliquez sur l'un des boutons de la souris pour l'y ancrer. Cet emplacement peut se trouver sur l'un des tableaux de bord actuellement situ&eacute;s sur votre bureau </para>
        </listitem>
      </orderedlist>
      <para>Le d&eacute;placement d'un objet appartenant &agrave; un tableau de bord affecte la position des autres objets situ&eacute;s sur celui-ci. Pour contr&ocirc;ler les d&eacute;placements des objets sur le tableau de bord, vous pouvez sp&eacute;cifier un mode de d&eacute;placement. Pour ce faire, appuyez sur l'une des touches suivantes lors du d&eacute;placement de l'objet :</para>
      <informaltable frame="topbot">
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec2" colwidth="15.00*"/>
          <colspec colname="colspec1" colwidth="30.00*"/>
          <colspec colname="colspec3" colwidth="54.00*"/>
          <thead>
            <row rowsep="1">
              <entry colname="colspec2" valign="top">
                <para>Touche</para>
              </entry>
              <entry valign="top">
                <para>Mode de d&eacute;placement</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Description</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec2" valign="top">
                <para>Aucune touche</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>D&eacute;placement commut&eacute;</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>L'objet change de place avec d'autres. Ce type de d&eacute;placement est actif par d&eacute;faut.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>Touche <keycap>Alt</keycap></para>
              </entry>
              <entry valign="top">
                <para>D&eacute;placement libre</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>L'objet se positionne &agrave; la premi&egrave;re place libre du tableau de bord.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>Touche <keycap>Maj</keycap></para>
              </entry>
              <entry valign="top">
                <para>D&eacute;placement en pouss&eacute;e</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>L'objet repousse les autres objets sur le tableau de bord. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gospanel-33">
      <title>Suppression d'un objet de tableau de bord</title>
      <indexterm>
        <primary>objets de tableau de bord</primary>
        <secondary>suppression</secondary>
      </indexterm>
      <para>Pour supprimer un objet d'un tableau de bord, cliquez sur l'objet avec le bouton droit pour ouvrir le menu contextuel, puis s&eacute;lectionnez <guimenuitem>Supprimer du tableau de bord</guimenuitem>. </para>
    </sect2>
  </sect1>
  <sect1 id="gospanel-17">
    <title>Applets</title>
    <indexterm>
      <primary>applets</primary>
      <secondary>introduction</secondary>
    </indexterm>
    <indexterm>
      <primary>objets de tableau de bord</primary>
      <secondary>applets</secondary>
      <see>applets</see>
    </indexterm>
    <para>Une applet est une petite application dont l'interface utilisateur r&eacute;side dans un tableau de bord. L'objet Applet permet d'interagir avec l'applet. Par exemple, la figure suivante affiche les applets suivantes, de gauche &agrave; droite : </para>
    <itemizedlist>
      <listitem>
        <para><application>Liste de fen&ecirc;tres</application> :Affiche les fen&ecirc;tres actuellement ouvertes dans votre syst&egrave;me.</para>
      </listitem>
      <listitem>
        <para><application>Lecteur CD</application> :permet de contr&ocirc;ler le lecteur CD de votre syst&egrave;me.</para>
      </listitem>
      <listitem>
        <para><application>Contr&ocirc;leur de volume</application> :permet de contr&ocirc;ler le volume du haut-parleur de votre syst&egrave;me.</para>
      </listitem>
    </itemizedlist>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/sample_applet.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Exemples d'applets. Le contexte décrit le graphique.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <sect2 id="gospanel-40">
      <title>Ajout d'une applet &agrave; un tableau de bord</title>
      <indexterm>
        <primary>applets</primary>
        <secondary>ajout &agrave; un tableau de bord</secondary>
      </indexterm>
      <para>Vous pouvez ajouter une applet &agrave; un tableau de bord depuis le menu contextuel de celui-ci. Cliquez avec le bouton droit sur un espace libre du tableau de bord afin d'ouvrir le menu contextuel associ&eacute; &agrave; celui-ci. S&eacute;lectionnez <guimenu>Ajouter au tableau de bord</guimenu>, puis choisissez l'applet &agrave; ajouter dans l'un des sous-menus suivants :</para>
      <itemizedlist>
        <listitem>
          <para><guimenu>Accessoires</guimenu> ;</para>
        </listitem>
        <listitem>
          <para><guimenu>Divertissement</guimenu> ;</para>
        </listitem>
        <listitem>
          <para><guimenu>Internet</guimenu> ;</para>
        </listitem>
        <listitem>
          <para><guimenu>Multim&eacute;dia</guimenu> ;</para>
        </listitem>
        <listitem>
          <para><guimenu>Utilitaires</guimenu>.</para>
        </listitem>
      </itemizedlist>
      <para>Vous pouvez &eacute;galement faire glisser l'applet du sous-menu sur le tableau de bord. </para>
    </sect2>
    <sect2 id="gospanel-39">
      <title>S&eacute;lection d'une applet</title>
      <indexterm>
        <primary>applets</primary>
        <secondary>s&eacute;lection</secondary>
      </indexterm>
      <para>Pour modifier les propri&eacute;t&eacute;s d'une applet, cliquez avec le bouton droit sur l'applet pour afficher le menu contextuel qui lui est associ&eacute;. Pour d&eacute;placer une applet, cliquez avec le bouton du milieu sur celle-ci. </para>
      <para>Certaines restrictions s'appliquent quant &agrave; l'endroit de l'applet sur lequel vous pouvez cliquer pour faire appara&icirc;tre son menu contextuel ou la d&eacute;placer : </para>
      <itemizedlist>
        <listitem>
          <para>Certaines applets poss&egrave;dent des menus contextuels contenant des commandes sp&eacute;cifiques qui s'ouvrent lorsque vous cliquez avec le bouton droit sur certaines parties de l'applet. Par exemple, l'applet <application>Liste de fen&ecirc;tres</application> poss&egrave;de une poign&eacute;e verticale &agrave; gauche et des boutons repr&eacute;sentant vos fen&ecirc;tres &agrave; droite. Pour ouvrir le menu contextuel de l'applet <application>Liste de fen&ecirc;tres</application>, vous devez cliquer avec le bouton droit sur la poign&eacute;e. Si vous cliquez avec le bouton droit sur l'un des boutons, un menu contextuel s'ouvre.</para>
        </listitem>
        <listitem>
          <para>Certaines applets comportent des zones qui ne peuvent pas &ecirc;tre utilis&eacute;es pour les s&eacute;lectionner. Par exemple, l'applet <application>Ligne de commande</application> poss&egrave;de une zone permettant d'entrer des commandes. Il est impossible de cliquer avec le bouton droit ou avec le bouton du milieu pour s&eacute;lectionner l'applet. Choisissez une autre partie de l'applet. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-41">
      <title>Modification des pr&eacute;f&eacute;rences d'une applet</title>
      <indexterm>
        <primary>applets</primary>
        <secondary>modification des pr&eacute;f&eacute;rences</secondary>
      </indexterm>
      <para>Pour modifier les pr&eacute;f&eacute;rences d'une applet, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur l'applet, puis s&eacute;lectionnez <guimenuitem>Pr&eacute;f&eacute;rences</guimenuitem>. Utilisez la bo&icirc;te de dialogue <guilabel>Pr&eacute;f&eacute;rences</guilabel> pour apporter les modifications requises aux pr&eacute;f&eacute;rences. Les pr&eacute;f&eacute;rences relatives aux applets varient de l'une &agrave; l'autre.</para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>Fermer</guibutton> pour fermer la bo&icirc;te de dialogue <guilabel> Pr&eacute;f&eacute;rences</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-16">
    <title>Lanceurs</title>
    <indexterm>
      <primary>objets du tableau de bord</primary>
      <secondary>lanceurs</secondary>
      <see>lanceurs</see>
    </indexterm>
    <para>Lorsque vous cliquez sur un lanceur, vous initiez l'une des actions suivantes : </para>
    <itemizedlist>
      <listitem>
        <para>d&eacute;marrer une application donn&eacute;e ;</para>
      </listitem>
      <listitem>
        <para>ex&eacute;cuter une commande ;</para>
      </listitem>
      <listitem>
        <para>ouvrir un dossier dans une fen&ecirc;tre du gestionnaire de fichiers ;</para>
      </listitem>
      <listitem>
        <para>ouvrir un navigateur &agrave; une <firstterm>URL</firstterm> (Uniform Resource Locator) donn&eacute;e. Une URL repr&eacute;sente l'adresse d'un emplacement donn&eacute; sur le Web.</para>
      </listitem>
    </itemizedlist>
    <para>Vous pouvez trouver des lanceurs aux emplacements suivants du bureau :</para>
    <itemizedlist>
      <listitem>
        <para>Tableaux de bord :Ils y sont repr&eacute;sent&eacute;s par des ic&ocirc;nes.</para>
      </listitem>
      <listitem>
        <para>Menus :Ils y sont repr&eacute;sent&eacute;s par des &eacute;l&eacute;ments de menu. Les &eacute;l&eacute;ments de menu poss&egrave;dent g&eacute;n&eacute;ralement une ic&ocirc;ne.</para>
      </listitem>
      <listitem>
        <para>Arri&egrave;re-plan du bureau :Les lanceurs y sont repr&eacute;sent&eacute;s par des ic&ocirc;nes.</para>
      </listitem>
    </itemizedlist>
    <para>Vous pouvez modifier les propri&eacute;t&eacute;s d'un lanceur. Les propri&eacute;t&eacute;s d'un lanceur englobent notamment son nom, l'ic&ocirc;ne qui lui est associ&eacute;e et son fonctionnement. </para>
    <sect2 id="gospanel-34">
      <title>Ajout d'un lanceur &agrave; un tableau de bord</title>
      <indexterm>
        <primary>lanceurs</primary>
        <secondary>ajout &agrave; un tableau de bord</secondary>
      </indexterm>
      <para>Vous pouvez ajouter un lanceur &agrave; un tableau de bord en recourant &agrave; l'une des m&eacute;thodes suivantes :</para>
      <itemizedlist>
        <listitem>
          <para>Depuis le menu contextuel du tableau de bord :</para>
          <para>Pour cr&eacute;er un nouveau lanceur, cliquez avec le bouton droit sur un espace libre du tableau de bord, puis s&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem> Lanceur</guimenuitem></menuchoice>. Une bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel> s'affiche. Pour plus d'informations concernant les zones de cette bo&icirc;te de dialogue, consultez <xref linkend="gospanel-52"/>.</para>
          <para>Vous pouvez &eacute;galement ajouter un lanceur existant au tableau de bord en s&eacute;lectionnant <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Lanceur depuis le menu</guimenuitem></menuchoice> dans le menu contextuel. Choisissez le lanceur &agrave; ajouter dans le menu.</para>
        </listitem>
        <listitem>
          <para>Depuis n'importe quel menu :</para>
          <para>Pour ajouter un lanceur &agrave; un tableau de bord, proc&eacute;dez comme suit :<itemizedlist><listitem><para>Ouvrez le menu contenant le lanceur dans le tableau de bord o&ugrave; celui-ci doit r&eacute;sider. Cliquez avec le bouton droit sur le titre du lanceur. S&eacute;lectionnez <guimenuitem>Ajouter ce lanceur au tableau de bord</guimenuitem>. </para></listitem><listitem><para>Ouvrez un menu contenant le lanceur. Faites-le glisser sur le tableau de bord. </para></listitem></itemizedlist></para>
        </listitem>
        <listitem>
          <para>Depuis le gestionnaire de fichiers :</para>
          <para>Pour ajouter un lanceur &agrave; un tableau de bord depuis le gestionnaire de fichiers, recherchez le fichier <filename> .desktop</filename> du lanceur dans le syst&egrave;me de fichiers. Pour ajouter le lanceur, faites glisser le fichier <filename>.desktop</filename> vers le tableau de bord. </para>
        </listitem>
      </itemizedlist>
      <sect3 id="gospanel-52">
        <title>Cr&eacute;ation d'un lanceur &agrave; l'aide de la bo&icirc;te de dialogue Cr&eacute;er un lanceur</title>
        <para>Pour cr&eacute;er un lanceur &agrave; l'aide de la bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel> , proc&eacute;dez comme suit : </para>
        <orderedlist>
          <listitem>
            <para>Cliquez avec le bouton droit sur le tableau de bord afin d'ouvrir le menu contextuel correspondant. S&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem> Lanceur</guimenuitem></menuchoice> pour afficher la bo&icirc;te de dialogue <guilabel>Cr&eacute;er un lanceur</guilabel>. La bo&icirc;te de dialogue affiche l'onglet <guilabel>Basique</guilabel>.</para>
          </listitem>
          <listitem>
            <para>Entrez les propri&eacute;t&eacute;s du lanceur dans la bo&icirc;te de dialogue. La table suivante d&eacute;crit les &eacute;l&eacute;ments de dialogue de l'onglet <guilabel>Basique</guilabel> : </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colname="colspec0" colwidth="26.19*"/>
                <colspec colname="colspec1" colwidth="73.81*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>&Eacute;l&eacute;ment de la bo&icirc;te de dialogue</para>
                    </entry>
                    <entry valign="top">
                      <para>Description </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Nom</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Cette zone de texte permet de sp&eacute;cifier le nom du lanceur. L'onglet <guilabel>Avanc&eacute;</guilabel> permet d'ajouter des traductions du nom. Il s'agit du nom qui appara&icirc;t lorsque vous ajoutez le lanceur &agrave; un menu ou &agrave; l'arri&egrave;re-plan du bureau. </para>
                    </entry>
                  </row>
                  <row>
                    <entry colname="colspec0">
                      <para>
                        <guilabel>Nom g&eacute;n&eacute;rique</guilabel>
                      </para>
                    </entry>
                    <entry colname="colspec1">
                      <para>Cette zone de texte permet de sp&eacute;cifier la classe d'application &agrave; laquelle appartient le lanceur. Par exemple, vous pouvez entrer <userinput> Text Editor</userinput> dans cette zone de texte pour un lanceur <application>gedit</application>. Vous pouvez utiliser l'onglet <guilabel>Avanc&eacute;</guilabel> pour ajouter des traductions du nom g&eacute;n&eacute;rique.</para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Commentaire</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Cette zone de texte permet de sp&eacute;cifier une br&egrave;ve description du lanceur. Le commentaire s'affiche sous la forme d'une infobulle lorsque vous pointez sur l'ic&ocirc;ne du lanceur situ&eacute;e sur le tableau de bord. L'onglet <guilabel>Avanc&eacute;</guilabel> permet d'ajouter des traductions du commentaire. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Commande</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Cette zone permet de sp&eacute;cifier une commande &agrave; ex&eacute;cuter lorsque vous cliquez sur le lanceur. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Type</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Cette zone de liste d&eacute;roulante modifiable permet de sp&eacute;cifier le type du lanceur. S&eacute;lectionnez l'une des options suivantes : </para>
                      <itemizedlist>
                        <listitem>
                          <para><guilabel>Application</guilabel> :Cette option permet de cr&eacute;er un lanceur qui d&eacute;marre une application.</para>
                        </listitem>
                        <listitem>
                          <para><guilabel>Lien</guilabel> :S&eacute;lectionnez cette option pour cr&eacute;er un lanceur qui &eacute;tablit un lien vers un fichier, un dossier ou un site FTP.</para>
                        </listitem>
                      </itemizedlist>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para><guilabel>Ic&ocirc;ne</guilabel> :</para>
                    </entry>
                    <entry valign="top">
                      <para>S&eacute;lectionnez une ic&ocirc;ne pour repr&eacute;senter le lanceur. Pour choisir une ic&ocirc;ne, cliquez sur le bouton <guibutton>Aucune ic&ocirc;ne</guibutton>. Une bo&icirc;te de dialogue de s&eacute;lection d'ic&ocirc;ne s'affiche. Choisissez une ic&ocirc;ne. Vous pouvez &eacute;galement choisir une ic&ocirc;ne dans un autre r&eacute;pertoire en cliquant sur le bouton <guibutton>Parcourir</guibutton>. Lorsque vous s&eacute;lectionnez une ic&ocirc;ne, cliquez sur <guibutton>OK</guibutton>. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Ex&eacute;cuter dans un Terminal</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Cette option permet d'ex&eacute;cuter l'application ou la commande dans une fen&ecirc;tre de terminal. Choisissez cette option pour une application ou une commande qui ne cr&eacute;e pas de fen&ecirc;tre dans laquelle s'ex&eacute;cuter.</para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
          </listitem>
          <listitem>
            <para>Pour d&eacute;finir les propri&eacute;t&eacute;s avanc&eacute;es du lanceur, cliquez sur l'onglet <guilabel> Avanc&eacute;</guilabel>. La bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du lanceur</guilabel> affiche l'onglet <guilabel>Avanc&eacute;</guilabel>.</para>
          </listitem>
          <listitem>
            <para>Entrez les propri&eacute;t&eacute;s avanc&eacute;es du lanceur dans la bo&icirc;te de dialogue. La table suivante d&eacute;crit les &eacute;l&eacute;ments de dialogue situ&eacute;s dans la partie sup&eacute;rieure de l'onglet <guilabel> Avanc&eacute;</guilabel> : </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colwidth="32.03*"/>
                <colspec colwidth="67.97*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>&Eacute;l&eacute;ment de la bo&icirc;te de dialogue</para>
                    </entry>
                    <entry valign="top">
                      <para>Description </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Essayer cela avant d'utiliser</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Entrez une commande ici afin d'effectuer un contr&ocirc;le avant de d&eacute;marrer le lanceur. Si la commande est ex&eacute;cutable et se trouve dans le chemin ad hoc, le lanceur appara&icirc;t sur le tableau de bord.</para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Documentation</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Saisissez le chemin du fichier d'aide du lanceur. Si vous saisissez un chemin dans ce champ, un &eacute;l&eacute;ment de menu <guimenuitem>Aide de l'application <replaceable>nom_lanceur</replaceable></guimenuitem> s'affiche dans le menu contexuel du lanceur.</para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
          </listitem>
          <listitem>
            <para>Vous pouvez &eacute;galement ajouter une traduction des zones <guilabel>Nom</guilabel>, <guilabel>Nom g&eacute;n&eacute;rique</guilabel> et  <guilabel>Commentaire</guilabel> de l'onglet <guilabel> Basique</guilabel>. Pour ajouter une traduction, entrez les d&eacute;tails de celle-ci dans la table <guilabel>Traductions du nom ou du commentaire</guilabel> en proc&eacute;dant comme suit : </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colname="colspec0" colwidth="20.78*"/>
                <colspec colname="colspec1" colwidth="79.22*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>Zone</para>
                    </entry>
                    <entry valign="top">
                      <para>Description </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>Premi&egrave;re zone</para>
                    </entry>
                    <entry valign="top">
                      <para>Entrez un code de deux lettres repr&eacute;sentant la langue pour laquelle vous souhaitez ajouter une traduction. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>Deuxi&egrave;me zone</para>
                    </entry>
                    <entry valign="top">
                      <para>Entrez la traduction du <guilabel>nom</guilabel> du lanceur.</para>
                    </entry>
                  </row>
                  <row>
                    <entry colname="colspec0">
                      <para>Troisi&egrave;me zone</para>
                    </entry>
                    <entry colname="colspec1">
                      <para>Entrez la traduction du <guilabel>nom g&eacute;n&eacute;rique</guilabel> du lanceur. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>Quatri&egrave;me zone</para>
                    </entry>
                    <entry valign="top">
                      <para>Entrez la traduction du <guilabel>commentaire</guilabel> relatif au lanceur. </para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
            <para>Ensuite, cliquez sur le bouton <guibutton>Ajouter/Modifier</guibutton>. </para>
            <para>Pour &eacute;diter une traduction, s&eacute;lectionnez-la. Le texte traduit appara&icirc;t dans la partie inf&eacute;rieure de la bo&icirc;te de dialogue. &Eacute;ditez les zones de la mani&egrave;re requise, puis cliquez sur le bouton <guibutton>Ajouter/Modifier</guibutton>.</para>
            <para>Pour supprimer une traduction, s&eacute;lectionnez-la, puis cliquez sur le bouton <guibutton>Supprimer</guibutton>.</para>
          </listitem>
          <listitem>
            <para>Pour cr&eacute;er le lanceur et fermer la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du lanceur</guilabel>, cliquez sur <guibutton>OK</guibutton>.</para>
          </listitem>
        </orderedlist>
      </sect3>
    </sect2>
    <sect2 id="gospanel-36">
      <title>Modification des propri&eacute;t&eacute;s d'un lanceur</title>
      <indexterm>
        <primary>lanceurs</primary>
        <secondary>modification des propri&eacute;t&eacute;s</secondary>
      </indexterm>
      <para>Pour modifier les propri&eacute;t&eacute;s d'un lanceur, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur le lanceur pour ouvrir son menu contextuel.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem>. La bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du lanceur</guilabel> permet de modifier les propri&eacute;t&eacute;s de la mani&egrave;re requise. Pour plus d'informations sur cette bo&icirc;te de dialogue, consultez <xref linkend="gospanel-52"/>. </para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>Fermer</guibutton> pour fermer la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du lanceur</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-37">
    <title>Menus</title>
    <indexterm>
      <primary>menus</primary>
      <secondary>ajout au tableau de bord</secondary>
    </indexterm>
    <indexterm>
      <primary>objets de tableau de bord</primary>
      <secondary>menus</secondary>
    </indexterm>
    <para>Vous pouvez ajouter les types suivants de menus &agrave; vos tableaux de bord : </para>
    <itemizedlist>
      <listitem>
        <para>Menus syst&egrave;me :Les menus syst&egrave;me contiennent les applications et outils standard disponibles sur votre bureau. Les menus <guimenu>Applications</guimenu> et  <guimenu>Actions</guimenu> sont des menus syst&egrave;me. Pour ajouter un menu syst&egrave;me &agrave; un tableau de bord, cliquez avec le bouton droit sur un lanceur du menu, puis s&eacute;lectionnez <menuchoice><guimenu>Tout le menu</guimenu><guimenuitem>Ajouter ceci comme menu au tableau de bord</guimenuitem></menuchoice>. </para>
      </listitem>
      <listitem>
        <para><guimenu>Menu GNOME</guimenu> :Vous pouvez acc&eacute;der &agrave; la plupart des applications, commandes et options de configuration standard depuis le <guimenu> GNOME Menu</guimenu>. Pour ajouter le <guimenu>GNOME Menu</guimenu> &agrave; un tableau de bord, cliquez avec le bouton droit sur un espace libre dans celui-ci, puis s&eacute;lectionnez  <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Menu GNOME</guimenuitem></menuchoice>. Vous pouvez ajouter un nombre illimit&eacute; d'objets du <guimenu>menu GNOME</guimenu> &agrave; vos tableaux de bord. Par d&eacute;faut, le <guimenu>menu GNOME</guimenu> est repr&eacute;sent&eacute; par une ic&ocirc;ne d'empreinte stylis&eacute;e telle que celle-ci :</para>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Icône du menu GNOME.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </listitem>
    </itemizedlist>
    <para>Les menus ajout&eacute;s aux tableaux de bord sont repr&eacute;sent&eacute;s par une ic&ocirc;ne contenant une fl&egrave;che. Celle-ci indique que l'ic&ocirc;ne repr&eacute;sente un menu ou un tiroir. <xref linkend="gospanel-FIG-68"/> montre l'apparence par d&eacute;faut des menus sur les tableaux de bord. </para>
    <figure id="gospanel-FIG-68">
      <title>Objets de menu par d&eacute;faut sur un tableau de bord</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/typical_menu.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Objets de menu typiques sur un tableau de bord.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
  </sect1>
  <sect1 id="gospanel-18">
    <title>Tiroirs</title>
    <indexterm>
      <primary>objets de tableau de commande</primary>
      <secondary>tiroirs</secondary>
      <see>tiroirs</see>
    </indexterm>
    <para>Un tiroir constitue une extension d'un tableau de bord. Vous pouvez ouvrir et fermer les tiroirs exactement de la m&ecirc;me mani&egrave;re que vous affichez ou masquer un tableau de bord. Un tiroir peut contenir tous les objets de tableau de bord, y compris les lanceurs, les menus, les applets, d'autres objets de tableau de bord et d'autres tiroirs. Une fois un tiroir ouvert, il est possible d'utiliser les objets qu'il contient de la m&ecirc;me mani&egrave;re que les objets situ&eacute;s sur un tableau de bord. </para>
    <para>La figure suivante montre un tiroir ouvert contenant deux objets de tableau de bord. </para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/open_drawer.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Tiroir ouvert. Le contexte décrit le graphique.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>La fl&egrave;che situ&eacute;e sur l'ic&ocirc;ne du tiroir indique que celle-ci repr&eacute;sente un tiroir ou un menu.</para>
    <para>Vous pouvez ajouter, d&eacute;placer et supprimer des objets des tiroirs, comme vous le feriez s'il s'agissait d'un tableau de bord. </para>
    <sect2 id="gospanel-42">
      <title>Ouverture et fermeture d'un tiroir</title>
      <indexterm>
        <primary>tiroirs</primary>
        <secondary>ouverture</secondary>
      </indexterm>
      <indexterm>
        <primary>tiroirs</primary>
        <secondary>fermeture</secondary>
      </indexterm>
      <para>Pour ouvrir un tiroir, cliquez sur l'objet tiroir dans le tableau de bord. Vous pouvez fermer le tiroir en recourant &agrave; l'une des m&eacute;thodes suivantes : </para>
      <itemizedlist>
        <listitem>
          <para>cliquer sur le tiroir ;</para>
        </listitem>
        <listitem>
          <para>cliquer sur le bouton de masquage du tiroir.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-420">
      <title>Ajout d'un tiroir &agrave; un tableau de bord</title>
      <indexterm>
        <primary>tiroirs</primary>
        <secondary>ajout &agrave; un tableau de bord</secondary>
      </indexterm>
      <para>Vous pouvez ajouter un tiroir &agrave; un tableau de bord en recourant &agrave; l'une des m&eacute;thodes suivantes : </para>
      <itemizedlist>
        <listitem>
          <para>Depuis le menu contextuel du tableau de bord :</para>
          <para>Cliquez avec le bouton droit sur un espace libre du tableau de bord, puis s&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Tiroir</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>Depuis n'importe quel menu :</para>
          <para>Vous pouvez ajouter un menu &agrave; un tableau de bord sous la forme d'un objet tiroir.</para>
          <para>Pour ce faire, ouvrez le menu dans le tableau de bord. Cliquez avec le bouton droit sur un lanceur du menu, puis s&eacute;lectionnez <menuchoice><guimenu>Tout le menu</guimenu><guimenuitem>Ajouter ceci comme tiroir au tableau de bord</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-54">
      <title>Ajout d'un objet &agrave; un tiroir</title>
      <indexterm>
        <primary>tiroirs</primary>
        <secondary>ajout d'objets &agrave;</secondary>
      </indexterm>
      <para>La proc&eacute;dure est identique &agrave; celle permettant d'ajouter un objet &agrave; un tableau de bord. Pour plus d'informations, consultez <xref linkend="gospanel-15"/>. </para>
    </sect2>
    <sect2 id="gospanel-550">
      <title>Modification des propri&eacute;t&eacute;s du tiroir</title>
      <indexterm>
        <primary>tiroirs</primary>
        <secondary>modification des propri&eacute;t&eacute;s</secondary>
      </indexterm>
      <para>Pour modifier les pr&eacute;f&eacute;rences de tous les tableaux de bord et tiroirs, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;es</guisubmenu><guimenuitem>Tableau de bord</guimenuitem></menuchoice>, puis apportez les modifications requises. Par exemple, vous pouvez s&eacute;lectionner diff&eacute;rentes options associ&eacute;es &agrave; l'apparence et au comportement des objets situ&eacute;s sur les tableaux de bord et dans les tiroirs. Il est &eacute;galement possible de s&eacute;lectionner des options associ&eacute;es aux tiroirs uniquement. Par exemple, vous pouvez s&eacute;lectionner une option vous permettant de fermer un tiroir en cliquant sur un lanceur situ&eacute; dans l'un d'entre eux.</para>
      <para>Vous pouvez &eacute;galement modifier les autres propri&eacute;t&eacute;s de chaque tiroir, et, par exemple, personnaliser les caract&eacute;ristiques telles que l'apparence visuelle du tiroir ou la pr&eacute;sence de boutons de masquage.</para>
      <para>Pour ce faire, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur le tiroir, puis s&eacute;lectionnez <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem> pour afficher la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s du tableau de bord</guilabel>. La bo&icirc;te de dialogue affiche l'onglet <guilabel>Tiroir</guilabel>.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez les propri&eacute;t&eacute;s relatives au tiroir dans la bo&icirc;te de dialogue. La table suivante d&eacute;crit les &eacute;l&eacute;ments de l'onglet <guilabel>Tiroir</guilabel> : </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec2" colwidth="29.44*"/>
              <colspec colname="colspec3" colwidth="70.56*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>&Eacute;l&eacute;ment de la bo&icirc;te de dialogue</para>
                  </entry>
                  <entry valign="top">
                    <para>Description </para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Taille</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>S&eacute;lectionnez la taille du tiroir. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Bulle d'aide/Nom</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette zone de texte permet de sp&eacute;cifier un nom pour le tiroir. Ce nom appara&icirc;t sous la forme d'une bulle d'aide lorsque vous pointez sur le tiroir dans un tableau de bord.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para><guilabel>Ic&ocirc;ne</guilabel> :</para>
                  </entry>
                  <entry valign="top">
                    <para>S&eacute;lectionnez une ic&ocirc;ne repr&eacute;sentant le tiroir. Cliquez sur le bouton <guibutton>Ic&ocirc;ne</guibutton> pour afficher une bo&icirc;te de dialogue de s&eacute;lection d'ic&ocirc;ne. Choisissez une ic&ocirc;ne. Vous pouvez &eacute;galement cliquer sur <guibutton>Parcourir</guibutton> pour choisir une ic&ocirc;ne dans un autre r&eacute;pertoire. Lorsque vous s&eacute;lectionnez une ic&ocirc;ne, cliquez sur <guibutton> OK</guibutton>. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Activer le bouton de masquage</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'afficher un bouton de masquage lors de l'ouverture du tiroir. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Activer la fl&egrave;che du bouton de masquage</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet d'afficher une fl&egrave;che sur le bouton de masquage si celui-ci est activ&eacute;.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Vous pouvez utiliser l'onglet <guilabel>Arri&egrave;re-plan</guilabel> pour d&eacute;finir l'arri&egrave;re-plan du tiroir. Pour plus d'informations sur la mani&egrave;re de renseigner l'onglet <guilabel>Arri&egrave;re-plan</guilabel>, consultez l'&eacute;tape <xref linkend="gospanel-28"/> de cette rubrique. Vous pouvez &eacute;galement faire glisser une couleur ou une image sur un tiroir afin de la d&eacute;finir en tant qu'arri&egrave;re-plan du tiroir. Pour plus d'informations, consultez <xref linkend="gospanel-61"/>.</para>
        </listitem>
        <listitem>
          <para>Cliquez sur <guibutton>Fermer</guibutton> pour fermer la bo&icirc;te de dialogue <guilabel>Propri&eacute;t&eacute;s de tableau</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-20">
    <title>Bouton D&eacute;connecter</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/logout_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icône Déconnexion.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>objets de tableau de bord</primary>
      <secondary>bouton D&eacute;connecter</secondary>
    </indexterm>
    <indexterm>
      <primary>bouton D&eacute;connecter</primary>
    </indexterm>
    <para>Le bouton <guibutton>D&eacute;connecter</guibutton> amorce le processus de d&eacute;connexion d'une session GNOME. </para>
    <para>Pour ajouter un bouton <guibutton>D&eacute;connecter</guibutton> &agrave; un tableau de bord, cliquez avec le bouton droit sur un espace libre du tableau de bord. S&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Bouton D&eacute;connecter</guimenuitem></menuchoice>. Pour vous d&eacute;connecter ou fermer le syst&egrave;me, cliquez sur le bouton <guibutton>D&eacute;connecter</guibutton>. </para>
  </sect1>
  <sect1 id="gospanel-21">
    <title>Bouton Verrouiller</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/lockscreen_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>L'image montre une icône de verrouillage représentant la fonction de verrouillage de l'écran.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>objets de tableau de bord</primary>
      <secondary>bouton Verrouiller</secondary>
    </indexterm>
    <indexterm>
      <primary>bouton Verrouiller</primary>
    </indexterm>
    <indexterm>
      <primary>verrouillage de l'&eacute;cran</primary>
    </indexterm>
    <para>Le bouton <guibutton>Verrouiller</guibutton> verrouille l'&eacute;cran et active l'&eacute;conomiseur d'&eacute;cran. Pour retourner &agrave; la session, vous devez entrer votre mot de passe. Il est n&eacute;cessaire qu'un &eacute;conomiseur d'&eacute;cran soit actif pour verrouiller l'&eacute;cran correctement. </para>
    <para>Pour ajouter un bouton <guibutton>Verrouiller</guibutton> &agrave; un tableau de bord, cliquez avec le bouton droit sur un espace libre du tableau de bord. S&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem>Bouton Verrouiller</guimenuitem></menuchoice>. </para>
    <para>Cliquez avec le bouton droit sur le bouton <guibutton>Verrouiller</guibutton> pour ouvrir un menu contenant des commandes relatives &agrave; l'&eacute;conomiseur d'&eacute;cran. <xref linkend="gosstartsession-TBL-83"/> d&eacute;crit les commandes disponibles dans ce menu.</para>
    <table frame="topbot" id="gosstartsession-TBL-83">
      <title>&Eacute;l&eacute;ments de menu du verrouillage de l'&eacute;cran</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="43.55*"/>
        <colspec colname="colspec1" colwidth="56.45*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Option de menu</para>
            </entry>
            <entry valign="top">
              <para> Fonction</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Activer l'&eacute;conomiseur d'&eacute;cran</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Active l'&eacute;conomiseur d'&eacute;cran imm&eacute;diatement, mais ne verrouille pas l'&eacute;cran.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Verrouiller l'&eacute;cran</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Verrouille l'&eacute;cran imm&eacute;diatement. Cette commande poss&egrave;de la m&ecirc;me fonction que le bouton <guibutton>Verrouiller</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Tuer le d&eacute;mon de l'&eacute;conomiseur d'&eacute;cran</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Met un terme au processus de l'&eacute;conomiseur d'&eacute;cran. Une fois cette option s&eacute;lectionn&eacute;e, vous ne pouvez plus verrouiller l'&eacute;cran.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Relancer le d&eacute;mon de l'&eacute;conomiseur d'&eacute;cran</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Ferme et red&eacute;marre le processus de l'&eacute;conomiseur d'&eacute;cran. Utilisez cette commande apr&egrave;s avoir modifi&eacute; votre mot de passe. Au red&eacute;marrage, utilisez votre nouveau mot de passe.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Affiche une bo&icirc;te de dialogue <guilabel>XScreenSaver</guilabel> vous permettant de configurer l'&eacute;conomiseur d'&eacute;cran. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
</chapter>
