<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosgetstarted-1">
  <title>Sessions du bureau</title>
  <highlights>
    <para>Ce  chapitre propose les informations n&eacute;cessaires au d&eacute;marrage, &agrave; la gestion et &agrave; la fermeture d'une session du bureau.</para>
  </highlights>
  <sect1 id="gosgetstarted-69">
    <title>D&eacute;marrage d'une session</title>
    <indexterm>
      <primary>sessions</primary>
      <secondary>d&eacute;marrage</secondary>
    </indexterm>
    <para>On appelle session du bureau la p&eacute;riode entre la connexion au bureau et la d&eacute;connexion de celui-ci. L'&eacute;cran de connexion, affich&eacute; par le <application>Gestionnaire de connexion</application>, permet d'acc&eacute;der au bureau. Il propose des champs vous permettant d'entrer votre nom d'utilisateur et votre mot de passe. Le menu <guimenu>Options</guimenu> de cet &eacute;cran contient les options de connexion. Il vous permet, par exemple, de s&eacute;lectionner la langue de votre session. </para>
    <para>Une session s'ouvre au moment o&ugrave; vous vous connectez. Le gestionnaire de session d&eacute;marre une fois le nom d'utilisateur et le mot de passe authentifi&eacute;s par le <application>Gestionnaire de connexion</application>. Il vous permet de g&eacute;rer la session. Par exemple, il vous permet d'enregistrer l'&eacute;tat de la derni&egrave;re session pour pouvoir retourner &agrave; la session &agrave; la connexion suivante. Le gestionnaire de session enregistre et restaure les param&egrave;tres suivants : </para>
    <itemizedlist>
      <listitem>
        <para>les param&egrave;tres relatifs &agrave; l'apparence et au comportement, tels que les polices, les couleurs et les param&egrave;tres de la souris ; </para>
      </listitem>
      <listitem>
        <para>les applications en cours d'ex&eacute;cution, par exemple les fen&ecirc;tres du gestionnaire de fichiers et de l'&eacute;diteur de texte. Il est impossible d'enregistrer et de restaurer des applications non prises en charge par le gestionnaire de session. Par exemple, si vous d&eacute;marrez l'&eacute;diteur <application> vi</application> &agrave; partir de la ligne de commande d'une fen&ecirc;tre de terminal, le gestionnaire de session est incapable de restaurer votre session d'&eacute;dition. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosgetstarted-65">
      <title>Connexion &agrave; une session du bureau</title>
      <indexterm>
        <primary>sessions</primary>
        <secondary>connexion</secondary>
      </indexterm>
      <indexterm>
        <primary>connexion</primary>
      </indexterm>
      <para>Pour vous connecter &agrave; une session, proc&eacute;dez comme suit :</para>
      <orderedlist>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Options</guimenu><guimenuitem> Session</guimenuitem></menuchoice>. S&eacute;lectionnez le bureau GNOME dans la liste des environnements de bureau disponibles.</para>
        </listitem>
        <listitem>
          <para>Entrez votre nom d'utilisateur dans le champ correspondant de la bo&icirc;te de dialogue <guilabel>Gestionnaire de connexion</guilabel>, puis cliquez sur <guibutton>OK</guibutton>. </para>
        </listitem>
        <listitem>
          <para>Proc&eacute;dez de la m&ecirc;me mani&egrave;re pour votre mot de passe. </para>
        </listitem>
      </orderedlist>
      <para>Une fois la connexion &eacute;tablie, le gestionnaire de session d&eacute;marre une session. Si vous vous connectez pour la premi&egrave;re fois, le gestionnaire de session d&eacute;marre une nouvelle session. Dans le cas contraire, il restaure la session pr&eacute;c&eacute;dente.</para>
    </sect2>
    <sect2 id="gosgetstarted-66">
      <title>D&eacute;marrage d'une session dans une autre langue</title>
      <indexterm>
        <primary>sessions</primary>
        <secondary>autre langue, d&eacute;marrage dans</secondary>
      </indexterm>
      <indexterm>
        <primary>langue, d&eacute;marrage d'une session dans une autre</primary>
      </indexterm>
      <para>Pour d&eacute;marrer une session dans une autre langue, proc&eacute;dez comme suit.</para>
      <orderedlist>
        <listitem>
          <para>Dans la bo&icirc;te de dialogue de connexion, s&eacute;lectionnez <menuchoice><guimenu>Options</guimenu><guimenuitem>Session</guimenuitem></menuchoice>. S&eacute;lectionnez le bureau GNOME dans la liste des environnements de bureau disponibles.</para>
        </listitem>
        <listitem>
          <para>Dans la bo&icirc;te de dialogue de connexion, s&eacute;lectionnez <menuchoice><guimenu>Options</guimenu><guimenuitem>Langue</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>Choisissez le groupe de langues ad&eacute;quat.</para>
        </listitem>
        <listitem>
          <para>S&eacute;lectionnez une langue.</para>
        </listitem>
        <listitem>
          <para>Connectez-vous.</para>
        </listitem>
      </orderedlist>
      <para>Votre administrateur syst&egrave;me d&eacute;finit la langue par d&eacute;faut de votre syst&egrave;me. Le menu <guimenu>Options</guimenu> de la bo&icirc;te de dialogue <guilabel>Gestionnaire de connexion</guilabel> vous permet de choisir d'autres langues. Si vous effectuez une s&eacute;lection dans ce menu, votre syst&egrave;me d&eacute;finit la variable LANG pour votre session. Ensuite, il restaure la langue par d&eacute;faut &agrave; la fin de la session. </para>
    </sect2>
  </sect1>
  <sect1 id="gosstartsession-1">
    <title>Verrouillage de l'&eacute;cran</title>
    <para>Cette section propose les informations relatives au verrouillage de l'&eacute;cran et &agrave; la configuration de l'&eacute;conomiseur d'&eacute;cran.</para>
    <sect2 id="gosstartsession-4">
      <title>Verrouillage de l'&eacute;cran</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/lockscreen_icon.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>L'image montre une icône de verrouillage représentant la fonction de verrouillage de l'écran.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <indexterm>
        <primary>sessions</primary>
        <secondary>verrouillage de l'&eacute;cran</secondary>
      </indexterm>
      <indexterm>
        <primary>verrouillage de l'&eacute;cran</primary>
      </indexterm>
      <indexterm>
        <primary>bouton de verrouillage</primary>
      </indexterm>
      <para>Pour verrouiller l'&eacute;cran, proc&eacute;dez comme suit :</para>
      <itemizedlist>
        <listitem>
          <para>S&eacute;lectionnez <menuchoice><guimenu>Actions</guimenu><guimenuitem> Verrouiller l&acute;&eacute;cran</guimenuitem></menuchoice>.</para>
        </listitem>
        <listitem>
          <para>Si le bouton <guibutton>Verrouiller</guibutton> figure sur un tableau de bord, cliquez sur celui-ci. </para>
          <para>Pour ce faire, cliquez avec le bouton droit sur le tableau de bord. S&eacute;lectionnez <menuchoice><guimenu>Ajouter au tableau de bord</guimenu><guimenuitem> Bouton de verrouillage</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
      <para>Lorsque vous verrouillez votre &eacute;cran, l'&eacute;conomiseur d'&eacute;cran d&eacute;marre. Pour le d&eacute;verrouiller, d&eacute;placez la souris afin de faire appara&icirc;tre la bo&icirc;te de dialogue correspondante. Entrez votre nom d'utilisateur et votre mot de passe dans la bo&icirc;te de dialogue, puis appuyez sur <keycap>Entr&eacute;e</keycap>. </para>
      <note>
        <para>Il est n&eacute;cessaire qu'un &eacute;conomiseur d'&eacute;cran soit actif pour verrouiller l'&eacute;cran correctement. </para>
      </note>
    </sect2>
    <sect2 id="gosstartsession-3">
      <title>Configuration de l'&eacute;conomiseur d'&eacute;cran</title>
      <indexterm>
        <primary>sessions</primary>
        <secondary>configuration de l'&eacute;conomiseur d'&eacute;cran</secondary>
      </indexterm>
      <indexterm>
        <primary>&eacute;conomiseur d'&eacute;cran, configuration</primary>
      </indexterm>
      <indexterm>
        <primary>XScreenSaver</primary>
        <see>&eacute;conomiseur d'&eacute;cran</see>
      </indexterm>
      <para>Un &eacute;conomiseur d'&eacute;cran est une application permettant de remplacer l'image affich&eacute;e &agrave; l'&eacute;cran lorsque celui-ci est inactif. Un &eacute;conomiseur d'&eacute;cran peut &ecirc;tre configur&eacute; de diff&eacute;rentes fa&ccedil;ons :</para>
      <itemizedlist>
        <listitem>
          <para>activation apr&egrave;s une p&eacute;riode d'inactivit&eacute; sp&eacute;cifi&eacute;e ;</para>
        </listitem>
        <listitem>
          <para>activation lors du verrouillage de l'&eacute;cran ;</para>
        </listitem>
        <listitem>
          <para>gestion de l'&eacute;nergie utilis&eacute;e par le moniteur lorsque le syst&egrave;me est inactif. </para>
        </listitem>
      </itemizedlist>
      <para>Pour configurer votre &eacute;conomiseur d'&eacute;cran, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Cliquez avec le bouton droit sur le bouton <guibutton>Verrouiller</guibutton>, puis s&eacute;lectionnez <guimenuitem>Propri&eacute;t&eacute;s</guimenuitem> dans le menu contextuel. Une bo&icirc;te de dialogue <guilabel> XScreenSaver</guilabel> s'affiche.</para>
          <para>Si le bouton <guibutton>Verrouiller</guibutton> n'appara&icirc;t pas sur un tableau de bord, vous pouvez l'y ajouter. Pour ce faire, cliquez avec le bouton droit sur le tableau de bord. S&eacute;lectionnez <menuchoice><guimenu> Ajouter au tableau de bord</guimenu><guimenuitem>Bouton de verrouillage</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>Les &eacute;l&eacute;ments de l'onglet <guilabel>Modes d'affichage</guilabel> vous permettent de configurer votre &eacute;conomiseur d'&eacute;cran. Ils sont d&eacute;crits dans la table suivante : </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec2" colwidth="40.38*"/>
              <colspec colname="colspec3" colwidth="59.62*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Param&egrave;tre</para>
                  </entry>
                  <entry valign="top">
                    <para> Fonction</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Mode</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette zone de liste d&eacute;roulante permet de sp&eacute;cifier le comportement de l'&eacute;conomiseur d'&eacute;cran. S&eacute;lectionnez l'une des options suivantes : </para>
                    <itemizedlist>
                      <listitem>
                        <para><guilabel>D&eacute;sactiver l'&eacute;conomiseur d'&eacute;cran</guilabel> :Cette option permet de ne pas utiliser l'&eacute;conomiseur d'&eacute;cran.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>&Eacute;cran vide seulement</guilabel> :Cette option permet de vider l'&eacute;cran lors du verrouillage de celui-ci.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Un seul &eacute;conomiseur d'&eacute;cran</guilabel> :Cette option permet de n'afficher qu'un seul &eacute;conomiseur d'&eacute;cran de la zone de liste lors du verrouillage de votre &eacute;cran.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>&Eacute;conomiseur d'&eacute;cran al&eacute;atoire</guilabel> :Cette option vous permet d'afficher une s&eacute;lection al&eacute;atoire d'&eacute;conomiseurs d'&eacute;cran de la zone de liste lors du verrouillage de votre &eacute;cran. </para>
                      </listitem>
                    </itemizedlist>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>Liste d'affichage</para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>S&eacute;lectionnez, dans cette zone de liste, l'&eacute;conomiseur d'&eacute;cran de votre choix.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para><guilabel>&Eacute;teindre apr&egrave;s</guilabel> :</para>
                  </entry>
                  <entry valign="top">
                    <para>Sp&eacute;cifiez le d&eacute;lai qui doit s'&eacute;couler entre la derni&egrave;re utilisation du clavier ou de la souris et l'activation de l'&eacute;conomiseur d'&eacute;cran.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para><guilabel>Cycle apr&egrave;s</guilabel> :</para>
                  </entry>
                  <entry valign="top">
                    <para>Sp&eacute;cifiez le d&eacute;lai pendant lequel un &eacute;conomiseur donn&eacute; doit &ecirc;tre affich&eacute; avant de changer.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para><guilabel>Verrouiller l'&eacute;cran apr&egrave;s</guilabel> :</para>
                  </entry>
                  <entry valign="top">
                    <para>Cette option permet de verrouiller l'&eacute;cran apr&egrave;s l'activation de l'&eacute;conomiseur d'&eacute;cran. Cette zone de s&eacute;lection num&eacute;rique permet de sp&eacute;cifier le d&eacute;lai entre l'activation de l'&eacute;conomiseur d'&eacute;cran et le verrouillage de l'&eacute;cran.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para><guibutton>Aper&ccedil;u</guibutton> :</para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Ce bouton permet d'obtenir un aper&ccedil;u de l'&eacute;conomiseur d'&eacute;cran s&eacute;lectionn&eacute; dans la zone de liste. Pour quitter cet aper&ccedil;u, appuyez sur une touche quelconque ou cliquez sur l'un des boutons de la souris.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guibutton>Param&egrave;tres</guibutton>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Ce bouton permet d'afficher les options relatives &agrave; l'&eacute;conomiseur d'&eacute;cran s&eacute;lectionn&eacute; dans la zone de liste d'affichage. </para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Pour configurer les options avanc&eacute;es, cliquez sur l'onglet <guilabel>Avanc&eacute;es</guilabel>. La table suivante d&eacute;crit les &eacute;l&eacute;ments de dialogue propos&eacute;s dans cet onglet : </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec2" colwidth="40.38*"/>
              <colspec colname="colspec3" colwidth="59.62*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Param&egrave;tre</para>
                  </entry>
                  <entry valign="top">
                    <para> Fonction</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Capturer les images du bureau </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Certains &eacute;conomiseurs d'&eacute;cran peuvent r&eacute;aliser une capture de votre bureau, puis la manipuler afin de cr&eacute;er un &eacute;conomiseur. Cette option permet aux &eacute;conomiseurs de r&eacute;aliser une capture du bureau. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Capturer les images vid&eacute;o </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Certains &eacute;conomiseurs d'&eacute;cran peuvent capturer une image vid&eacute;o, puis la manipuler pour cr&eacute;er un &eacute;conomiseur. Si votre syst&egrave;me poss&egrave;de une carte de capture vid&eacute;o, cette option permet aux &eacute;conomiseurs d'&eacute;cran de capturer des images vid&eacute;o.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Choisir une image al&eacute;atoire</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette option permet aux &eacute;conomiseurs d'utiliser des images provenant d'un r&eacute;pertoire s&eacute;lectionn&eacute;. Entrez le chemin du r&eacute;pertoire dans le champ ad hoc. Vous pouvez &eacute;galement cliquer sur <guibutton>Parcourir</guibutton> pour afficher une bo&icirc;te de dialogue vous permettant de s&eacute;lectionner un r&eacute;pertoire. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Dialognostics bavards</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette option permet d'afficher des informations de diagnostic relatives &agrave; l'&eacute;conomiseur d'&eacute;cran.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Afficher les erreurs des sous-processus</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette option permet d'afficher les erreurs relatives aux sous-processus de l'&eacute;conomiseur d'&eacute;cran.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Afficher l&acute;&eacute;cran d&acute;accueil au d&eacute;marrage</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette option permet &agrave; <application>Xscreensaver</application> d'afficher une bo&icirc;te de dialogue d'accueil lors de son d&eacute;marrage. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Gestion de l'&eacute;nergie activ&eacute;e</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette option permet d'activer la gestion de l'&eacute;nergie de votre moniteur. Cette fonction permet de r&eacute;duire la consommation d'&eacute;nergie de votre moniteur lorsque celui-ci est inactif. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Veille apr&egrave;s </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Sp&eacute;cifiez le d&eacute;lai qui doit s'&eacute;couler avant la mise en veille du moniteur. Lorsque le moniteur est en mode veille, l'&eacute;cran est noir. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Suspendu apr&egrave;s </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Sp&eacute;cifiez le d&eacute;lai qui doit s'&eacute;couler avant le passage du moniteur en mode d'&eacute;conomie d'&eacute;nergie. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>&Eacute;teint apr&egrave;s</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Sp&eacute;cifiez le d&eacute;lai qui doit s'&eacute;couler avant que le moniteur ne s'&eacute;teigne. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Installer une palette de couleurs </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette option permet d'installer une palette de couleur priv&eacute;e lorsque l'&eacute;conomiseur d'&eacute;cran est actif. Cette fonction peut am&eacute;liorer la qualit&eacute; des couleurs de certains &eacute;conomiseurs d'&eacute;cran.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Fondu au noir lors de l&acute;extinction</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette option permet &agrave; l'&eacute;cran de passer progressivement au noir lors de l'activation de l'&eacute;conomiseur d'&eacute;cran. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Fondu au blanc lors de la r&eacute;activation</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Cette fonction permet de passer progressivement du noir au contenu de l'&eacute;cran lors de la fermeture de l'&eacute;conomiseur.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Dur&eacute;e du fondu</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Sp&eacute;cifiez le d&eacute;lai n&eacute;cessaire au fondu lors de l'activation de l'&eacute;conomiseur d'&eacute;cran.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Cliquez sur le bouton <guibutton>Fermer la fen&ecirc;tre</guibutton> pour fermer la bo&icirc;te de dialogue <guilabel>XScreenSaver</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gosstartsession-2">
    <title>Gestion de la session</title>
    <indexterm>
      <primary>outils de pr&eacute;f&eacute;rence</primary>
      <secondary>Sessions</secondary>
    </indexterm>
    <indexterm>
      <primary>sessions</primary>
      <secondary>gestion</secondary>
    </indexterm>
    <para>Pour configurer la gestion de la session du bureau GNOME, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;s</guisubmenu><guimenuitem>Sessions</guimenuitem></menuchoice>. L'outil de pr&eacute;f&eacute;rence <application>Sessions</application> reconna&icirc;t les types d'applications suivants : </para>
    <itemizedlist>
      <listitem>
        <indexterm>
          <primary>applications de d&eacute;marrage</primary>
          <secondary>g&eacute;r&eacute;es par la session </secondary>
        </indexterm>
        <para>Applications g&eacute;r&eacute;es par la session. Lors de la sauvegarde des param&egrave;tres de votre session, le gestionnaire de session enregistre toutes les applications g&eacute;r&eacute;es par la session. Si vous vous reconnectez apr&egrave;s vous &ecirc;tre d&eacute;connect&eacute;, le gestionnaire de session d&eacute;marre automatiquement les applications g&eacute;r&eacute;es par la session. </para>
      </listitem>
      <listitem>
        <para>Applications qui ne sont pas g&eacute;r&eacute;es par la session. Lors de la sauvegarde des param&egrave;tres de votre session, le gestionnaire de session n'enregistre aucune des applications non g&eacute;r&eacute;es par la session. Si vous vous reconnectez apr&egrave;s vous &ecirc;tre d&eacute;connect&eacute;, le gestionnaire de session ne d&eacute;marre pas les applications non g&eacute;r&eacute;es par la session. Vous devez d&eacute;marrer l'application manuellement. L'outil de pr&eacute;f&eacute;rence <application>Sessions</application> vous permet &eacute;galement de sp&eacute;cifier des applications non g&eacute;r&eacute;es par la session devant faire l'objet d'un d&eacute;marrage automatique. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosstartsession-9">
      <title>D&eacute;finition du comportement de la session lors de la connexion et de la d&eacute;connexion</title>
      <indexterm>
        <primary>sessions</primary>
        <secondary>comportement &agrave; la connexion</secondary>
      </indexterm>
      <indexterm>
        <primary>sessions</primary>
        <secondary>comportement &agrave; la d&eacute;connexion</secondary>
      </indexterm>
      <para>Pour d&eacute;finir le comportement d'une session lors de la connexion et de la d&eacute;connexion, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu> Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;es</guisubmenu><guimenuitem>Sessions</guimenuitem></menuchoice>. Apportez les modifications requises dans l'onglet <guilabel>Options de session</guilabel>. Par exemple, vous pouvez choisir d'afficher un &eacute;cran d'accueil lors de votre connexion. </para>
    </sect2>
    <sect2 id="gosstartsession-6">
      <title>Utilisation d'applications de d&eacute;marrage</title>
      <indexterm>
        <primary>programmes de d&eacute;marrage</primary>
        <see>applications de d&eacute;marrage</see>
      </indexterm>
      <indexterm>
        <primary>sessions</primary>
        <secondary>utilisation d'applications de d&eacute;marrage</secondary>
      </indexterm>
      <indexterm>
        <primary>applications de d&eacute;marrage </primary>
        <secondary>non g&eacute;r&eacute;es par la session</secondary>
      </indexterm>
      <para>Vous pouvez configurer vos sessions afin qu'elles d&eacute;marrent avec des applications non g&eacute;r&eacute;es par elles. Pour configurer des applications de d&eacute;marrage non g&eacute;r&eacute;es par la session, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;es</guisubmenu><guimenuitem>Sessions </guimenuitem></menuchoice>. L'onglet <guilabel>Programmes de d&eacute;marrage</guilabel> permet d'ajouter, d'&eacute;diter et de supprimer des applications. Si vous enregistrez vos param&egrave;tres avant de vous d&eacute;connecter, ces applications d&eacute;marrent automatiquement lors de votre connexion suivante. </para>
    </sect2>
    <sect2 id="gosstartsession-10">
      <title>Applications de la session courante</title>
      <indexterm>
        <primary>sessions</primary>
        <secondary>parcourir les applications</secondary>
      </indexterm>
      <para>Pour parcourir les applications de la session courante, s&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;es</guisubmenu><guimenuitem>Sessions </guimenuitem></menuchoice>. L'onglet <guilabel>Session courante</guilabel> contient les &eacute;l&eacute;ments suivants :</para>
      <itemizedlist>
        <listitem>
          <para>toutes les applications courantes qui peuvent se connecter au gestionnaire de session et enregistrer l'&eacute;tat de l'application ; </para>
        </listitem>
        <listitem>
          <para>tous les outils de pr&eacute;f&eacute;rence du bureau qui peuvent se connecter au gestionnaire de session et enregistrer l'&eacute;tat de l'outil.</para>
        </listitem>
      </itemizedlist>
      <para>L'onglet <guilabel>Session courante</guilabel> permet d'appliquer un nombre limit&eacute; d'actions aux propri&eacute;t&eacute;s de session d'une application ou d'un outil de pr&eacute;f&eacute;rence. Par exemple, vous pouvez &eacute;diter l'ordre de d&eacute;marrage et le style de red&eacute;marrage de chaque application ou outil de pr&eacute;f&eacute;rence GNOME figurant dans la liste. </para>
    </sect2>
    <sect2 id="gosgetstarted-74">
      <title>Enregistrement des param&egrave;tres de la session</title>
      <indexterm>
        <primary>sessions</primary>
        <secondary>enregistrement des param&egrave;tres</secondary>
      </indexterm>
      <para>Pour enregistrer les param&egrave;tres de la session, proc&eacute;dez comme suit : </para>
      <orderedlist>
        <listitem>
          <para>Configurez votre session afin qu'elle enregistre automatiquement les param&egrave;tres lorsque vous vous d&eacute;connectez. Pour configurer votre session, s&eacute;lectionnez <menuchoice><guimenu> Applications</guimenu><guisubmenu>Pr&eacute;f&eacute;rences du bureau</guisubmenu><guisubmenu>Avanc&eacute;es</guisubmenu><guimenuitem>Sessions</guimenuitem></menuchoice>. L'outil de pr&eacute;f&eacute;rence <application>Sessions</application> d&eacute;marre. S&eacute;lectionnez l'option <guilabel>Sauvegarder automatiquement les changements &agrave; la session</guilabel> de l'onglet <guilabel>Options de session</guilabel>.</para>
        </listitem>
        <listitem>
          <para>Quittez votre session. </para>
        </listitem>
      </orderedlist>
      <para>Si vous ne s&eacute;lectionnez pas l'option <guilabel>Sauvegarder automatiquement les changements &agrave; la session</guilabel>, lorsque vous vous d&eacute;connectez, une bo&icirc;te de dialogue vous invite &agrave; enregistrer vos param&egrave;tres courants. Pour enregistrer vos param&egrave;tres, s&eacute;lectionnez l'option, puis poursuivez la proc&eacute;dure de d&eacute;connexion.</para>
    </sect2>
  </sect1>
  <sect1 id="gosgetstarted-73">
    <title>Fermeture d'une session</title>
    <indexterm>
      <primary>sessions</primary>
      <secondary>fermeture</secondary>
    </indexterm>
    <indexterm>
      <primary>sessions</primary>
      <secondary>d&eacute;connexion</secondary>
    </indexterm>
    <indexterm>
      <primary>d&eacute;connexion</primary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/logout_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Icône Déconnexion.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Pour mettre un terme &agrave; la session, fermez tous les processus actifs, puis proc&eacute;dez comme suit :</para>
    <itemizedlist>
      <listitem>
        <para>Cliquez sur le bouton <guibutton>D&eacute;connecter</guibutton>.</para>
      </listitem>
      <listitem>
        <para>S&eacute;lectionnez <menuchoice><guimenu>Actions</guimenu><guimenuitem>D&eacute;connecter</guimenuitem></menuchoice>.</para>
      </listitem>
      <listitem>
        <para>Ouvrez le <guimenu>menu GNOME</guimenu>, puis s&eacute;lectionnez <guimenuitem>D&eacute;connecter</guimenuitem>.</para>
      </listitem>
    </itemizedlist>
    <para>Avant de quitter une session, vous pouvez enregistrer vos param&egrave;tres courants afin de les restaurer par la suite. Une bo&icirc;te de dialogue vous y invite lors du processus de d&eacute;connexion. Une option de l'outil de pr&eacute;f&eacute;rence <application> Sessions</application> permet d'enregistrer les param&egrave;tres automatiquement.</para>
  </sect1>
</chapter>
