<?xml version="1.0" encoding="utf-8"?>
<part id="part2-1"><title>Personnalisation de votre bureau GNOME</title><partintro><para>Vous pouvez personnaliser de nombreuses caract&eacute;ristiques de votre bureau. La personnalisation de chaque aspect du bureau est command&eacute;e par un outil logiciel d&eacute;di&eacute; appel&eacute; outil de pr&eacute;f&eacute;rence du bureau. A des fins de convivialit&eacute;, les outils de pr&eacute;f&eacute;rence sont regroup&eacute;s sous les intitul&eacute;s suivants :</para><itemizedlist><listitem><para>De base</para></listitem><listitem><para><guilabel>Accessibilit&eacute;</guilabel> ;</para></listitem><listitem><para><guilabel>Avanc&eacute;</guilabel>.</para></listitem></itemizedlist><para>Vous pouvez ouvrir vos outils de pr&eacute;f&eacute;rences en recourant &agrave; l'une des m&eacute;thodes suivantes : </para><itemizedlist><listitem><para>S&eacute;lectionnez <menuchoice><guimenu>Applications</guimenu><guimenuitem>Pr&eacute;f&eacute;rences du bureau</guimenuitem></menuchoice>. S&eacute;lectionnez l'outil requis dans les sous-menus. </para></listitem><listitem><para>Cliquez deux fois sur l'objet <guilabel>D&eacute;marrer ici</guilabel> situ&eacute; sur l'arri&egrave;re-plan du bureau. Une fen&ecirc;tre <application>Nautilus</application> s'ouvre &agrave; l'emplacement <guilabel>D&eacute;marrer ici</guilabel>. Cliquez deux fois sur l'objet <guilabel> Pr&eacute;f&eacute;rences</guilabel> de la fen&ecirc;tre <application>Nautilus</application> pour afficher vos outils de pr&eacute;f&eacute;rence. Cliquez deux fois sur l'outil requis. </para></listitem></itemizedlist><para>Les chapitres suivants de la pr&eacute;sente section d&eacute;crivent les modalit&eacute;s de configuration du bureau : </para><itemizedlist><listitem><para><emphasis>Utilisation des outils de pr&eacute;f&eacute;rence de base</emphasis></para><para>Ce chapitre pr&eacute;sente la personnalisation de l'arri&egrave;re-plan du bureau. Il contient &eacute;galement des informations sur la configuration de vos param&egrave;tres de clavier et de souris. Il d&eacute;crit aussi les m&eacute;thodes de configuration des touches de raccourci, des pr&eacute;f&eacute;rences sonores et d'un proxy de r&eacute;seau. Ce chapitre fournit des informations relatives au choix du th&egrave;me et des polices du bureau ainsi qu'&agrave; la personnalisation de vos barres de menus et d'outils. Il explique &eacute;galement comment personnaliser le comportement des fen&ecirc;tres &agrave; l'activation. </para></listitem><listitem><para><emphasis>Utilisation des outils de pr&eacute;f&eacute;rence avanc&eacute;s</emphasis></para><para>Ce chapitre d&eacute;crit la configuration des types de fichier, des applications par d&eacute;faut et des tableaux de bord. Il contient &eacute;galement des informations relatives &agrave; la personnalisation des sessions et des programmes de d&eacute;marrage. </para></listitem><listitem><para><emphasis>Utilisation des outils de pr&eacute;f&eacute;rence Accessibilit&eacute;</emphasis></para><para>Ce chapitre explique l'utilisation des fonctions d'accessibilit&eacute;. Il d&eacute;crit l'emploi des fonctions d'accessibilit&eacute; du clavier.</para></listitem></itemizedlist></partintro>&goscustdesk;
&goscustlookandfeel;
&goscustaccess;</part>
