<?xml version="1.0" encoding="utf-8"?>
<part id="part1-1"><title>Visite du bureau GNOME</title><partintro><para>La pr&eacute;sente section d&eacute;crit les principaux composants de GNOME. Elle vous propose &eacute;galement des informations de base relatives &agrave; l'utilisation du bureau. Le bureau est enti&egrave;rement modulable. C'est pourquoi cette section aborde les principales options fonctionnelles des caract&eacute;ristiques du bureau. Pour savoir comment mettre en oeuvre les diff&eacute;rentes configurations mentionn&eacute;es ici, consultez <emphasis>Personnalisation de votre bureau GNOME</emphasis>. Les chapitres de la pr&eacute;sente section sont les suivants : </para><itemizedlist><listitem><para><emphasis>Connaissances de base</emphasis></para><para>Ce chapitre propose des informations sur l'utilisation de la souris, des touches de raccourci, des fen&ecirc;tres et des bo&icirc;tes de dialogue. </para></listitem><listitem><para><emphasis>Pr&eacute;sentation du bureau</emphasis></para><para>Ce chapitre pr&eacute;sente les principaux composants et fonctions du bureau. Si vous ne lisez rien d'autre dans le pr&eacute;sent manuel, lisez au moins ce chapitre.</para></listitem><listitem><para><emphasis>Sessions du bureau</emphasis></para><para>Ce chapitre propose des informations sur le d&eacute;marrage, la gestion et la fermeture des sessions. </para></listitem><listitem><para><emphasis>Utilisation des tableaux de bord</emphasis></para><para>Lisez  ce chapitre pour en savoir plus sur l'utilisation des tableaux de bord. Les tableaux de bord sont un composant cl&eacute; du bureau. Ce chapitre explique comment utiliser les diff&eacute;rentes sections de vos tableaux de bord et comment appeler les fonctions disponibles dans le bureau &agrave; l'aide de ceux-ci.</para></listitem><listitem><para><emphasis>Utilisation des menus</emphasis></para><para>Lisez  ce chapitre pour en savoir plus sur l'utilisation des menus. </para></listitem><listitem><para><emphasis>Utilisation des fen&ecirc;tres</emphasis></para><para>Lisez  ce chapitre pour en savoir plus sur l'utilisation des fen&ecirc;tres. Il d&eacute;crit les fonctions de base des fen&ecirc;tres, telles que le d&eacute;placement et le redimensionnement. Il d&eacute;crit &eacute;galement les commandes utilis&eacute;es en relation avec les fen&ecirc;tres. </para></listitem><listitem><para><emphasis>Gestionnaire de fichiers Nautilus</emphasis></para><para>Ce chapitre pr&eacute;sente le gestionnaire de fichiers <application>Nautilus</application>. Il d&eacute;crit comment vous pouvez utiliser <application>Nautilus</application> en synergie avec votre syst&egrave;me de fichiers. Il aborde &eacute;galement les m&eacute;thodes de personnalisation de <application> Nautilus</application>.</para></listitem><listitem><para><emphasis>Utilisation de l'arri&egrave;re-plan du bureau</emphasis></para><para>Ce chapitre explique l'utilisation de l'arri&egrave;re-plan du bureau. Il d&eacute;crit les modalit&eacute;s d'utilisation de l'arri&egrave;re-plan du bureau pour d&eacute;marrer des applications et pour ouvrir vos fichiers et dossiers. Il explique &eacute;galement comment employer la <guilabel> Corbeille</guilabel> du bureau ainsi que le menu <guimenu>Arri&egrave;re-plan du bureau</guimenu> et comment personnaliser l'arri&egrave;re-plan du bureau.</para></listitem></itemizedlist></partintro>&gosbasic;
&gosoverview;
&gosstartsession;
&gospanel;
&goseditmainmenu;
&gosmetacity;
&gosnautilus;
&gosdeskback;</part>
