<?xml version="1.0" encoding="utf-8"?>
<glossary id="glossary-1">
  <title>Ordlista</title>
  <glossentry id="glossary-6">
    <glossterm>panelprogram</glossterm>
    <glossdef>
      <para>Ett panelprogram &auml;r ett litet, interaktivt program som finns inuti en panel, till exempel <application>CD-spelaren</application>. Varje panelprogram har ett enkelt anv&auml;ndargr&auml;nssnitt som du sk&ouml;ter med musen eller tangentbordet. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-9">
    <glossterm>objekt p&aring; skrivbordsbakgrund</glossterm>
    <glossdef>
      <para>En ikon p&aring; skrivbordsbakgrunden som du kan anv&auml;nda f&ouml;r att &ouml;ppna filer, mappar och program. Anv&auml;nd objekt p&aring; skrivbordsbakgrunden f&ouml;r att enkelt komma &aring;t filer, mappar och program som du anv&auml;nder ofta.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-20">
    <glossterm>DNS-namn</glossterm>
    <glossdef>
      <para>En unik bokstavsidentifierare f&ouml;r en dator i ett n&auml;tverk. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-8">
    <glossterm>l&aring;da</glossterm>
    <glossdef>
      <para>En l&aring;da &auml;r ett glidande till&auml;gg p&aring; en panel som du kan &ouml;ppna eller st&auml;nga med en l&aring;dikon. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-23">
    <glossterm>format </glossterm>
    <glossdef>
      <para>N&auml;r du formaterar media f&ouml;rbereder du media f&ouml;r anv&auml;ndning med ett visst filsystem. Det inneb&auml;r ocks&aring; att du skriver &ouml;ver all befintligt information p&aring; mediet. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-10">
    <glossterm>GNOME-kompatibelt program</glossterm>
    <glossdef>
      <para>Ett program som anv&auml;nder de vanliga GNOME-programmeringsbiblioteken &auml;r ett GNOME-kompatibelt program. <application>Nautilus </application> och <application>gedit</application> &auml;r till exempel GNOME-kompatibla program. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-26">
    <glossterm>snabbtangent </glossterm>
    <glossdef>
      <para>Snabbtangenter &auml;r kortkommandon som du anv&auml;nder f&ouml;r att starta program med tangentbordet. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-18">
    <glossterm>inod</glossterm>
    <glossdef>
      <para>En datastruktur som inneh&aring;ller information om enskilda filer i UNIX-filsystem. Varje fil har en inod. En inod inneh&aring;ller nod, typ, &auml;gare och plats f&ouml;r en fil. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-21">
    <glossterm>IP-adress</glossterm>
    <glossdef>
      <para>En unik sifferidentifierare f&ouml;r en dator i ett n&auml;tverk.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-25">
    <glossterm>tangentbordsgenv&auml;gar</glossterm>
    <glossdef>
      <para>En <firstterm>tangentbordsgenv&auml;g</firstterm>
&auml;r ett tangent eller en tangentkombination som du kan anv&auml;nda som ett alternativ till standards&auml;tten att utf&ouml;ra &aring;tg&auml;rder p&aring;. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-3">
    <glossterm>programstartare</glossterm>
    <glossdef>
      <para>En programstartare startar ett visst program, k&ouml;r ett visst kommando eller &ouml;ppnar en viss fil. Programstartare finns p&aring; paneler och menyer.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-11">
    <glossterm>menyrad</glossterm>
    <glossdef>
      <para>Menyraden finns l&auml;ngst upp i det programf&ouml;nster som inneh&aring;ller programmets menyer. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-27">
    <glossterm>MIME-typ</glossterm>
    <glossdef>
      <para>En Multipurpose Internet Mail Extension-typ (MIME) som identifierar en fils format. MIME-typen g&ouml;r s&aring; att program kan l&auml;sa filen. Till exempel kan ett e-postprogram anv&auml;nda MIME-typen <literal>image/png</literal> f&ouml;r att uppt&auml;cka att en PNG-fil (Portable Networks Graphic) &auml;r bifogad till en e-post.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-24">
    <glossterm>montera</glossterm>
    <glossdef>
      <para><firstterm>Montera</firstterm> &auml;r att g&ouml;ra ett filsystem tillg&auml;ngligt. N&auml;r du monterar ett filsystem, ansluts det som en underkatalog till det aktuella filsystemet. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-4">
    <glossterm>panel</glossterm>
    <glossdef>
      <para>En panel &auml;r en del av ett f&ouml;nster. F&ouml;nstret <application>Nautilus</application> inneh&aring;ller till exempel en sidopanel och en visningspanel. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-2">
    <glossterm>inst&auml;llningsverktyg</glossterm>
    <glossdef>
      <para>Ett dedikerat programverktyg som styr en viss del av skrivbordets beteende.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-5">
    <glossterm>snabbkommando-
tangenter</glossterm>
    <glossdef>
      <para>Med snabbkommandon kan du snabbt utf&ouml;ra olika &aring;tg&auml;rder. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-22">
    <glossterm>skivdel</glossterm>
    <glossdef>
      <para>En diskpartition. Du kan skapa skivdelar p&aring; Zip- och Jaz-media. Det visas ett objekt f&ouml;r varje skivdel p&aring; skrivbordsbakgrunden.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-15">
    <glossterm>lagerordning</glossterm>
    <glossdef>
      <para>Lagerordningen &auml;r den ordning i vilken f&ouml;nster lagras ovanp&aring; varandra p&aring; bildsk&auml;rmen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-13">
    <glossterm>statusrad</glossterm>
    <glossdef>
      <para>En statusrad &auml;r en rad l&auml;ngst ned i ett f&ouml;nster, som inneh&aring;ller aktuell information om det som visas i f&ouml;nstret just nu. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-28">
    <glossterm>symbolisk l&auml;nk</glossterm>
    <glossdef>
      <para>En speciell filtyp som pekar p&aring; en annan fil eller mapp. N&auml;r du utf&ouml;r en &aring;tg&auml;rd f&ouml;r en symbolisk l&auml;nk utf&ouml;rs &aring;tg&auml;rden i sj&auml;lva verket f&ouml;r den fil eller mapp som den symboliska l&auml;nken pekar p&aring;. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-12">
    <glossterm>verktygsrad</glossterm>
    <glossdef>
      <para>En verktygsrad inneh&aring;ller knappar f&ouml;r de vanligaste kommandona i ett program. Vanligtvis finns verktygsraden under menyraden. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-19">
    <glossterm>URL (Uniform Resource Locator)</glossterm>
    <glossdef>
      <para>En URL &auml;r adressen till en viss plats p&aring; webben.</para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-16">
    <glossterm>vy</glossterm>
    <glossdef>
      <para>En <application>Nautilus</application>-komponent som g&ouml;r det m&ouml;jligt f&ouml;r dig att visa en mapp p&aring; ett visst s&auml;tt. <application>Nautilus</application> inneh&aring;ller till exempel en ikonvy, som du anv&auml;nder f&ouml;r att visa inneh&aring;llet i en mapp som ikoner. <application>Nautilus</application> inneh&aring;ller ocks&aring; en listvy, som du anv&auml;nder f&ouml;r att visa inneh&aring;llet i en mapp som en lista. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-17">
    <glossterm>visningskomponent</glossterm>
    <glossdef>
      <para>En <application>Nautilus</application>-komponent som du anv&auml;nder f&ouml;r att visa en viss typ av filer i visningspanelen. En visningskomponent kan till exempel l&auml;gga till menyobjekt som &auml;r anv&auml;ndbara f&ouml;r just denna filtyp p&aring; menyerna i Nautilus. En visningskomponent kan ocks&aring; l&auml;gga till zoomknappar i <application>Nautilus</application> s&aring; att du kan &auml;ndra storlek p&aring; objektet i visningspanelen. </para>
    </glossdef>
  </glossentry>
  <glossentry id="glossary-7">
    <glossterm>arbetsyta</glossterm>
    <glossdef>
      <para>En arbetsyta &auml;r ett avskiljt omr&aring;de p&aring; skrivbordet d&auml;r du kan arbeta. </para>
    </glossdef>
  </glossentry>
</glossary>
