<?xml version="1.0" encoding="utf-8"?>
<chapter id="goscustaccess-1">
  <title>Anv&auml;nda hj&auml;pmedelsinst&auml;llningsverktygen</title>
  <highlights>
    <para>I detta kapitel beskrivs hur du anv&auml;nder inst&auml;llningsverktygen f&ouml;r <guilabel>Hj&auml;lpmedel</guilabel> f&ouml;r att anpassa skrivbordet.</para>
  </highlights>
  <sect1 id="goscustaccess-2">
    <title>&Ouml;ppna ett hj&auml;lpmedelsverktyg</title>
    <para>Du kan &ouml;ppna ett inst&auml;llningsverktyg f&ouml;r <guilabel>Hj&auml;lpmedel</guilabel> p&aring; f&ouml;ljande s&auml;tt: </para>
    <itemizedlist>
      <listitem>
        <para>Fr&aring;n <guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu>-menyn </para>
        <para>V&auml;lj <menuchoice><guimenu>Program</guimenu><guisubmenu> Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Hj&auml;lpmedel</guisubmenu></menuchoice>. V&auml;lj det inst&auml;llningsverktyg som du beh&ouml;ver fr&aring;n undermenyn. Dialogf&ouml;nstret f&ouml;r verktyget visas.</para>
      </listitem>
      <listitem>
        <para>Fr&aring;n <guilabel>B&ouml;rja h&auml;r</guilabel>-platsen</para>
        <para>&Ouml;ppna ett <application>Nautilus</application>-f&ouml;nster och v&auml;lj sedan <menuchoice><guimenu>G&aring;</guimenu><guimenuitem>B&ouml;rja h&auml;r</guimenuitem></menuchoice>. Du kan &auml;ven dubbelklicka p&aring; objektet <guilabel>B&ouml;rja h&auml;r</guilabel> p&aring; skrivbordsbakgrunden. Platsen <guilabel>B&ouml;rja h&auml;r</guilabel> visas. Dubbelklicka p&aring; objektet <guilabel>Skrivbordsinst&auml;llningar</guilabel> i f&ouml;nstret <application>Nautilus</application> och dubbelklicka sedan p&aring; mappen <guilabel>Hj&auml;lpmedel</guilabel>. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="goscustaccess-6">
    <title>Konfigurera alternativen f&ouml;r tangentbordshj&auml;lpmedel</title>
    <indexterm>
      <primary>AccessX</primary>
      <see>inst&auml;llningsverktyg, tangentbordshj&auml;lpmedel </see>
    </indexterm>
    <indexterm>
      <primary>tangentbord</primary>
      <secondary>konfigurerar hj&auml;lpmedelsalternativ</secondary>
    </indexterm>
    <indexterm>
      <primary>hj&auml;lpmedel </primary>
      <secondary>konfigurera tangentbord</secondary>
    </indexterm>
    <indexterm>
      <primary>inst&auml;llningsverktyg</primary>
      <secondary>tangentbordshj&auml;lpmedel</secondary>
    </indexterm>
    <para>Anv&auml;nd hj&auml;lpmedelsinst&auml;llningsverktyget f&ouml;r <application>Tangentbord</application> f&ouml;r att ange tangentbordshj&auml;lpmedelsinst&auml;llningarna. Hj&auml;lpmedelsinst&auml;llningsverktyget f&ouml;r<application> Tangentbord</application> kallas &auml;ven <application> AccessX</application>. </para>
    <para><xref linkend="goscustaccess-TBL-1"/> Visar inst&auml;llningar f&ouml;r tangentbordshj&auml;lpmedel som du kan modifiera.</para>
    <table frame="topbot" id="goscustaccess-TBL-1">
      <title>Inst&auml;llningar f&ouml;r tangentbordshj&auml;lpmedel</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="25.64*"/>
        <colspec colname="colspec1" colwidth="74.36*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Alternativ</para>
            </entry>
            <entry valign="top">
              <para> Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Anv&auml;nd 
tangentbordshj&auml;lpmedel</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> V&auml;lj detta alternativ f&ouml;r att aktivera tangentbordshj&auml;lpmedelsfunktioner. N&auml;r du markerar det h&auml;r alternativet blir de andra alternativen i inst&auml;llningsverktyget tillg&auml;ngliga.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Avge en ljudsignal n&auml;r hj&auml;lpmedelsfunktioner f&ouml;r tangentbord aktiveras/inaktiveras</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> V&auml;lj detta alternativ om vill f&aring; en ljudindikation n&auml;r en funktion som t ex tr&ouml;ga tangenter eller l&aring;ngsamma tangenter aktiveras eller inaktiveras.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Inaktivera om oanv&auml;nd i</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Markera det h&auml;r alternativet om du vill inaktivera inst&auml;llningarna f&ouml;r tangentbordshj&auml;lpmedel om tangentbordet inte anv&auml;nds under en viss tid. Genom att justera skjutreglaget kan du ange under hur m&aring;nga sekunder som tangentbordet inte ska anv&auml;ndas innan inst&auml;llningarna f&ouml;r tangentbordshj&auml;lpmedel inaktiveras. N&auml;r det antal sekunder som du angett har passerat inaktiveras f&ouml;ljande inst&auml;llningar f&ouml;r tangentbordshj&auml;lpmedel:</para>
              <itemizedlist>
                <listitem>
                  <para>Studsande tangenter</para>
                </listitem>
                <listitem>
                  <para>Mustangenter</para>
                </listitem>
                <listitem>
                  <para>L&aring;ngsamma tangenter</para>
                </listitem>
                <listitem>
                  <para>Tr&ouml;ga tangenter</para>
                </listitem>
                <listitem>
                  <para>V&auml;xlingsknappar</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Anv&auml;nd mustangenter</guilabel>
              </para>
              <indexterm>
                <primary>hj&auml;lpmedel</primary>
                <secondary>musknappar</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>V&auml;lj detta alternativ om du vill att det numeriska tangentbordet ska emulera mus&aring;tg&auml;rder. Du kan ange f&ouml;ljande musknappsinst&auml;llningar: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Maximal pekarhastighet</guilabel>: Anv&auml;nd den h&auml;r inst&auml;llningen f&ouml;r att ange maximal hastighet som pekaren ska flyttas &ouml;ver sk&auml;rmen. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Tid att accelerera till maximal hastighet</guilabel>: Anv&auml;nd den h&auml;r inst&auml;llningen f&ouml;r att ange accelerationstidens l&auml;ngd f&ouml;r pekaren. </para>
                </listitem>
                <listitem>
                  <para><guilabel>B&ouml;rja flytta s&aring; h&auml;r l&aring;ng tid efter tangentnedtryckning</guilabel>: Anv&auml;nd denna inst&auml;llning f&ouml;r att ange den tidsperiod som ska l&ouml;pa efter en tangenttryckning innan pekaren flyttas. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Anv&auml;nd l&aring;ngsamma tangenter</guilabel>
              </para>
              <indexterm>
                <primary>hj&auml;lpmedel</primary>
                <secondary>l&aring;ngsamma tangenter</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>V&auml;lj detta alternativ f&ouml;r att kontrollera den tidsperiod som du ska trycka ned och h&aring;lla ned en tangent innan den accepteras. Du kan ange f&ouml;ljande inst&auml;llningar f&ouml;r l&aring;ngsamma tangenter: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Godk&auml;nn endast tangenttryckningar efter</guilabel>: V&auml;lj denna inst&auml;llning f&ouml;r att ange den tidsperiod som du ska trycka ned och h&aring;lla ned en tangent innan den accepteras. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Avge en ljudsignal n&auml;r tangenten trycks ned</guilabel>: V&auml;lj detta alternativ f&ouml;r att f&aring; en ljudindikation f&ouml;r en tangenttryckning. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Avge en ljudsignal n&auml;r tangenten &auml;r godk&auml;nd</guilabel>: V&auml;lj detta alternativ f&ouml;r att f&aring; en ljudindikation f&ouml;r ett tangentgodk&auml;nnande. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Avge en ljudsignal n&auml;r tangenten inte godk&auml;nns</guilabel>: V&auml;lj detta alternativ f&ouml;r att f&aring; en ljudindikation n&auml;r tangenten inte godk&auml;nns. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Anv&auml;nd studsande tangenter</guilabel>
              </para>
              <indexterm>
                <primary>hj&auml;lpmedel</primary>
                <secondary>tangentrepetition</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> V&auml;lj detta alternativ f&ouml;r att acceptera en tangentinmatning och f&ouml;r att kontrollera tangentbordets tangentrepetitionsegenskaper. Du kan ange f&ouml;ljande inst&auml;llningar f&ouml;r tangentrepetition: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Ignorera tangenttryckningar inom</guilabel>: Anv&auml;nd denna inst&auml;llning f&ouml;r att ange den tid som ska g&aring; efter den f&ouml;rsta tangenttryckningen f&ouml;re den nedtryckta knappens automatiska repetition. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Avge en ljudsignal n&auml;r tangenten inte godk&auml;nns</guilabel>: V&auml;lj detta alternativ f&ouml;r att f&aring; en ljudindikation n&auml;r tangenten inte godk&auml;nns. </para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Anv&auml;nd tr&ouml;ga tangenter</guilabel>
              </para>
              <indexterm>
                <primary>hj&auml;lpmedel</primary>
                <secondary>tr&ouml;ga tangenter</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> V&auml;lj detta alternativ f&ouml;r att utf&ouml;ra flera tangenttrycknings&aring;tg&auml;rder samtidigt genom att trycka p&aring; tangenterna i sekvens. Du kan ange f&ouml;ljande inst&auml;llningar f&ouml;r tr&ouml;ga tangenter: </para>
              <itemizedlist>
                <listitem>
                  <para><guilabel>Avge en ljudsignal n&auml;r modifieraren trycks ned</guilabel>: V&auml;lj detta alternativ f&ouml;r att f&aring; en ljudindikation n&auml;r du trycker p&aring; en modifieringstangent. </para>
                </listitem>
                <listitem>
                  <para><guilabel>Inaktivera tr&ouml;ga tangenter n&auml;r tv&aring; tangenter trycks ned samtidigt</guilabel>: V&auml;lj detta alternativ f&ouml;r att ange att n&auml;r du trycker p&aring; tv&aring; tangenter samtidigt, kan du inte l&auml;ngre trycka p&aring; knappar i sekvens f&ouml;r att utf&ouml;ra flera tangenttryckningar samtidigt.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>V&auml;xlings- och repetitionstangenter</guilabel>
              </para>
              <indexterm>
                <primary>hj&auml;lpmedel</primary>
                <secondary>v&auml;xlingstangent</secondary>
              </indexterm>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> V&auml;lj detta alternativ f&ouml;r att f&aring; en ljudindikation f&ouml;r en v&auml;xlingstangent. Du h&ouml;r en ljudsignal n&auml;r en v&auml;xlingstangent &auml;r aktiverad. Du h&ouml;r tv&aring; ljudsignaler n&auml;r en v&auml;xlingstangent &auml;r inaktiverad. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel>Testomr&aring;de</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Testomr&aring;det &auml;r ett interaktivt gr&auml;nssnitt s&aring; att du kan se hur tangentbordsinst&auml;llningarna p&aring;verkar displayen medan du skriver. Skriv in text i testomr&aring;det f&ouml;r att kontollera effekten av dina inst&auml;llningar.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guibutton>Importera CDE AccessX-fil</guibutton>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Klicka p&aring; denna knapp f&ouml;r att importera en CDE AccessX-konfigurationsfil. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Mer information om hur du konfigurerar inst&auml;llningar f&ouml;r tangentbordshj&auml;lpmedel finns i <citetitle>GNOME 2.0 Desktop for
the Solaris Operating Environment Accessibility Guide</citetitle>.</para>
  </sect1>
</chapter>
