<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosdeskback-1">
  <title>Anv&auml;nda skrivbordsbakgrunden</title>
  <highlights>
    <para>Som standard hanterar <application>Nautilus</application>-filhanteraren skrivbordsbakgrunden. Om du inte anv&auml;nder <application>Nautilus </application> f&ouml;r att hantera skrivbordsbakgrunden kan du ignorera det h&auml;r kapitlet. I det h&auml;r kapitlet beskrivs hur du anv&auml;nder skrivbordsbakgrunden i <application>Nautilus</application>.</para>
  </highlights>
  <sect1 id="gosdeskback-21">
    <title>Introduktion till skrivbordsbakgrunden</title>
    <indexterm>
      <primary>skrivbordsbakgrund</primary>
      <secondary>introduktion</secondary>
    </indexterm>
    <para>Skrivbordsbakgrunden ligger bakom alla &ouml;vriga komponenter p&aring; den synliga delen av skrivbordet. Skrivbordsbakgrunden &auml;r en aktiv komponent i anv&auml;ndargr&auml;nssnittet. Du kan utf&ouml;ra f&ouml;ljande uppgifter fr&aring;n skrivbordsbakgrunden:</para>
    <itemizedlist>
      <listitem>
        <para>Starta program och &ouml;ppna filer och mappar. </para>
        <para>Du kan l&auml;gga till objekt p&aring; skrivbordsbakgrunden s&aring; att du l&auml;tt kommer &aring;t filer, mappar och program som du anv&auml;nder ofta. Exempelvis kan du l&auml;gga till en programstartare p&aring; skrivbordsbakgrunden. Du kan skapa en symbolisk l&auml;nk till en fil som du anv&auml;nder ofta och sedan l&auml;gga till den h&auml;r l&auml;nken p&aring; skrivbordsbakgrunden. Du kan ocks&aring; lagra filer och mappar p&aring; skrivbordsbakgrunden.</para>
      </listitem>
      <listitem>
        <para>&Ouml;ppna <guimenu>Skrivbordsbakgrund</guimenu>-menyn.</para>
        <para>H&ouml;gerklicka p&aring; skrivbordsbakgrunden. Menyn <guimenu>Skrivbordsbakgrund</guimenu> visas. Du kan utnyttja menyn <guimenu>Skrivbordsbakgrund</guimenu> f&ouml;r att utf&ouml;ra &aring;tg&auml;rder p&aring; skrivbordsbakgrunden.</para>
      </listitem>
      <listitem>
        <para>Arbeta med <guilabel>Papperskorgen</guilabel>.</para>
        <para>Du kan flytta objekt till <guilabel>papperskorgen</guilabel> och t&ouml;mma <guilabel> papperskorgen</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Anpassa skrivbordsbakgrunden.</para>
        <para>Du kan anpassa m&ouml;nstret eller f&auml;rgen f&ouml;r skrivbordsbakgrunden.</para>
      </listitem>
    </itemizedlist>
    <para>Som standard inneh&aring;ller skrivbordsbakgrunden tre objekt. </para>
    <para><xref linkend="gosdeskback-TBL-84"/> beskriver funktionerna f&ouml;r standardobjekten p&aring; skrivbordsbakgrunden.</para>
    <table frame="topbot" id="gosdeskback-TBL-84">
      <title>Funktioner f&ouml;r standardobjekt p&aring; skrivbordsbakgrunden</title>
      <tgroup cols="3" colsep="0" rowsep="0">
        <colspec colname="colspec2" colwidth="35.94*"/>
        <colspec colname="colspec0" colwidth="35.94*"/>
        <colspec colname="colspec1" colwidth="64.06*"/>
        <thead>
          <row rowsep="1">
            <entry colname="colspec2" valign="top">
              <para>Objekt</para>
            </entry>
            <entry valign="top">
              <para>Komponent</para>
            </entry>
            <entry valign="top">
              <para> Funktion </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_home_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Hemplatsikonen för Nautilus.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry valign="top">
              <para>
                <guilabel> Hem</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>&Ouml;ppnar ett <application> Nautilus</application>-f&ouml;nster och visar hemplatsen i visningspanelen.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_starthere_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Nautilus-ikonen för Börja här.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel> B&ouml;rja h&auml;r</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Ger tillg&aring;ng till n&aring;gra av nyckelfunktionerna f&ouml;r GNOME-skrivbordet. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_overview_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>GNOME översiktsikon.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry colname="colspec0" valign="top">
              <para>
                <guilabel> GNOME-&ouml;versikt</guilabel>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>&Ouml;ppnar ett hj&auml;lpl&auml;sarf&ouml;nster och visar &ouml;versiktsinformation om skrivbordet GNOME.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec2" valign="top">
              <screenshot>
                <mediaobject>
                  <imageobject>
                    <imagedata fileref="figures/naut_trash_launcher.png" format="PNG"/>
                  </imageobject>
                  <textobject>
                    <phrase>Papperskorg-ikonen för Nautilus.</phrase>
                  </textobject>
                </mediaobject>
              </screenshot>
            </entry>
            <entry valign="top">
              <para>
                <guilabel> Papperskorg</guilabel>
              </para>
            </entry>
            <entry valign="top">
              <para>&Ouml;ppnar ett <application> Nautilus</application>-f&ouml;nster och visar <guilabel>papperskorgen</guilabel> i visningspanelen.</para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="gosdeskback-22">
    <title>Starta skrivbordsbakgrunden</title>
    <indexterm>
      <primary>skrivbordsbakgrund</primary>
      <secondary>starta</secondary>
    </indexterm>
    <para>Om <application>Nautilus</application> inte hanterar skrivbordsbakgrunden f&ouml;r tillf&auml;llet visas inte standardobjekten p&aring; skrivbordsbakgrunden. I det h&auml;r fallet kan du beh&ouml;va starta om skrivbordsbakgrunden. Om standardobjekten inte visas p&aring; skrivbordsbakgrunden kan n&aring;got av f&ouml;ljande ha intr&auml;ffat:</para>
    <itemizedlist>
      <listitem>
        <para><application>Nautilus</application>-inst&auml;llningarna har angetts s&aring; att <application>Nautilus</application> inte hanterar skrivbordsbakgrunden. Om du vill starta om skrivbordsbakgrunden m&aring;ste du ange <application>Nautilus</application>-inst&auml;llningarna s&aring; att <application>Nautilus</application> hanterar skrivbordsbakgrunden.</para>
      </listitem>
      <listitem>
        <para>Du har avslutat en process f&ouml;r skrivbordsbakgrunden av misstag. Om du vill starta om skrivbordsbakgrunden m&aring;ste du ange <application>Nautilus</application>-inst&auml;llningarna s&aring; att <application>Nautilus</application> hanterar skrivbordsbakgrunden.</para>
      </listitem>
      <listitem>
        <para>Du har tagit bort katalogen <filename>/.nautilus</filename>. Om du vill starta om skrivbordsbakgrunden m&aring;ste du konfigurera <application>Nautilus</application> s&aring; att <application>Nautilus</application> hanterar skrivbordsbakgrunden. </para>
      </listitem>
    </itemizedlist>
    <para>Om du vill ange inst&auml;llningarna s&aring; att <application>Nautilus</application> hanterar skrivbordsbakgrunden g&ouml;r du f&ouml;ljande:</para>
    <orderedlist>
      <listitem>
        <para>V&auml;lj <menuchoice><guimenu>Program</guimenu><guimenuitem>Hemmapp</guimenuitem></menuchoice>. Ett <application>Nautilus</application>-f&ouml;nster visas. </para>
      </listitem>
      <listitem>
        <para>V&auml;lj <menuchoice><guimenu>Redigera</guimenu><guimenuitem> Inst&auml;llningar</guimenuitem></menuchoice>. Dialogrutan <guilabel>Inst&auml;llningar</guilabel> visas. V&auml;lj <guilabel>Skrivbord och papperskorg</guilabel> i dialogf&ouml;nstret <guilabel>Inst&auml;llningar</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Markera alternativet <guilabel>Anv&auml;nd Nautilus f&ouml;r att rita skrivbordet</guilabel>.</para>
      </listitem>
      <listitem>
        <para>Klicka p&aring; <guibutton>St&auml;ng</guibutton> f&ouml;r att st&auml;nga dialogf&ouml;nstret.</para>
      </listitem>
    </orderedlist>
    <para>Om du vill konfigurera <application>Nautilus</application> s&aring; att <application>Nautilus</application> hanterar skrivbordsbakgrunden g&ouml;r du f&ouml;ljande:</para>
    <orderedlist>
      <listitem>
        <para>V&auml;lj <menuchoice><guimenu>Program</guimenu><guimenuitem>Hemmapp</guimenuitem></menuchoice>. Dialogrutan <guilabel>Nautilus f&ouml;rstag&aring;ngsinstallation</guilabel> visas.</para>
      </listitem>
      <listitem>
        <para>Med hj&auml;lp av dialogrutan <guilabel>Nautilus f&ouml;rstag&aring;ngsinstallation</guilabel> kan du anpassa <application>Nautilus</application>-milj&ouml;n. F&ouml;lj instruktionerna i dialogrutan <guilabel>Nautilus f&ouml;rstag&aring;ngsinstallation</guilabel>. P&aring; sk&auml;rmen <guilabel>&Ouml;verf&ouml;ring fr&aring;n GMC till Nautilus</guilabel> markerar du alternativet <guilabel>Anv&auml;nd Nautilus f&ouml;r att rita skrivbordet</guilabel>.</para>
      </listitem>
      <listitem>
        <para>N&auml;r du kommer till sk&auml;rmen <guilabel>Klart</guilabel> klickar du p&aring; knappen <guibutton>Slutf&ouml;r</guibutton>.</para>
      </listitem>
    </orderedlist>
  </sect1>
  <sect1 id="gosdeskback-2">
    <title>Skrivbordsbakgrundsobjekt</title>
    <indexterm>
      <primary>skrivbordsbakgrund</primary>
      <secondary>skrivbordsbakgrundsobjekt</secondary>
    </indexterm>
    <para>Ett skrivbordsbakgrundsobjekt &auml;r en ikon p&aring; skrivbordsbakgrunden som du kan anv&auml;nda f&ouml;r att &ouml;ppna filer, mappar och program. Alla objekt p&aring; skrivbordsbakgrunden lagras i skrivbordsbakgrundskatalogen. N&auml;r du flyttar objekt till skrivbordsbakgrunden flyttas objekten till den h&auml;r katalogen. Du kan ocks&aring; anv&auml;nda hemkatalogen som skrivbordsbakgrundskatalog. </para>
    <para>Som standard inneh&aring;ller skrivbordsbakgrunden tre objekt. Du kan ocks&aring; l&auml;gga till objekt p&aring; skrivbordsbakgrunden f&ouml;r att enkelt komma &aring;t filer, mappar och program som du anv&auml;nder ofta. Exempelvis kan du l&auml;gga till en programstartare p&aring; skrivbordsbakgrunden s&aring; att du kan &ouml;ppna ett visst program som du anv&auml;nder ofta. </para>
    <para><xref linkend="gosdeskback-TBL-86"/> beskriver typer av objekt som du kan l&auml;gga till din skrivbordsbakgrund.</para>
    <table frame="topbot" id="gosdeskback-TBL-86">
      <title>Typer av skrivbordsbakgrundsobjekt</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="30.23*"/>
        <colspec colname="colspec1" colwidth="69.77*"/>
        <thead>
          <row rowsep="1">
            <entry colname="colspec0" valign="top">
              <para>Objekttyp</para>
            </entry>
            <entry valign="top">
              <para>Beskrivning</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Symbolisk l&auml;nk</para>
            </entry>
            <entry valign="top">
              <para>En symbolisk l&auml;nk &auml;r ett objekt som pekar p&aring; en annan fil eller mapp. N&auml;r du klickar p&aring; en symbolisk l&auml;nk p&aring; skrivbordsbakgrunden &ouml;ppnas den fil eller mapp som den symboliska l&auml;nken pekar p&aring;. Du kan flytta eller kopiera en symbolisk l&auml;nk till skrivbordsbakgrunden.</para>
              <para>Du k&auml;nner igen symboliska l&auml;nkar p&aring; det standardpilemblem som visas p&aring; alla symboliska l&auml;nkar. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Programstartare</para>
            </entry>
            <entry valign="top">
              <para>Du kan l&auml;gga till f&ouml;ljande typer av programstartare p&aring; skrivbordsbakgrunden:</para>
              <itemizedlist>
                <listitem>
                  <para>Program: Startar ett visst program.</para>
                </listitem>
                <listitem>
                  <para>L&auml;nk: L&auml;nkar till en viss fil, mapp eller URL.</para>
                </listitem>
              </itemizedlist>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Fil</para>
            </entry>
            <entry valign="top">
              <para>Du kan l&auml;gga till filer p&aring; skrivbordsbakgrunden. Filer p&aring; skrivbordsbakgrunden lagras i skrivbordsbakgrundskatalogen. </para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>Mapp </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Du kan flytta mappar till och skapa mappar p&aring; skrivbordsbakgrunden. Mappar p&aring; skrivbordsbakgrunden lagras i skrivbordsbakgrundskatalogen. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
    <para>Du kan &auml;ndra skrivbordsbakgrundsobjekt p&aring; f&ouml;ljande s&auml;tt:</para>
    <itemizedlist>
      <listitem>
        <para>Visa egenskaperna f&ouml;r objektet.</para>
      </listitem>
      <listitem>
        <para>Byta namn p&aring; objektet.</para>
      </listitem>
      <listitem>
        <para>&Auml;ndra r&auml;ttigheterna f&ouml;r objektet.</para>
      </listitem>
      <listitem>
        <para>&Auml;ndra ikonen som representerar objektet.</para>
      </listitem>
      <listitem>
        <para>&Auml;ndra storlek p&aring; ikonen som representerar objektet.</para>
      </listitem>
      <listitem>
        <para>L&auml;gga till ett emblem till objektet.</para>
      </listitem>
    </itemizedlist>
    <para>I f&ouml;ljande avsnitt beskrivs hur du arbetar med objekt p&aring; skrivbordsbakgrunden.</para>
    <sect2 id="gosdeskback-30">
      <title>S&aring; h&auml;r markerar du objekt p&aring; skrivbordsbakgrunden</title>
      <indexterm>
        <primary>skrivbordsbakgrund</primary>
        <secondary>markera objekt </secondary>
      </indexterm>
      <indexterm>
        <primary>skrivbordsbakgrundsobjekt</primary>
        <secondary>markera</secondary>
      </indexterm>
      <para>Du markerar ett objekt p&aring; skrivbordsbakgrunden genom att klicka p&aring; det. Om du vill markera flera objekt h&aring;ller du ned <keycap> Control</keycap> och klickar sedan p&aring; de objekt du vill markera.</para>
      <para>Du kan ocks&aring; markera ett omr&aring;de p&aring; skrivbordsbakgrunden f&ouml;r att markera alla objekt inom det omr&aring;det. Klicka och h&aring;ll ned musknappen p&aring; skrivbordsbakgrunden och dra sedan &ouml;ver det omr&aring;de som inneh&aring;ller de objekt du vill markera. N&auml;r du klickar, h&aring;ller ned musknappen och drar visas en gr&aring; rektangel som indikerar det omr&aring;de du markerar.</para>
      <para>Om du vill markera flera omr&aring;den h&aring;ller du ned <keycap>Control</keycap> och drar sedan &ouml;ver de omr&aring;den du vill markera. </para>
    </sect2>
    <sect2 id="gosdeskback-29">
      <title>S&aring; h&auml;r &ouml;ppnar du ett objekt fr&aring;n skrivbordsbakgrunden</title>
      <indexterm>
        <primary>skrivbordsbakgrund</primary>
        <secondary>&ouml;ppna objekt </secondary>
      </indexterm>
      <indexterm>
        <primary>skrivbordsbakgrundsobjekt</primary>
        <secondary>&ouml;ppna</secondary>
      </indexterm>
      <para>Dubbelklicka p&aring; objektet i skrivbordsbakgrunden om du vill &ouml;ppna det. Du kan ocks&aring; h&ouml;gerklicka p&aring; objektet och sedan v&auml;lja <guimenuitem>&Ouml;ppna</guimenuitem>. N&auml;r du &ouml;ppnar ett objekt k&ouml;rs standard&aring;tg&auml;rden f&ouml;r objektet. Om objektet exempelvis &auml;r en textfil &ouml;ppnas textfilen i ett <application>Nautilus</application>-f&ouml;nster. Standard&aring;tg&auml;rderna f&ouml;r filtyper anges i inst&auml;llningsverktyget <application>Filtyper och program</application>.</para>
      <para>Om du vill k&ouml;ra en annan &aring;tg&auml;rd &auml;n standard&aring;tg&auml;rden f&ouml;r ett objekt h&ouml;gerklickar du p&aring; objektet och v&auml;ljer sedan <guimenuitem>&Ouml;ppna med</guimenuitem>. V&auml;lj en &aring;tg&auml;rd fr&aring;n undermenyn <guisubmenu>&Ouml;ppna med</guisubmenu>. </para>
      <para>Alternativen p&aring; undermenyn <guimenuitem>&Ouml;ppna med</guimenuitem> motsvarar inneh&aring;llet i f&ouml;ljande delar av inst&auml;llningsverktyget <application>Filtyper och program</application>:</para>
      <itemizedlist>
        <listitem>
          <para>Listrutan <guilabel>Standard&aring;tg&auml;rd</guilabel> i dialogf&ouml;nstret <guilabel>Redigera filtyp</guilabel></para>
        </listitem>
        <listitem>
          <para>Listan <guilabel>Visningskomponent</guilabel> i dialogf&ouml;nstret  <guilabel>Redigera filtyp</guilabel></para>
        </listitem>
      </itemizedlist>
      <para>Du kan ange inst&auml;llningarna i ett <application>Nautilus</application>-f&ouml;nster s&aring; att du klickar en g&aring;ng p&aring; en fil f&ouml;r att utf&ouml;ra standard&aring;tg&auml;rden.</para>
    </sect2>
    <sect2 id="gosdeskback-3">
      <title>S&aring; h&auml;r l&auml;gger du till en programstartare p&aring; skrivbordsbakgrunden</title>
      <indexterm>
        <primary>skrivbordsbakgrund</primary>
        <secondary>l&auml;gga till programstartare </secondary>
      </indexterm>
      <indexterm>
        <primary>skrivbordsbakgrundsobjekt</primary>
        <secondary>programstartare</secondary>
      </indexterm>
      <para>En programstartare p&aring; skrivbordsbakgrunden kan starta ett program eller l&auml;nka till en viss fil, mapp eller FTP-plats. </para>
      <para>Om du vill l&auml;gga till en programstartare p&aring; skrivbordsbakgrunden g&ouml;r du f&ouml;ljande:</para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; skrivbordsbakgrunden och v&auml;lj sedan <guimenuitem> Ny programstartare</guimenuitem>. Dialogf&ouml;nstret <guilabel>Skapa programstartare</guilabel> visas.</para>
        </listitem>
        <listitem>
          <para>Information om hur du anger egenskaperna f&ouml;r programstartaren i dialogf&ouml;nstret <guilabel>Skapa programstartare</guilabel> hittar du i <emphasis>Arbeta med paneler</emphasis>.</para>
          <para>Det kommando som du anger f&ouml;r programstartaren &auml;r det kommando som k&ouml;rs n&auml;r du anv&auml;nder skrivbordsbakgrundsobjektet. I f&ouml;ljande tabell visas n&aring;gra exempelkommandon och de &aring;tg&auml;rder som kommandona utf&ouml;r.</para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="47.36*"/>
              <colspec colname="colspec1" colwidth="52.64*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Exempelkommando</para>
                  </entry>
                  <entry valign="top">
                    <para>&Aring;tg&auml;rd</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0" valign="top">
                    <para>
                      <command>gedit</command>
                    </para>
                  </entry>
                  <entry colname="colspec1" valign="top">
                    <para>Startar programmet <application>gedit</application>.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <command>gedit /user123/loremipsum.txt</command>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>&Ouml;ppnar filen <filename>/user123/loremipsum.txt </filename> i programmet <application>gedit</application>.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0" valign="top">
                    <para>
                      <command>nautilus /user123/Projects </command>
                    </para>
                  </entry>
                  <entry colname="colspec1" valign="top">
                    <para>&Ouml;ppnar mappen <filename>/user123/Projects</filename> i ett <application>Nautilus</application>-f&ouml;nster.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gosdeskback-20">
      <title>S&aring; h&auml;r l&auml;gger du till en symbolisk l&auml;nk p&aring; skrivbordsbakgrunden</title>
      <indexterm>
        <primary>skrivbordsbakgrund</primary>
        <secondary>l&auml;gga till symboliska l&auml;nkar </secondary>
      </indexterm>
      <indexterm>
        <primary>skrivbordsbakgrundsobjekt </primary>
        <secondary>symboliska l&auml;nkar</secondary>
      </indexterm>
      <para>Du kan skapa symboliska l&auml;nkar p&aring; skrivbordsbakgrunden f&ouml;r att utf&ouml;ra f&ouml;ljande &aring;tg&auml;rder: </para>
      <itemizedlist>
        <listitem>
          <para>&Ouml;ppna en viss fil i ett visst program.</para>
        </listitem>
        <listitem>
          <para>&Ouml;ppna en viss mapp i ett <application>Nautilus</application>-f&ouml;nster.</para>
        </listitem>
        <listitem>
          <para>K&ouml;ra en bin&auml;rfil eller ett skript.</para>
        </listitem>
      </itemizedlist>
      <para>Om du vill skapa en symbolisk l&auml;nk p&aring; skrivbordsbakgrunden g&ouml;r du f&ouml;ljande:</para>
      <orderedlist>
        <listitem>
          <para>Visa den fil eller mapp som du vill skapa en symbolisk l&auml;nk f&ouml;r i ett <application>Nautilus</application>-f&ouml;nster.</para>
        </listitem>
        <listitem>
          <para>Skapa en symbolisk l&auml;nk till filen eller mappen. Du skapar en symbolisk l&auml;nk till en fil eller mapp genom att markera filen eller mappen som du vill skapa en l&auml;nk till. V&auml;lj <menuchoice><guimenu>Redigera</guimenu><guimenuitem>Skapa l&auml;nk</guimenuitem></menuchoice>. En l&auml;nk till filen eller mappen l&auml;ggs till i den aktuella mappen. Du k&auml;nner igen symboliska l&auml;nkar p&aring; det standardpilemblem som visas p&aring; alla symboliska l&auml;nkar. I f&ouml;ljande figur visas en symbolisk l&auml;nk till en fil:</para>
          <screenshot>
            <mediaobject>
              <imageobject>
                <imagedata fileref="figures/naut_samplesymlink_icon.png" format="PNG"/>
              </imageobject>
              <textobject>
                <phrase>Filikon med emblem för symbolisk länk.</phrase>
              </textobject>
            </mediaobject>
          </screenshot>
        </listitem>
        <listitem>
          <para>Dra den symboliska l&auml;nken till skrivbordsbakgrunden. Ikonen f&ouml;r objektet flyttas till skrivbordsbakgrunden. </para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gosdeskback-16">
      <title>L&auml;gga till en fil eller en mapp p&aring; skrivbordsbakgrunden</title>
      <indexterm>
        <primary>skrivbordsbakgrund</primary>
        <secondary>l&auml;gga till en fil eller mapp p&aring;</secondary>
      </indexterm>
      <indexterm>
        <primary>skrivbordsbakgrundsobjekt </primary>
        <secondary>filer och mappar</secondary>
      </indexterm>
      <para>I f&ouml;ljande avsnitt beskrivs hur du kan l&auml;gga till filobjekt och mappobjekt p&aring; skrivbordsbakgrunden.</para>
      <sect3 id="gosdeskback-18">
        <title>S&aring; h&auml;r flyttar du en fil eller mapp till skrivbordsbakgrunden</title>
        <indexterm>
          <primary>skrivbordsbakgrund</primary>
          <secondary>flytta en fil eller mapp till</secondary>
        </indexterm>
        <para>Du kan flytta en fil eller mapp fr&aring;n ett <application>Nautilus</application>-f&ouml;nster till skrivbordsbakgrunden. Om du vill flytta en fil eller mapp till skrivbordsbakgrunden g&ouml;r du f&ouml;ljande: </para>
        <orderedlist>
          <listitem>
            <para>&Ouml;ppna ett <application>Nautilus</application>-f&ouml;nster. </para>
          </listitem>
          <listitem>
            <para>Visa den fil eller mapp som du vill flytta i visningspanelen.</para>
          </listitem>
          <listitem>
            <para>Dra filen eller mappen till skrivbordsbakgrunden. Ikonen f&ouml;r filen eller mappen flyttas till skrivbordsbakgrunden. Filen eller mappen flyttas till skrivbordsbakgrundskatalogen. </para>
            <para>Du kan ocks&aring; markera filen eller mappen och sedan v&auml;lja <menuchoice><guimenu> Redigera</guimenu><guimenuitem>Klipp ut filer</guimenuitem></menuchoice>. H&ouml;gerklicka p&aring; valfritt skrivbordsbakgrundsobjekt och v&auml;lj sedan <guimenuitem>Klistra in filer</guimenuitem>. </para>
          </listitem>
        </orderedlist>
<!--<para><emphasis>Question</emphasis>: Do we need to document To Move a File or Folder>>From&lt;&lt; the Desktop Background? (with cut file and paste file)</para>
<para>What about Cut, Copy and Paste solely in reference to the desktop background.
Eg, to create a copy of a file by copying it from the desktop background,
then pasting it?</para>-->
      </sect3>
      <sect3 id="gosdeskback-17">
        <title>S&aring; h&auml;r kopierar du en fil eller mapp till skrivbordsbakgrunden</title>
        <indexterm>
          <primary>skrivbordsbakgrund</primary>
          <secondary>kopiera en fil eller mapp till</secondary>
        </indexterm>
        <para>Du kan kopiera en fil eller mapp fr&aring;n ett <application>Nautilus</application>-f&ouml;nster till skrivbordsbakgrunden. Om du vill kopiera en fil eller mapp till skrivbordsbakgrunden g&ouml;r du f&ouml;ljande: </para>
        <orderedlist>
          <listitem>
            <para>&Ouml;ppna ett <application>Nautilus</application>-f&ouml;nster. </para>
          </listitem>
          <listitem>
            <para>Visa den fil eller mapp som du vill flytta i visningspanelen.</para>
          </listitem>
          <listitem>
            <para>H&aring;ll ned <keycap>Control</keycap> och dra sedan filen eller mappen till skrivbordsbakgrunden. En ikon f&ouml;r filen eller mappen l&auml;ggs till p&aring; skrivbordsbakgrunden. Filen eller mappen kopieras till skrivbordsbakgrundskatalogen. </para>
            <para>Du kan ocks&aring; markera filen eller mappen och sedan v&auml;lja <menuchoice><guimenu> Redigera</guimenu><guimenuitem>Kopiera filer</guimenuitem></menuchoice>. H&ouml;gerklicka p&aring; valfritt skrivbordsbakgrundsobjekt och v&auml;lj sedan <guimenuitem>Klistra in filer</guimenuitem>.</para>
          </listitem>
        </orderedlist>
      </sect3>
      <sect3 id="gosdeskback-19">
        <title>S&aring; h&auml;r skapar du ett mappobjekt p&aring; skrivbordsbakgrunden</title>
        <indexterm>
          <primary>skrivbordsbakgrund</primary>
          <secondary>skapa en mapp p&aring;</secondary>
        </indexterm>
        <para>Om du vill skapa ett mappobjekt h&ouml;gerklickar du p&aring; skrivbordsbakgrunden f&ouml;r att &ouml;ppna <guimenu>Skrivbordsbakgrund</guimenu>-menyn. V&auml;lj <guimenuitem>Ny mapp</guimenuitem>. En <guilabel>namnl&ouml;s</guilabel> mapp l&auml;ggs till p&aring; skrivbordsbakgrunden. Ange namnet f&ouml;r den nya mappen och tryck sedan p&aring; <keycap>Retur</keycap>. Mappen visas med det nya namnet. Den nya mappen lagras i skrivbordsbakgrundskatalogen.</para>
      </sect3>
    </sect2>
    <sect2 id="gosdeskback-25">
      <title>S&aring; h&auml;r tar du bort ett objekt fr&aring;n skrivbordsbakgrunden</title>
      <indexterm>
        <primary>skrivbordsbakgrund</primary>
        <secondary>ta bort ett objekt fr&aring;n</secondary>
      </indexterm>
      <indexterm>
        <primary>skrivbordsbakgrundsobjekt </primary>
        <secondary>ta bort</secondary>
      </indexterm>
      <para>Du tar bort ett objekt fr&aring;n skrivbordsbakgrunden genom att h&ouml;gerklicka p&aring; objektet och sedan v&auml;lja <guimenuitem> Flytta till papperskorgen</guimenuitem>. Du kan ocks&aring; dra objektet till <guilabel> papperskorgen</guilabel>.</para>
    </sect2>
    <sect2 id="gosdeskback-86">
      <title>S&aring; h&auml;r raderar du ett objekt fr&aring;n skrivbordsbakgrunden</title>
      <indexterm>
        <primary>skrivbordsbakgrund</primary>
        <secondary>radera ett objekt fr&aring;n</secondary>
      </indexterm>
      <indexterm>
        <primary>skrivbordsbakgrundsobjekt </primary>
        <secondary>radera</secondary>
      </indexterm>
      <para>N&auml;r du raderar ett objekt fr&aring;n skrivbordsbakgrunden flyttas objektet inte till <guilabel> papperskorgen</guilabel>, utan tas omedelbart bort fr&aring;n skrivbordsbakgrunden. Menyalternativet <guimenuitem>Ta bort</guimenuitem> &auml;r endast tillg&auml;ngligt om du markerar alternativet <guilabel>Inkludera kommandot Ta bort som f&ouml;rbig&aring;r papperskorgen</guilabel> i <application>Nautilus</application>-dialogrutan <guilabel>Inst&auml;llningar</guilabel>. </para>
      <para>Du raderar ett objekt fr&aring;n skrivbordsbakgrunden genom att h&ouml;gerklicka p&aring; objektet och sedan v&auml;lja <guimenuitem>Ta bort</guimenuitem>. </para>
    </sect2>
  </sect1>
  <sect1 id="gosdeskback-8">
    <title>Anv&auml;nda papperskorgen p&aring; skrivbordsbakgrunden</title>
    <indexterm>
      <primary>skrivbordsbakgrund</primary>
      <secondary>anv&auml;nda papperskorgen</secondary>
    </indexterm>
    <indexterm>
      <primary>Papperskorg</primary>
      <secondary>anv&auml;nda p&aring; skrivbordsbakgrunden</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_trash_launcher.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Papperskorg-ikonen för Nautilus.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Du kan flytta f&ouml;ljande objekt till <guilabel>Papperskorgen</guilabel>:</para>
    <itemizedlist>
      <listitem>
        <para>Filer</para>
      </listitem>
      <listitem>
        <para>Mappar</para>
      </listitem>
      <listitem>
        <para>Skrivbordsbakgrundsobjekt</para>
      </listitem>
    </itemizedlist>
    <para>Om du beh&ouml;ver h&auml;mta en fil fr&aring;n <guilabel>Papperskorgen</guilabel> kan du visa <guilabel>Papperskorgen</guilabel> och flytta filen fr&aring;n <guilabel>Papperskorgen</guilabel>. N&auml;r du t&ouml;mmer <guilabel>Papperskorgen</guilabel> raderar du objekten i <guilabel> Papperskorgen</guilabel> permanent. </para>
    <sect2 id="gosdeskback-44">
      <title>S&aring; h&auml;r visar du papperskorgen</title>
      <indexterm>
        <primary>Papperskorg</primary>
        <secondary>visa</secondary>
      </indexterm>
      <para>Du kan visa inneh&aring;llet i <guilabel>Papperskorgen</guilabel> p&aring; f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>Fr&aring;n skrivbordsbakgrunden</para>
          <para>Dubbelklicka p&aring; objektet <guilabel>Papperskorg</guilabel> p&aring; skrivbordsbakgrunden. Inneh&aring;llet i <guilabel>papperskorgen</guilabel> visas i ett <application> Nautilus</application>-f&ouml;nster.</para>
        </listitem>
        <listitem>
          <para>Fr&aring;n ett <application>Nautilus</application>-f&ouml;nster</para>
          <para>V&auml;lj <menuchoice><guimenu>G&aring;</guimenu><guimenuitem>Papperskorg</guimenuitem></menuchoice>. Inneh&aring;llet i <guilabel>Papperskorgen</guilabel> visas i f&ouml;nstret.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosdeskback-10">
      <title>S&aring; h&auml;r t&ouml;mmer du papperskorgen</title>
      <indexterm>
        <primary>Papperskorg</primary>
        <secondary>t&ouml;mma</secondary>
      </indexterm>
      <para>Du kan t&ouml;mma inneh&aring;llet i <guilabel>Papperskorgen</guilabel> p&aring; f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>Fr&aring;n skrivbordsbakgrunden</para>
          <para>H&ouml;gerklicka p&aring; <guilabel>Papperskorgen</guilabel> och v&auml;lj <guimenuitem>T&ouml;m papperskorgen</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>Fr&aring;n ett <application>Nautilus</application>-f&ouml;nster</para>
          <para>V&auml;lj <menuchoice><guimenu>Arkiv</guimenu><guimenuitem>T&ouml;m papperskorgen</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosdeskback-9">
    <title>Anv&auml;nda Skrivbordsbakgrund-menyn</title>
    <indexterm>
      <primary>skrivbordsbakgrund</primary>
      <secondary>anv&auml;nda Skrivbordsbakgrund-menyn</secondary>
    </indexterm>
    <indexterm>
      <primary>Skrivbordsbakgrund-menyn</primary>
      <secondary>beskrivning</secondary>
    </indexterm>
    <indexterm>
      <primary>menyer</primary>
      <secondary>Skrivbordsbakgrund-menyn</secondary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/file_manager_menu.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Skrivbordsbakgrund-menyn. Sammanhanget beskriver bilden.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>Skrivbordsbakgrund-menyn</primary>
      <secondary>illustration </secondary>
    </indexterm>
    <para>Du &ouml;ppnar <guimenu>Skrivbordsbakgrund</guimenu>-menyn genom att h&ouml;gerklicka i ett tomt utrymme p&aring; skrivbordsbakgrunden. Du kan utnyttja menyn <guimenu>Skrivbordsbakgrund</guimenu> f&ouml;r att utf&ouml;ra &aring;tg&auml;rder p&aring; skrivbordsbakgrunden.</para>
    <para><xref linkend="gosdeskback-TBL-85"/> beskriver alternativen p&aring; <guimenu> Skrivbordsbakgrund</guimenu>-menyn.</para>
    <table frame="topbot" id="gosdeskback-TBL-85">
      <title>Alternativ p&aring; Skrivbordsbakgrund-menyn</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="35.94*"/>
        <colspec colname="colspec1" colwidth="64.06*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Alternativ</para>
            </entry>
            <entry valign="top">
              <para> Funktion </para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Nytt f&ouml;nster</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>&Ouml;ppnar ett nytt <application>Nautilus</application>-f&ouml;nster som visar hemplatsen.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Ny mapp </guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Skapar ett nytt mappobjekt p&aring; skrivbordsbakgrunden. Mappen skapas i skrivbordsbakgrundskatalogen.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Nytt terminalf&ouml;nster </guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Startar en <application>GNOME-terminal</application>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Ny programstartare</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Skapar en programstartare p&aring; skrivbordsbakgrunden. Mer information finns i <xref linkend="gosdeskback-3"/>.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guisubmenu>Skript</guisubmenu>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>&Ouml;ppnar en undermeny med skript som du kan k&ouml;ra.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>St&auml;da upp efter namn</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Ordnar objekten p&aring; skrivbordsbakgrunden alfabetiskt efter namn.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Klipp ut filer</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Tar bort markerade filer fr&aring;n mappen eller skrivbordsbakgrunden och placerar dem i bufferten.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Kopiera filer</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>Kopierar markerade filer frnn mappen eller skrivbordsbakgrunden och placerar dem i bufferten.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Klistra in filer</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Placerar filerna i bufferten i den markerade mappen eller p&aring; skrivbordsbakgrunden.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Diskar</guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para>G&ouml;r att du kan montera disketter och andra flyttbara medier.</para>
            </entry>
          </row>
          <row>
            <entry colname="colspec0" valign="top">
              <para>
                <guimenuitem>Byt skrivbordsbakgrund </guimenuitem>
              </para>
            </entry>
            <entry colname="colspec1" valign="top">
              <para> Startar inst&auml;llningsverktyget <application> Bakgrund</application> som du kan anv&auml;nda f&ouml;r att byta skrivbordsbakgrunden.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Anv&auml;nd standardbakgrund </guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>&Aring;terst&auml;ller skrivbordsbakgrunden till det senaste m&ouml;nster du valde i dialogrutan <guilabel>Bakgrunder och emblem</guilabel>. Du kan komma &aring;t dialogrutan <guilabel>Bakgrunder och emblem</guilabel> fr&aring;n <application> Nautilus</application>-f&ouml;nster.</para>
<!--<para><emphasis>Comment:</emphasis> It does not reset the last color that you chose from the <guilabel>Backgrounds and Emblems</guilabel> dialog.</para>-->
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
  <sect1 id="gosdeskback-12">
    <title>&Auml;ndra m&ouml;nster eller f&auml;rg f&ouml;r skrivbordsbakgrunden</title>
    <indexterm>
      <primary>skrivbordsbakgrund</primary>
      <secondary>&auml;ndra m&ouml;nster eller f&auml;rg</secondary>
    </indexterm>
    <indexterm>
      <primary>bakgrunder</primary>
      <secondary>byta skrivbordsbakgrund</secondary>
    </indexterm>
    <para>Du kan &auml;ndra m&ouml;nster eller f&auml;rg f&ouml;r skrivbordsbakgrunden efter dina &ouml;nskem&aring;l. <application> Nautilus</application> inneh&aring;ller bakgrundsm&ouml;nster och -f&auml;rger som du kan anv&auml;nda f&ouml;r att &auml;ndra utseendet p&aring; skrivbordsbakgrunden. </para>
    <para>Du kan &auml;ndra m&ouml;nster eller f&auml;rg f&ouml;r skrivbordsbakgrunden p&aring; f&ouml;ljande s&auml;tt. </para>
    <itemizedlist>
      <listitem>
        <para>Dra ett m&ouml;nster eller en f&auml;rg fr&aring;n ett annat f&ouml;nster eller en annan dialogruta till skrivbordsbakgrunden. </para>
        <para>Om skrivbordsbakgrunden &auml;r en f&auml;rg kan du skapa en toningseffekt fr&aring;n en f&auml;rg till skrivbordsbakgrundens f&auml;rg. En toningseffekt &auml;r en visuell effekt d&auml;r en f&auml;rg gradvis &ouml;verg&aring;r i en annan f&auml;rg. Du skapar en toningseffekt p&aring; skrivbordsbakgrunden genom att dra en f&auml;rg till en av kanterna p&aring; sk&auml;rmen. F&auml;rgen tonas fr&aring;n den kant som du drar den till mot den motsatta kanten av sk&auml;rmen.</para>
        <para>Innan du drar en f&auml;rg till en sk&auml;rmkant b&ouml;r du kontrollera om det finns n&aring;gon kantpanel i sk&auml;rmkanten. Om det finns en kantpanel i sk&auml;rmkanten m&aring;ste du d&ouml;lja panelen innan du drar f&auml;rgen.</para>
      </listitem>
      <listitem>
        <para>Anv&auml;nd inst&auml;llningsverktyget <application>Bakgrund</application>. </para>
      </listitem>
      <listitem>
        <para>V&auml;lj ett m&ouml;nster eller en f&auml;rg f&ouml;r bakgrunden i dialogrutan <guilabel> Bakgrunder och emblem</guilabel>. Om du vill &auml;ndra m&ouml;nster eller f&auml;rg f&ouml;r skrivbordsbakgrunden g&ouml;r du f&ouml;ljande: </para>
        <orderedlist>
          <listitem>
            <para>&Ouml;ppna ett <application>Nautilus</application>-f&ouml;nster.</para>
          </listitem>
          <listitem>
            <para>V&auml;lj <menuchoice><guimenu>Redigera</guimenu><guimenuitem>Bakgrunder och emblem</guimenuitem></menuchoice>. Dialogf&ouml;nstret <guilabel>Bakgrunder och emblem</guilabel> visas. </para>
          </listitem>
          <listitem>
            <para>Klicka p&aring; knappen <guibutton> M&ouml;nster</guibutton> f&ouml;r att visa en lista &ouml;ver m&ouml;nster som du kan anv&auml;nda. Klicka p&aring; knappen <guibutton>F&auml;rger</guibutton> f&ouml;r att visa en lista &ouml;ver f&auml;rger som du kan anv&auml;nda.</para>
          </listitem>
          <listitem>
            <para>Du &auml;ndrar skrivbordsbakgrunden till ett m&ouml;nster genom att dra m&ouml;nstret till skrivbordsbakgrunden. Du &auml;ndrar skrivbordsbakgrunden till en f&auml;rg genom att dra f&auml;rgen till skrivbordsbakgrunden.</para>
          </listitem>
          <listitem>
            <para>Klicka p&aring; <guibutton>St&auml;ng</guibutton> f&ouml;r att st&auml;nga dialogf&ouml;nstret.</para>
          </listitem>
        </orderedlist>
      </listitem>
    </itemizedlist>
  </sect1>
</chapter>
