<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosmetacity-1">
  <title>Arbeta med f&ouml;nster</title>
  <highlights>
    <para>I det h&auml;r kapitlet beskrivs hur du anv&auml;nder f&ouml;nster p&aring; skrivbordet. Du kan anv&auml;nda flera olika sorters f&ouml;nsterhanterare med GNOME-skrivbordet, till exempel <application>Metacity</application> och <application>Sawfish</application>. M&aring;nga av funktionerna i <application>Metacity</application> finns &auml;ven i <application>Sawfish</application>. I det h&auml;r kapitlet beskrivs de funktioner som finns i f&ouml;nsterhanteraren <application>Metacity</application>.</para>
  </highlights>
  <sect1 id="gosmetacity-712">
    <title>F&ouml;nster och arbetsytor</title>
    <indexterm>
      <primary>f&ouml;nster</primary>
      <secondary>introduktion</secondary>
    </indexterm>
    <indexterm>
      <primary>arbetsytor</primary>
      <secondary>introduktion</secondary>
    </indexterm>
    <para>Du kan visa flera f&ouml;nster samtidigt p&aring; skrivbordet. F&ouml;nstren visas i underavdelningar p&aring; skrivbordet som kallas arbetsytor. En arbetsyta &auml;r ett speciellt omr&aring;de som du kan arbeta i. Varje arbetsyta p&aring; skrivbordet har samma skrivbordsbakgrund, paneler och menyer. Du kan emellertid k&ouml;ra olika program och &ouml;ppna olika f&ouml;nster p&aring; varje arbetsyta. Du kan bara visa en arbetsyta &aring;t g&aring;ngen p&aring; skrivbordet, men andra arbetsytor kan ha &ouml;ppna f&ouml;nster. </para>
    <para>Panelprogrammet <application>Arbetsytebytare</application> visar en &ouml;versikt &ouml;ver de f&ouml;nster och arbetsytor som du har &ouml;ppna, enligt bilden i <xref linkend="gosmetacity-FIG-717"/>. </para>
    <figure id="gosmetacity-FIG-717">
      <title>Panelprogrammet Arbetsytebytare</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/workspace_switcher_applet.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Panelprogrammet Arbetsytebytare. Texten beskriver bilden.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <para>Du kan l&auml;gga till arbetsytor n&auml;r du vill. Om du vill l&auml;gga till arbetsytor p&aring; skrivbordet h&ouml;gerklickar du p&aring; panelprogrammet <application>Arbetsytebytare</application> och v&auml;ljer <guimenuitem>Inst&auml;llningar</guimenuitem>. Dialogf&ouml;nstret <guilabel>Inst&auml;llningar f&ouml;r arbetsytebytare</guilabel> visas. Anv&auml;nd rotationsrutan <guilabel>Antal arbetsytor</guilabel> f&ouml;r att ange hur m&aring;nga arbetsytor du vill ha.</para>
    <sect2 id="gosmetacity-15">
      <title>F&ouml;nsterhanterare och hur de fungerar</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>f&ouml;nsterhanterare</secondary>
      </indexterm>
      <para>En f&ouml;nsterhanterare kontrollerar hur f&ouml;nster visas och fungerar. F&ouml;nsterhanteraren styr var f&ouml;nster finns, vilket f&ouml;nster som &auml;r aktivt och vilket tema som anv&auml;nds f&ouml;r f&ouml;nsterramarna. F&ouml;nsterramen inneh&aring;ller knappar som du anv&auml;nder f&ouml;r att utf&ouml;ra vanliga &aring;tg&auml;rder som att flytta, st&auml;nga och &auml;ndra storlek p&aring; f&ouml;nster.</para>
      <para>Du kan konfigurera vissa inst&auml;llningar f&ouml;r f&ouml;nsterhanterare i inst&auml;llningsverktyget <application>F&ouml;nsterfokus</application>. I den h&auml;r handboken beskrivs de funktioner som finns i standardkonfigurationen f&ouml;r f&ouml;nsterhanteraren <application>Metacity</application>. Standardkonfigurationen anges i inst&auml;llningsverktyget <application>F&ouml;nsterfokus</application>. I handboken beskrivs ocks&aring; standardfunktionerna i temat Crux.</para>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-713">
    <title>Olika sorters f&ouml;nster</title>
    <indexterm>
      <primary>f&ouml;nster</primary>
      <secondary>olika sorter</secondary>
    </indexterm>
    <para>Skrivbordet har f&ouml;ljande f&ouml;nstertyper: </para>
    <itemizedlist>
      <listitem>
        <para>Programf&ouml;nster </para>
        <para>N&auml;r du startar ett program &ouml;ppnas ett programf&ouml;nster. F&ouml;nsterhanteraren l&auml;gger till en ram runt programf&ouml;nstret. Programf&ouml;nstret har som standard en titelrad l&auml;ngst upp. Titelraden inneh&aring;ller knappar som du kan anv&auml;nda om du vill g&ouml;ra n&aring;got med f&ouml;nstret. Med knapparna i ramen till ett programf&ouml;nster kan du utf&ouml;ra &aring;tg&auml;rder som att &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> eller st&auml;nga f&ouml;nstret. <guimenu>F&ouml;nstermenyn</guimenu> inneh&aring;ller ett antal &aring;tg&auml;rder som du kan utf&ouml;ra p&aring; f&ouml;nstret. </para>
      </listitem>
      <listitem>
        <para>Dialogf&ouml;nster</para>
        <para>Ett dialogf&ouml;nster &auml;r ett f&ouml;nster som du skriver in information eller kommandon i. Dialogf&ouml;nstret visas med en f&ouml;nsterram. </para>
        <para>Du kan anv&auml;nda den &ouml;vre kanten av ramen f&ouml;r att &auml;ndra f&ouml;nstret. Du kan till exempel flytta dialogf&ouml;nstret genom att anv&auml;nda titelraden. Ramen inneh&aring;ller ocks&aring; knappar, som du kan anv&auml;nda f&ouml;r att g&ouml;ra f&ouml;ljande:</para>
        <itemizedlist>
          <listitem>
            <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. </para>
          </listitem>
          <listitem>
            <para>St&auml;nga dialogf&ouml;nstret.</para>
          </listitem>
        </itemizedlist>
        <para>Vanligtvis &ouml;ppnar du ett dialogf&ouml;nster fr&aring;n ett programf&ouml;nster. N&auml;r du &ouml;ppnar ett dialogf&ouml;nster &auml;r det oftast h&ouml;jt och aktivt. Du m&aring;ste st&auml;nga vissa dialogf&ouml;nster innan du kan forts&auml;tta att anv&auml;nda programmet. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosmetacity-16">
      <title>F&ouml;nsterramar</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>ramar</secondary>
      </indexterm>
      <para>En f&ouml;nsterram &auml;r en kant runt ett f&ouml;nster. F&ouml;nsterramen har en titelrad. Titelraden inneh&aring;ller knappar som du anv&auml;nder f&ouml;r att arbeta med f&ouml;nstret.</para>
      <sect3 id="gosmetacity-10">
        <title>Teman</title>
        <indexterm>
          <primary>f&ouml;nster</primary>
          <secondary>teman</secondary>
        </indexterm>
        <para>Du kan anv&auml;nda flera olika teman p&aring; f&ouml;nsterramarna. Temat avg&ouml;r hur ramarna ser ut. Om du vill v&auml;lja ett tema f&ouml;r alla f&ouml;nsterramar v&auml;ljer du <menuchoice><guimenu>Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guimenuitem>Tema</guimenuitem></menuchoice>. </para>
        <para>Standardtemat &auml;r Crux. I den h&auml;r handboken beskrivs de funktioner som finns i temat Crux. </para>
      </sect3>
      <sect3 id="gosmetacity-17">
        <title>Kontrollelement</title>
        <indexterm>
          <primary>f&ouml;nster</primary>
          <secondary>ramkontrollelement</secondary>
        </indexterm>
        <para>Du kan anv&auml;nda f&ouml;nsterramen f&ouml;r att utf&ouml;ra olika &aring;tg&auml;rder med f&ouml;nstret. Titelraden inneh&aring;ller till exempel ett flertal knappar.  I f&ouml;ljande bild visas titelraden f&ouml;r ett programf&ouml;nster. </para>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/titlebar_anno_window.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Titelrad för fönster. Bildtexter: knappen Fönstermeny, titelrad, knapparna Minimera, Maximera och Stäng fönster.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
        <para>Dialogf&ouml;nster inneh&aring;ller ocks&aring; vissa av kontrollelementen f&ouml;r f&ouml;nsterramar. I <xref linkend="gosmetacity-TBL-1"/> beskrivs de aktiva kontrollelementen f&ouml;r f&ouml;nsterramar, fr&aring;n v&auml;nster till h&ouml;ger.</para>
        <table frame="topbot" id="gosmetacity-TBL-1">
          <title>Kontrollelement f&ouml;r f&ouml;nsterramar</title>
          <tgroup cols="2" colsep="0" rowsep="0">
            <colspec colname="colspec0" colwidth="41.65*"/>
            <colspec colname="colspec1" colwidth="58.35*"/>
            <thead>
              <row rowsep="1">
                <entry valign="top">
                  <para>Kontrollelement</para>
                </entry>
                <entry valign="top">
                  <para>Beskrivning </para>
                </entry>
              </row>
            </thead>
            <tbody>
              <row>
                <entry colname="colspec0" valign="top">
                  <para>Knappen <guibutton>F&ouml;nstermeny</guibutton></para>
                </entry>
                <entry colname="colspec1" valign="top">
                  <para>Klicka p&aring; knappen f&ouml;r att &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. </para>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Titelrad</para>
                </entry>
                <entry valign="top">
                  <para> Du kan anv&auml;nda titelraden f&ouml;r att utf&ouml;ra f&ouml;ljande &aring;tg&auml;rder: </para>
                  <itemizedlist>
                    <listitem>
                      <para>Om du vill g&ouml;ra ett f&ouml;nster aktivt klickar du p&aring; dess titelrad.</para>
                    </listitem>
                    <listitem>
                      <para>Om du vill flytta ett f&ouml;nster tar du tag i titelraden och drar f&ouml;nstret till &ouml;nskad plats. </para>
                    </listitem>
                    <listitem>
                      <para>Om du vill skugga ett f&ouml;nster dubbelklickar du p&aring; dess titelrad. Om du vill avskugga ett f&ouml;nster dubbelklickar du p&aring; dess titelrad. </para>
                    </listitem>
                  </itemizedlist>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Knappen <guibutton>Minimera</guibutton></para>
                </entry>
                <entry valign="top">
                  <para>Klicka p&aring; knappen <guibutton>Minimera</guibutton> om du vill minimera f&ouml;nstret. </para>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Knappen <guibutton>Maximera</guibutton></para>
                </entry>
                <entry valign="top">
                  <para>Klicka p&aring; knappen <guibutton>Maximera</guibutton> om du vill maximera f&ouml;nstret. </para>
                </entry>
              </row>
              <row>
                <entry colname="colspec0">
                  <para>Knappen <guibutton>St&auml;ng f&ouml;nster</guibutton></para>
                </entry>
                <entry colname="colspec1">
                  <para>Klicka p&aring; knappen <guibutton>St&auml;ng f&ouml;nster</guibutton> om du vill st&auml;nga f&ouml;nstret. </para>
                </entry>
              </row>
              <row>
                <entry valign="top">
                  <para>Kant</para>
                </entry>
                <entry valign="top">
                  <para> Kanten runt f&ouml;nstret. Anv&auml;nd kanten f&ouml;r att utf&ouml;ra f&ouml;ljande &aring;tg&auml;rder: </para>
                  <itemizedlist>
                    <listitem>
                      <para>Om du vill &auml;ndra storlek p&aring; f&ouml;nstret tar du tag i kanten och drar till &ouml;nskad storlek. </para>
                    </listitem>
                    <listitem>
                      <para>Om du vill &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> h&ouml;gerklickar du p&aring; kanten.</para>
                    </listitem>
                  </itemizedlist>
                </entry>
              </row>
              <row>
                <entry colname="colspec0" valign="top">
                  <para>F&ouml;nsterinneh&aring;ll</para>
                </entry>
                <entry colname="colspec1">
                  <para>Omr&aring;det innanf&ouml;r f&ouml;nsterramen. Anv&auml;nd f&ouml;nsterinneh&aring;llet f&ouml;r att utf&ouml;ra f&ouml;ljande &aring;tg&auml;rder:</para>
                  <itemizedlist>
                    <listitem>
                      <para>Om du vill flytta ett f&ouml;nster h&aring;ller du ned <keycap>Alt</keycap>-tangenten, klickar i f&ouml;nstrets inneh&aring;ll och drar f&ouml;nstret till &ouml;nskad plats.</para>
                    </listitem>
                    <listitem>
                      <para>Om du vill &auml;ndra storlek p&aring; f&ouml;nstret h&aring;ller du ned <keycap>Alt</keycap>-tangenten och klickar med den mittersta musknappen i det h&ouml;rn som du vill &auml;ndra storlek p&aring;. &Auml;ndra storlek p&aring; f&ouml;nstret genom att dra fr&aring;n det h&ouml;rn som du klickade i.</para>
                    </listitem>
                    <listitem>
                      <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> genom att h&aring;lla ned <keycap>Alt</keycap>-tangenten och h&ouml;gerklicka i f&ouml;nsterinneh&aring;llet.</para>
                    </listitem>
                  </itemizedlist>
                </entry>
              </row>
            </tbody>
          </tgroup>
        </table>
      </sect3>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-714">
    <title>Menyer och panelprogram f&ouml;r att arbeta med f&ouml;nster och arbetsytor</title>
    <indexterm>
      <primary>f&ouml;nster</primary>
      <secondary>panelprogram och menyer f&ouml;r att arbeta med</secondary>
    </indexterm>
    <para>I det h&auml;r avsnittet beskrivs menyer och panelprogram som du anv&auml;nder f&ouml;r att arbeta med f&ouml;nster och arbetsytor.</para>
    <sect2 id="gosmetacity-24">
      <title>Menyn F&ouml;nster</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/window_menu.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>F&ouml;nstermenyn. Menyobjekten Stäng, Minimera, Maximera, Skugga, Flytta, Ändra storlek, Placera på alla arbetsytor, Flytta till arbetsytenamn.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>F&ouml;nstermeny</secondary>
      </indexterm>
      <indexterm>
        <primary>menyer</primary>
        <secondary>F&ouml;nstermeny</secondary>
      </indexterm>
      <para><guimenu>F&ouml;nstermenyn</guimenu> &auml;r en meny med kommandon som du anv&auml;nder f&ouml;r att utf&ouml;ra olika &aring;tg&auml;rder f&ouml;r f&ouml;nster. &Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> p&aring; n&aring;got av f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>Klicka p&aring; knappen <guibutton>F&ouml;nstermeny</guibutton> i det f&ouml;nster som du vill arbeta med.</para>
        </listitem>
        <listitem>
          <para>Tryck p&aring; <keycombo><keycap>Alt</keycap><keycap>blanksteg</keycap></keycombo>.</para>
        </listitem>
        <listitem>
          <para>H&aring;ll ned <keycap>Alt</keycap>-tangenten och h&ouml;gerklicka p&aring; en del av det f&ouml;nster som du vill arbeta med. </para>
        </listitem>
      </itemizedlist>
      <para>I <xref linkend="gosmetacity-TBL-25"/> beskrivs kommandon och undermenyer p&aring; <guimenu>F&ouml;nstermenyn</guimenu>.</para>
      <table frame="topbot" id="gosmetacity-TBL-25">
        <title>Kommandon och undermenyer p&aring; F&ouml;nstermenyn</title>
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec2" colwidth="32.34*"/>
          <colspec colname="colspec3" colwidth="67.66*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Alternativ</para>
              </entry>
              <entry valign="top">
                <para> Funktion </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>
                  <guimenuitem>Minimera</guimenuitem>
                </para>
              </entry>
              <entry valign="top">
                <para>Minimerar f&ouml;nstret.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para><guimenuitem>Maximera</guimenuitem> eller <guimenuitem>Avmaximera</guimenuitem></para>
              </entry>
              <entry valign="top">
                <para>Maximerar f&ouml;nstret. Om f&ouml;nstret redan &auml;r maximerat v&auml;ljer du <guimenuitem>Avmaximera</guimenuitem> f&ouml;r att &aring;terst&auml;lla det till dess tidigare storlek. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para><guimenuitem>Skugga</guimenuitem> eller <guimenuitem>Avskugga</guimenuitem></para>
              </entry>
              <entry valign="top">
                <para>Skuggar f&ouml;nstret. Om f&ouml;nstret redan &auml;r skuggat v&auml;ljer du <guimenuitem>Avskugga</guimenuitem> f&ouml;r att &aring;terst&auml;lla det till dess tidigare storlek. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>
                  <guimenuitem>Flytta</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Aktiverar piltangenterna s&aring; att du kan flytta f&ouml;nstret med dem.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>
                  <guimenuitem>&Auml;ndra storlek</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Aktiverar piltangenterna s&aring; att du kan &auml;ndra storlek p&aring; f&ouml;nstret med dem.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>
                  <guimenuitem>St&auml;ng</guimenuitem>
                </para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>St&auml;nger f&ouml;nstret.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para><guimenuitem>Placera p&aring; alla arbetsytor</guimenuitem> eller <guimenuitem>Endast p&aring; denna arbetsyta</guimenuitem></para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Placerar f&ouml;nstret p&aring; alla arbetsytor. Om f&ouml;nstret redan finns p&aring; alla arbetsytor v&auml;ljer du <guimenuitem>Endast p&aring; denna arbetsyta</guimenuitem> f&ouml;r att placera det endast p&aring; den aktuella arbetsytan.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para><guimenuitem>Flytta till <replaceable>arbetsytenamn</replaceable></guimenuitem> eller <guimenuitem>Endast p&aring; <replaceable>arbetsytenamn</replaceable></guimenuitem></para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Flyttar f&ouml;nstret till den arbetsyta du anger. Om f&ouml;nstret finns p&aring; alla arbetsytor v&auml;ljer du <guimenuitem>Endast p&aring; <replaceable>arbetsytenamn</replaceable></guimenuitem> f&ouml;r att placera det p&aring; &ouml;nskad arbetsyta.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
    </sect2>
    <sect2 id="gosmetacity-18">
      <title>Panelprogrammet F&ouml;nsterlista</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>panelprogrammet F&ouml;nsterlista</secondary>
        <see>panelprogrammet F&ouml;nsterlista</see>
      </indexterm>
      <indexterm>
        <primary>panelprogrammet F&ouml;nsterlista</primary>
        <secondary>introduktion</secondary>
      </indexterm>
      <indexterm>
        <primary> f&ouml;nsterlistor</primary>
        <secondary>panelprogrammet F&ouml;nsterlista</secondary>
      </indexterm>
      <indexterm>
        <primary>panelprogram</primary>
        <secondary>F&ouml;nsterlista</secondary>
      </indexterm>
      <para>I <application>F&ouml;nsterlistan</application> visas en knapp f&ouml;r varje &ouml;ppet programf&ouml;nster. Du kan anv&auml;nda <application>F&ouml;nsterlistan</application> f&ouml;r att utf&ouml;ra f&ouml;ljande &aring;tg&auml;rder:</para>
      <itemizedlist>
        <listitem>
          <para>Minimera ett f&ouml;nster</para>
          <para>Klicka p&aring; den knapp som motsvarar f&ouml;nstret.</para>
        </listitem>
        <listitem>
          <para>&Aring;terst&auml;lla ett minimerat f&ouml;nster</para>
          <para>Klicka p&aring; den knapp som motsvarar f&ouml;nstret.</para>
        </listitem>
        <listitem>
          <para>Aktivera ett f&ouml;nster</para>
          <para>Klicka p&aring; den knapp som motsvarar f&ouml;nstret.</para>
        </listitem>
      </itemizedlist>
      <para>N&auml;r du &ouml;ppnar ett programf&ouml;nster visar <application>F&ouml;nsterlistan</application> en knapp som representerar f&ouml;nstret. Knapparna i f&ouml;nsterlistan visar vilka programf&ouml;nster som &auml;r &ouml;ppna. Du kan visa vilka f&ouml;nster som &auml;r &ouml;ppna &auml;ven om vissa av dem &auml;r minimerade eller dolda av andra f&ouml;nster. I <application>F&ouml;nsterlistan</application> kan du visa knappar f&ouml;r f&ouml;nster p&aring; den aktuella arbetsytan eller alla arbetsytor. Om du vill v&auml;lja det h&auml;r alternativet m&aring;ste du &auml;ndra inst&auml;llningarna f&ouml;r <application>F&ouml;nsterlistan</application>.</para>
      <para>Du kan ocks&aring; h&ouml;gerklicka p&aring; en knapp i f&ouml;nsterlistan f&ouml;r att &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> f&ouml;r det f&ouml;nster som knappen representerar. N&auml;r du &ouml;ppnar <guimenu>F&ouml;nstermenyn</guimenu> fr&aring;n <application>F&ouml;nsterlistan</application> inneh&aring;ller <guimenu>F&ouml;nstermenyn</guimenu> inte kommandon f&ouml;r arbetsytor. Du hittar mer information om kommandon p&aring; <guimenu>F&ouml;nstermenyn</guimenu> i avsnittet <xref linkend="gosmetacity-24"/>.</para>
      <para><xref linkend="gosmetacity-FIG-8"/> visar <application>F&ouml;nsterlistan</application> med f&ouml;ljande &ouml;ppna f&ouml;nster:</para>
      <itemizedlist>
        <listitem>
          <para>
            <application>gedit</application>
          </para>
        </listitem>
        <listitem>
          <para>
            <application>Ordbok</application>
          </para>
        </listitem>
        <listitem>
          <para>
            <application>GHex</application>
          </para>
        </listitem>
        <listitem>
          <para>
            <application>GNOME-terminal</application>
          </para>
        </listitem>
      </itemizedlist>
      <figure id="gosmetacity-FIG-8">
        <title>Panelprogrammet F&ouml;nsterlista</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/window_list_applet.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Panelprogrammet Fönsterlista. Texten beskriver bilden.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Knapparna i panelprogrammet visar statusen f&ouml;r f&ouml;nstren. I <xref linkend="gosmetacity-TBL-3"/> beskrivs den information som knapparna i f&ouml;nsterlistan ger om de olika f&ouml;nstren. Exemplen i <xref linkend="gosmetacity-TBL-3"/> avser <xref linkend="gosmetacity-FIG-8"/>. </para>
      <indexterm>
        <primary>panelprogrammet F&ouml;nsterlista</primary>
        <secondary>f&ouml;nsterstatus, information </secondary>
      </indexterm>
      <table frame="topbot" id="gosmetacity-TBL-3">
        <title>Information om f&ouml;nsterstatus p&aring; knapparna i F&ouml;nsterlistan</title>
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="33*"/>
          <colspec colname="colspec1" colwidth="33*"/>
          <colspec colname="colspec2" colwidth="33*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Tillst&aring;nd</para>
              </entry>
              <entry valign="top">
                <para> Anger</para>
              </entry>
              <entry valign="top">
                <para>Exempel</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Knappen &auml;r intryckt.</para>
              </entry>
              <entry valign="top">
                <para>F&ouml;nstret har fokus.</para>
              </entry>
              <entry valign="top">
                <para>
                  <guilabel> gedit</guilabel>
                </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Hakparenteser runt f&ouml;nstertiteln.</para>
              </entry>
              <entry valign="top">
                <para>F&ouml;nstret &auml;r minimerat.</para>
              </entry>
              <entry valign="top">
                <para>
                  <guilabel> [Ordbok]</guilabel>
                </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Knappen &auml;r inte intryckt och det finns inga hakparenteser runt titeln.</para>
              </entry>
              <entry valign="top">
                <para>F&ouml;nstret visas och &auml;r inte minimerat.</para>
              </entry>
              <entry valign="top">
                <para>
                  <guilabel>ghex </guilabel>
                </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Siffra p&aring; knappen, inom parenteser. </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Knappen representerar en grupp med knappar. </para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>
                  <guilabel> Gnome-terminal (3)</guilabel>
                </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
      <sect3 id="gosmetacity-708">
        <title>Gruppera knappar</title>
        <indexterm>
          <primary>panelprogrammet F&ouml;nsterlista</primary>
          <secondary>gruppera knappar</secondary>
        </indexterm>
        <para>I <application>F&ouml;nsterlistan</application> kan du gruppera knappar som representerar f&ouml;nster i samma klass i en enda knapp i f&ouml;nsterlistan. Knappen <guibutton>Gnome-terminal</guibutton> i <xref linkend="gosmetacity-FIG-8"/> &auml;r ett exempel p&aring; en knapp som representerar en grupp med knappar. I f&ouml;ljande bild visas ett exempel p&aring; <application>F&ouml;nsterlista</application> med en &ouml;ppen knappgrupp:</para>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/window_list_group_applet.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Panelprogrammet Fönsterlista med en öppen knappgrupp.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
        <para>Om du vill &ouml;ppna en lista &ouml;ver f&ouml;nster i en grupp klickar du p&aring; den knapp i f&ouml;nsterlistan som motsvarar gruppen. Du kan klicka p&aring; objekt i listan f&ouml;r att aktivera, minimera och &aring;terst&auml;lla f&ouml;nster.</para>
        <para>Om du vill &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> f&ouml;r ett f&ouml;nster i en knappgrupp h&ouml;gerklickar du p&aring; den knapp i f&ouml;nsterlistan som motsvarar gruppen. Det visas en lista &ouml;ver de f&ouml;nster som finns i gruppen. Om du vill &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> f&ouml;r ett f&ouml;nster i gruppen klickar du p&aring; objektet i listan. N&auml;r du &ouml;ppnar <guimenu>F&ouml;nstermenyn</guimenu> fr&aring;n <application>F&ouml;nsterlistan</application> inneh&aring;ller <guimenu>F&ouml;nstermenyn</guimenu> inte kommandon f&ouml;r arbetsytor. Du hittar mer information om kommandon p&aring; <guimenu>F&ouml;nstermenyn</guimenu> i avsnittet <xref linkend="gosmetacity-24"/>.</para>
      </sect3>
    </sect2>
    <sect2 id="gosmetacity-20">
      <title>Panelprogrammet Arbetsytebytare</title>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>panelprogrammet Arbetsytebytare</secondary>
      </indexterm>
      <indexterm>
        <primary>panelprogram</primary>
        <secondary>Arbetsytebytare</secondary>
      </indexterm>
      <para><application>Arbetsytebytaren</application> visar en &ouml;versikt &ouml;ver alla arbetsytor, enligt <xref linkend="gosmetacity-FIG-722"/>. <xref linkend="gosmetacity-FIG-722"/> visar panelprogrammet n&auml;r GNOME-sessionen inneh&aring;ller fyra arbetsytor. Arbetsytorna visas som knappar i panelprogrammet. Bakgrunden f&ouml;r den knapp i panelprogrammet som representerar den aktuella arbetsytan &auml;r markerad. Den aktuella arbetsytan i <xref linkend="gosmetacity-FIG-722"/> &auml;r arbetsytan till v&auml;nster i panelprogrammet. Om du vill v&auml;xla till en annan arbetsyta klickar du p&aring; den i panelprogrammet.</para>
      <figure id="gosmetacity-FIG-722">
        <title>Panelprogrammet Arbetsytebytare</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/workspace_switcher_applet.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Panelprogrammet Arbetsytebytare. Texten beskriver bilden.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para><application>Arbetsytebytaren</application> visar ocks&aring; programf&ouml;nster och dialoger som &auml;r &ouml;ppna p&aring; arbetsytorna.</para>
      <para>Panelprogrammet visar arbetsytorna fr&aring;n v&auml;nster till h&ouml;ger i rader. I <xref linkend="gosmetacity-FIG-722"/> &auml;r panelprogrammet konfigurerat f&ouml;r att visa arbetsytorna i en enda rad. Du kan ange det antal rader som du vill visa arbetsytor p&aring; i <application>Arbetsytebytaren</application>. Du kan ocks&aring; &auml;ndra standardbeteendet f&ouml;r panelprogrammet s&aring; att namnen p&aring; arbetsytorna visas i panelprogrammet.</para>
    </sect2>
    <sect2 id="gosmetacity-27">
      <title>Anv&auml;nda Menypanelen f&ouml;r att arbeta med f&ouml;nster</title>
      <indexterm>
        <primary>Menypanel</primary>
        <secondary>ikon f&ouml;r f&ouml;nsterlista</secondary>
      </indexterm>
      <indexterm>
        <primary>f&ouml;nsterlistor</primary>
        <secondary>Menypanel</secondary>
      </indexterm>
      <para>Med Menypanelen kan du visa en lista &ouml;ver alla f&ouml;nster som f&ouml;r tillf&auml;llet &auml;r &ouml;ppna. Du kan ocks&aring; v&auml;lja att aktivera ett visst f&ouml;nster. Om du vill visa f&ouml;nsterlistan klickar du p&aring; ikonen l&auml;ngst till h&ouml;ger p&aring; Menypanelen. I f&ouml;ljande bild visas ett exempel p&aring; en f&ouml;nsterlista som du kan visa fr&aring;n Menypanelen:</para>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/openwindows_menu.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Fönsterlista som visas från Menypanelen.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <para>N&auml;r det aktiva f&ouml;nstret &auml;ndras &auml;ndras &auml;ven den ikon som du klickar p&aring; f&ouml;r att visa f&ouml;nsterlistan. Ikonen representerar det f&ouml;nster som f&ouml;r tillf&auml;llet &auml;r aktivt. Om du vill aktivera ett f&ouml;nster v&auml;ljer du det i f&ouml;nsterlistan.</para>
      <para>I f&ouml;nsterlistan visas alla f&ouml;nster i alla arbetsytor. F&ouml;nstren i alla arbetsytor utom den aktuella arbetsytan visas under en avskiljare.</para>
      <para>Du kan inte flytta ikonen l&auml;ngst till h&ouml;ger p&aring; Menypanelen.</para>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-715">
    <title>Hantera f&ouml;nster</title>
    <indexterm>
      <primary>f&ouml;nster</primary>
      <secondary>hantera</secondary>
    </indexterm>
    <para>I det h&auml;r avsnittet beskrivs hur du hanterar f&ouml;nster.</para>
    <sect2 id="gosmetacity-28">
      <title>S&aring; h&auml;r aktiverar du ett f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>aktivera</secondary>
      </indexterm>
      <indexterm>
        <primary>aktivera f&ouml;nster</primary>
      </indexterm>
      <para>Ett f&ouml;nster som &auml;r aktivt reagerar p&aring; indata fr&aring;n musen och tangentbordet. Endast ett f&ouml;nster &aring;t g&aring;ngen kan vara aktiverat. Det aktiverade f&ouml;nstret ser annorlunda ut &auml;n de &ouml;vriga f&ouml;nstren. </para>
      <para>Du kan aktivera ett f&ouml;nster med hj&auml;lp av de f&ouml;ljande elementen:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="33.62*"/>
          <colspec colname="colspec1" colwidth="66.38*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Element</para>
              </entry>
              <entry valign="top">
                <para> &Aring;tg&auml;rd</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Mus</para>
              </entry>
              <entry valign="top">
                <para> Klicka p&aring; f&ouml;nstret om det &auml;r synligt. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Snabbkommandon</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Anv&auml;nd snabbkommandon om du vill v&auml;xla till ett annat &ouml;ppet f&ouml;nster. Sl&auml;pp tangenterna n&auml;r du vill aktivera ett f&ouml;nster. Standardsnabbkommandot f&ouml;r att v&auml;xla mellan olika f&ouml;nster &auml;r <keycombo><keycap>Alt</keycap><keycap> Tabb</keycap></keycombo>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para><application>F&ouml;nsterlista</application>:</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para> Klicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application>.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Arbetsytebytaren</application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para> Klicka p&aring; det f&ouml;nster som du vill aktivera i <application>Arbetsytebytaren</application>. Om du klickar p&aring; ett f&ouml;nster i en annan arbetsyta v&auml;xlar <application>Arbetsytebytaren</application> till den andra arbetsytan och g&ouml;r det f&ouml;nstret aktivt. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Menypanel</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Klicka p&aring; ikonen l&auml;ngst till h&ouml;ger p&aring; Menypanelen. Det visas en lista &ouml;ver &ouml;ppna f&ouml;nster. V&auml;lj &ouml;nskat f&ouml;nster i listan.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gosmetacity-29">
      <title>S&aring; h&auml;r minimerar du ett f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>minimera</secondary>
      </indexterm>
      <indexterm>
        <primary>minimera</primary>
        <secondary>f&ouml;nster</secondary>
      </indexterm>
      <para>G&ouml;r n&aring;got av f&ouml;ljande om du vill minimera ett f&ouml;nster: </para>
      <itemizedlist>
        <listitem>
          <para>Klicka p&aring; knappen <guibutton>Minimera</guibutton> i f&ouml;nsterramen.</para>
        </listitem>
        <listitem>
          <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> och v&auml;lj <guimenuitem>Minimera</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>Om f&ouml;nstret &auml;r aktivt klickar du p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application>. Om f&ouml;nstret inte &auml;r aktivt klickar du tv&aring; g&aring;nger p&aring; den knapp som representerar f&ouml;nstret. </para>
        </listitem>
        <listitem>
          <para>H&ouml;gerklicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application> och v&auml;lj <guimenuitem>Minimera</guimenuitem> p&aring; popupmenyn.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-30">
      <title>S&aring; h&auml;r maximerar du ett f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>maximera</secondary>
      </indexterm>
      <indexterm>
        <primary>maximera f&ouml;nster</primary>
      </indexterm>
      <para>N&auml;r du maximerar ett f&ouml;nster ut&ouml;kas det till st&ouml;rsta m&ouml;jliga storlek. G&ouml;r n&aring;got av f&ouml;ljande om du vill maximera ett f&ouml;nster: </para>
      <itemizedlist>
        <listitem>
          <para>Klicka p&aring; knappen <guibutton>Maximera</guibutton> i f&ouml;nsterramen. &Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> och v&auml;lj <guimenuitem>Maximera</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>H&ouml;gerklicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application> och v&auml;lj <guimenuitem>Maximera</guimenuitem> p&aring; <guimenu>F&ouml;nstermenyn</guimenu>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-31">
      <title>S&aring; h&auml;r &aring;terst&auml;ller du ett f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>&aring;terst&auml;lla</secondary>
      </indexterm>
      <indexterm>
        <primary>&aring;terst&auml;lla</primary>
        <secondary>f&ouml;nster</secondary>
      </indexterm>
      <para>G&ouml;r n&aring;got av f&ouml;ljande om du vill &aring;terst&auml;lla ett f&ouml;nster: </para>
      <itemizedlist>
        <listitem>
          <para>Klicka p&aring; knappen <guibutton>Maximera</guibutton> i f&ouml;nsterramen.</para>
        </listitem>
        <listitem>
          <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. V&auml;lj <guimenuitem>Avmaximera</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>H&ouml;gerklicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application> f&ouml;r att &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. V&auml;lj <guimenuitem>Avmaximera</guimenuitem>. </para>
        </listitem>
      </itemizedlist>
      <para>Om du vill &aring;terst&auml;lla ett minimerat f&ouml;nster klickar du p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application>. </para>
    </sect2>
    <sect2 id="gosmetacity-32">
      <title>St&auml;nga ett f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>st&auml;nga</secondary>
      </indexterm>
      <indexterm>
        <primary>st&auml;nga f&ouml;nster</primary>
      </indexterm>
      <para>G&ouml;r n&aring;got av f&ouml;ljande om du vill st&auml;nga ett f&ouml;nster: </para>
      <itemizedlist>
        <listitem>
          <para>Klicka p&aring; knappen <guibutton>St&auml;ng f&ouml;nster</guibutton> i f&ouml;nsterramen. </para>
        </listitem>
        <listitem>
          <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. V&auml;lj <guimenuitem>St&auml;ng</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>H&ouml;gerklicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application> och v&auml;lj <guimenuitem>St&auml;ng</guimenuitem> p&aring; <guimenu>F&ouml;nstermenyn</guimenu>.</para>
        </listitem>
      </itemizedlist>
      <para>Om f&ouml;nstret inneh&aring;ller osparade data tillfr&aring;gas du om du vill spara dem.</para>
    </sect2>
    <sect2 id="gosmetacity-34">
      <title>S&aring; h&auml;r &auml;ndrar du storlek p&aring; f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>&auml;ndra storlek p&aring;</secondary>
      </indexterm>
      <indexterm>
        <primary>&auml;ndra storlek p&aring; f&ouml;nster</primary>
      </indexterm>
      <para>G&ouml;r n&aring;got av f&ouml;ljande om du vill &auml;ndra storlek p&aring; ett f&ouml;nster:</para>
      <itemizedlist>
        <listitem>
          <para>Peka p&aring; ett av f&ouml;nstrets h&ouml;rn. Muspekaren &auml;ndras och visar att du kan &auml;ndra storlek p&aring; f&ouml;nstret. Ta tag i h&ouml;rnet och dra f&ouml;nstret till &ouml;nskad storlek.</para>
        </listitem>
        <listitem>
          <para>H&ouml;gerklicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application>. V&auml;lj <guimenuitem>&Auml;ndra storlek</guimenuitem> p&aring; <guimenu>F&ouml;nstermenyn</guimenu>. Anv&auml;nd piltangenterna f&ouml;r att &auml;ndra storlek p&aring; f&ouml;nstret.</para>
        </listitem>
        <listitem>
          <para>H&aring;ll ned <keycap>Alt</keycap>-tangenten och klicka med den mittersta musknappen i det h&ouml;rn som du vill &auml;ndra storlek p&aring;. Muspekaren &auml;ndras och visar att du kan &auml;ndra storlek p&aring; f&ouml;nstret fr&aring;n h&ouml;rnet. &Auml;ndra storlek p&aring; f&ouml;nstret genom att dra fr&aring;n det h&ouml;rn som du klickade i.</para>
        </listitem>
        <listitem>
          <para>Om du vill &auml;ndra storlek p&aring; ett f&ouml;nster v&aring;gr&auml;tt pekar du p&aring; en av f&ouml;nstrets lodr&auml;ta kanter. Muspekaren &auml;ndras och visar att du kan &auml;ndra storlek p&aring; f&ouml;nstret. Ta tag i kanten och dra f&ouml;nstret till &ouml;nskad storlek.</para>
        </listitem>
        <listitem>
          <para>Om du vill &auml;ndra storlek p&aring; ett f&ouml;nster lodr&auml;tt pekar du p&aring; f&ouml;nstrets nedre kant. Muspekaren &auml;ndras och visar att du kan &auml;ndra storlek p&aring; f&ouml;nstret. Ta tag i kanten och dra f&ouml;nstret till &ouml;nskad storlek.</para>
        </listitem>
      </itemizedlist>
      <note>
        <para>Du kan inte &auml;ndra storlek p&aring; alla dialogf&ouml;nster. Vissa programf&ouml;nster har ocks&aring; en minimistorlek som begr&auml;nsar hur litet du kan g&ouml;ra f&ouml;nstret.</para>
      </note>
    </sect2>
    <sect2 id="gosmetacity-35">
      <title>S&aring; h&auml;r flyttar du ett f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>flytta</secondary>
      </indexterm>
      <indexterm>
        <primary>flytta f&ouml;nster</primary>
      </indexterm>
      <para>G&ouml;r n&aring;got av f&ouml;ljande om du vill flytta ett f&ouml;nster: </para>
      <itemizedlist>
        <listitem>
          <para>Ta tag i f&ouml;nstrets titelrad och dra det till &ouml;nskad plats. </para>
        </listitem>
        <listitem>
          <para>H&aring;ll ned <keycap>Alt</keycap>-tangenten och dra f&ouml;nstret till &ouml;nskad plats. </para>
        </listitem>
        <listitem>
          <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> och v&auml;lj <guimenuitem>Flytta</guimenuitem>. Anv&auml;nd piltangenterna f&ouml;r att flytta f&ouml;nstret till &ouml;nskad plats. </para>
        </listitem>
        <listitem>
          <para>H&ouml;gerklicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application> och v&auml;lj <guimenuitem>Flytta</guimenuitem> p&aring; <guimenu>F&ouml;nstermenyn</guimenu>. Anv&auml;nd piltangenterna f&ouml;r att flytta f&ouml;nstret till &ouml;nskad plats.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-36">
      <title>S&aring; h&auml;r skuggar du ett f&ouml;nster</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>skugga</secondary>
      </indexterm>
      <indexterm>
        <primary>skugga f&ouml;nster</primary>
      </indexterm>
      <para>Du kan skugga och avskugga f&ouml;nster p&aring; f&ouml;ljande s&auml;tt:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colwidth="24.94*"/>
          <colspec colwidth="75.06*"/>
          <tbody>
            <row>
              <entry valign="top">
                <para>Skugga</para>
              </entry>
              <entry valign="top">
                <para> Minska f&ouml;nstrets storlek s&aring; att endast titelraden syns.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Avskugga</para>
              </entry>
              <entry valign="top">
                <para> V&auml;xla ett f&ouml;nster fr&aring;n skuggat tillst&aring;nd s&aring; att hela f&ouml;nstret syns. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>G&ouml;r n&aring;got av f&ouml;ljande om du vill skugga ett f&ouml;nster: </para>
      <itemizedlist>
        <listitem>
          <para>Dubbelklicka p&aring; f&ouml;nstrets titelrad. Om du vill avskugga ett f&ouml;nster dubbelklickar du p&aring; dess titelrad. </para>
        </listitem>
        <listitem>
          <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. V&auml;lj <guimenuitem>Skugga</guimenuitem>. Om du vill avskugga f&ouml;nstret v&auml;ljer du <guimenuitem>Avskugga</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>H&ouml;gerklicka p&aring; den knapp som representerar f&ouml;nstret i <application>F&ouml;nsterlistan</application> och v&auml;lj <guimenuitem>Skugga</guimenuitem> p&aring; <guimenu>F&ouml;nstermenyn</guimenu>. Om du vill avskugga f&ouml;nstret v&auml;ljer du <guimenuitem>Avskugga</guimenuitem>. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-38">
      <title>S&aring; h&auml;r placerar du ett f&ouml;nster p&aring; alla arbetsytor</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>placera p&aring; alla arbetsytor</secondary>
      </indexterm>
      <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. V&auml;lj <guimenuitem>Placera p&aring; alla arbetsytor</guimenuitem>. Om du vill att f&ouml;nstret bara ska visas p&aring; den aktuella arbetsytan v&auml;ljer du <guimenuitem>Endast p&aring; denna arbetsyta</guimenuitem>.</para>
    </sect2>
    <sect2 id="gosmetacity-46">
      <title>S&aring; h&auml;r flyttar du ett f&ouml;nster till en annan arbetsyta</title>
      <indexterm>
        <primary>f&ouml;nster</primary>
        <secondary>flytta till en annan arbetsyta</secondary>
      </indexterm>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>flytta f&ouml;nster till</secondary>
      </indexterm>
      <para>Du kan flytta ett f&ouml;nster till en annan arbetsyta p&aring; f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>Anv&auml;nd <application>Arbetsytebytaren</application></para>
          <para>I <application>Arbetsytebytaren</application> drar du f&ouml;nstret till &ouml;nskad arbetsyta.</para>
        </listitem>
        <listitem>
          <para>Anv&auml;nd <guimenu>F&ouml;nstermenyn</guimenu></para>
          <para>&Ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu>. Om du vill flytta f&ouml;nstret till n&auml;sta arbetsyta v&auml;ljer du <guimenuitem>Flytta till <replaceable>arbetsytenamn</replaceable></guimenuitem>. </para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosmetacity-716">
    <title>Hantera arbetsytor</title>
    <indexterm>
      <primary>arbetsytor</primary>
      <secondary>hantera</secondary>
    </indexterm>
    <para>I det h&auml;r avsnittet beskrivs hur du hanterar arbetsytor.</para>
    <sect2 id="gosmetacity-49">
      <title>S&aring; h&auml;r v&auml;xlar du mellan olika arbetsytor</title>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>v&auml;xla mellan</secondary>
      </indexterm>
      <para>Du kan v&auml;xla mellan arbetsytor p&aring; f&ouml;ljande s&auml;tt: </para>
      <itemizedlist>
        <listitem>
          <para>Anv&auml;nd <application>Arbetsytebytaren</application></para>
          <para>Klicka p&aring; den arbetsyta som du vill v&auml;xla till i <application>Arbetsytebytaren</application>.</para>
        </listitem>
        <listitem>
          <para>Anv&auml;nda snabbkommandon</para>
          <para>Standardsnabbkommandona f&ouml;r att v&auml;xla mellan arbetsytor &auml;r f&ouml;ljande: </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colwidth="50*"/>
              <colspec colwidth="50*"/>
              <thead>
                <row rowsep="1">
                  <entry>
                    <para>Standardsnabbkommandon</para>
                  </entry>
                  <entry>
                    <para> Funktion</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry>
                    <para><keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap> h&ouml;gerpil</keycap></keycombo></para>
                  </entry>
                  <entry>
                    <para>Markerar arbetsytan till h&ouml;ger. </para>
                  </entry>
                </row>
                <row>
                  <entry>
                    <para><keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap> v&auml;nsterpil</keycap></keycombo></para>
                  </entry>
                  <entry>
                    <para>Markerar arbetsytan till v&auml;nster. </para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosmetacity-50">
      <title>S&aring; h&auml;r l&auml;gger du till arbetsytor</title>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>l&auml;gga till</secondary>
      </indexterm>
      <para>Om du vill l&auml;gga till arbetsytor p&aring; skrivbordet h&ouml;gerklickar du p&aring; <application>Arbetsytebytaren</application> och v&auml;ljer <guimenuitem>Inst&auml;llningar</guimenuitem>. Dialogf&ouml;nstret <guilabel>Inst&auml;llningar f&ouml;r arbetsytebytare</guilabel> visas. Anv&auml;nd rotationsrutan <guilabel>Antal arbetsytor</guilabel> f&ouml;r att ange hur m&aring;nga arbetsytor du vill ha. <application>Arbetsytebytaren</application> l&auml;gger till nya arbetsytor i slutet av listan &ouml;ver arbetsytor.</para>
    </sect2>
    <sect2 id="gosmetacity-51">
      <title>S&aring; h&auml;r namnger du arbetsytor</title>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>namnge</secondary>
      </indexterm>
      <para>Standardnamnen p&aring; arbetsytor &auml;r <literal>Arbetsyta 1</literal>, <literal> Arbetsyta 2</literal>, <literal>Arbetsyta 3</literal> osv. Om du vill namnge arbetsytor h&ouml;gerklickar du p&aring; <application>Arbetsytebytaren</application> och v&auml;ljer <guimenuitem>Inst&auml;llningar</guimenuitem>. Dialogf&ouml;nstret <guilabel>Inst&auml;llningar f&ouml;r arbetsytebytare</guilabel> visas. Anv&auml;nd listrutan <guilabel>Arbetsytor</guilabel> f&ouml;r att skriva in namn p&aring; arbetsytor. Markera en arbetsyta och skriv in det nya namnet.</para>
    </sect2>
    <sect2 id="gosmetacity-52">
      <title>S&aring; h&auml;r tar du bort en arbetsyta</title>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>ta bort</secondary>
      </indexterm>
      <para>N&auml;r du tar bort en arbetsyta flyttas dess f&ouml;nster till en annan arbetsyta och den tomma arbetsytan tas bort. </para>
      <para>Om du vill ta bort arbetsytor fr&aring;n skrivbordet h&ouml;gerklickar du p&aring; <application>Arbetsytebytaren</application> och v&auml;ljer <guimenuitem>Inst&auml;llningar</guimenuitem>. Dialogf&ouml;nstret <guilabel>Inst&auml;llningar f&ouml;r arbetsytebytare</guilabel> visas. Anv&auml;nd rotationsrutan <guilabel>Antal arbetsytor</guilabel> f&ouml;r att ange hur m&aring;nga arbetsytor du vill ha. <application>Arbetsytebytaren</application> tar bort arbetsytor fr&aring;n slutet av listan &ouml;ver arbetsytor.</para>
    </sect2>
  </sect1>
</chapter>
