<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosoverview-1">
  <title>&Ouml;versikt &ouml;ver skrivbordet</title>
  <highlights>
    <para>Det h&auml;r kapitlet &auml;r en introduktion till GNOME-skrivbordets funktioner och huvudkomponenter. L&auml;s det h&auml;r kapitlet innan du b&ouml;rjar anv&auml;nda skrivbordet s&aring; att du bekantar dig med de olika funktionerna och hur huvudkomponenterna fungerar. Skrivbordet har m&aring;nga inst&auml;llningar, och d&auml;rf&ouml;r beskrivs den normala standardkonfigurationen i det h&auml;r kapitlet. F&ouml;ljande &auml;mnen behandlas:</para>
  </highlights>
  <sect1 id="gosoverview-5">
    <title>Introduktion till skrivbordskomponenterna</title>
    <indexterm>
      <primary>skrivbordskomponenter, introduktion till</primary>
    </indexterm>
    <para>F&ouml;rsta g&aring;ngen du startar en skrivbordssession har skrivbordet sitt standardutseende, med paneler, f&ouml;nster och diverse ikoner. <xref linkend="gosoverview-FIG-1"/> visar ett skrivbord med karakteristiskt utseende. </para>
    <figure id="gosoverview-FIG-1">
      <title>Ett karakteristiskt skrivbord</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/typical_anno_desktop.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Ett karakteristiskt skrivbord. Bildtext: Meny, Menypanel, Skrivbordsbakgrund, Fönster, panelprogrammet Fönsterlista, Undre kantpanel, panelprogrammet Arbetsytebytaren.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <para>Detta &auml;r skrivbordets huvudkomponenter: <itemizedlist><listitem><para>Paneler</para><para>Paneler &auml;r omr&aring;den p&aring; skrivbordet d&auml;r du kommer &aring;t alla systemprogram och menyer. Paneler g&aring;r att konfigurera p&aring; en m&auml;ngd olika s&auml;tt. Menypanelen &auml;r en av de viktigare panelerna i <xref linkend="gosoverview-FIG-1"/>. Menypanelen t&auml;cker skrivbordets &ouml;vre kant. Menypanelen inneh&aring;ller tv&aring; specialmenyer:</para><itemizedlist><listitem><para><guimenu>Program</guimenu>-menyn: Inneh&aring;ller alla program och konfigurationsverktyg. P&aring; menyn ing&aring;r &auml;ven filhanteraren och hj&auml;lpl&auml;saren.</para></listitem><listitem><para><guimenu>&Aring;tg&auml;rder</guimenu>-menyn: Inneh&aring;ller olika kommandon som du kan utf&ouml;ra skrivbord&aring;tg&auml;rder med, till exempel kommandona <guimenuitem>S&ouml;k efter filer</guimenuitem> och <guimenuitem>Logga ut</guimenuitem>. </para></listitem></itemizedlist><para>Klicka p&aring; ikonen l&auml;ngst till h&ouml;ger p&aring; menypanelen om du vill se en lista &ouml;ver alla f&ouml;nster som &auml;r &ouml;ppna.</para></listitem><listitem><para>Menyer</para><para>Alla skrivbordsfunktioner &auml;r tillg&auml;ngliga via menyer. Menypanelen inneh&aring;ller menyer. Du kan allts&aring; anv&auml;nda en kombination av menyer och paneler n&auml;r du arbetar. Du kan komma &aring;t praktiskt taget alla program, kommandon och konfigurationsalternativ som &auml;r standard p&aring; menyerna <guimenu>Program</guimenu> och <guimenu>&Aring;tg&auml;rder</guimenu>. </para><para>Du kan ocks&aring; komma &aring;t praktiskt taget alla program, kommandon och konfigurationsalternativ f&ouml;r skrivbordet fr&aring;n <guimenu>GNOME-menyn</guimenu>. Du kan komma &aring;t objekten p&aring; menyerna <guimenu>Program</guimenu> och <guimenu>&Aring;tg&auml;rder</guimenu> fr&aring;n <guimenu>GNOME</guimenu>-menyn. Du kan l&auml;gga till <guimenu>GNOME-menyn</guimenu> som en knapp p&aring; panelerna. </para></listitem><listitem><para>F&ouml;nster</para><para>Du kan visa flera f&ouml;nster samtidigt. Du kan k&ouml;ra olika program i varje f&ouml;nster. F&ouml;nsterhanteraren omg&auml;rdar f&ouml;nstren med ramar och infogar knappar i dem. Du kan utf&ouml;ra standard&aring;tg&auml;rder med f&ouml;nsterhanterarens hj&auml;lp, t ex flytta, st&auml;nga och &auml;ndra storlek p&aring; f&ouml;nster. </para></listitem><listitem><para>Arbetsytor</para><para>Du kan dela in skrivbordet i separata <firstterm>arbetsytor</firstterm>. En arbetsyta &auml;r ett avskiljt omr&aring;de p&aring; skrivbordet d&auml;r du kan arbeta. Du kan ange hur m&aring;nga arbetsytor du vill ha p&aring; skrivbordet. Du kan v&auml;xla till en annan arbetsyta, men det g&aring;r bara att visa en &aring;t g&aring;ngen. </para></listitem><listitem><para>Filhanteraren <application>Nautilus</application></para><para>Filhanteraren <application>Nautilus</application> ger dig tillg&aring;ng till alla dina filer och program. Du kan visa filernas inneh&aring;ll i ett <application>Nautilus</application>-f&ouml;nster eller &ouml;ppna filerna i n&aring;got l&auml;mpligt program fr&aring;n <application>Nautilus</application>. Du kan hantera dina filer och mappar med filhanteraren <application>Nautilus</application>. </para></listitem><listitem><para>Skrivbordsbakgrund</para><para>Skrivbordsbakgrunden befinner sig bakom skrivbordets &ouml;vriga komponenter. Skrivbordsbakgrunden &auml;r en aktiv komponent i anv&auml;ndargr&auml;nssnittet. Du kan l&auml;gga objekt p&aring; skrivbordsbakgrunden f&ouml;r att snabbt komma &aring;t dina filer och mappar eller starta program som du anv&auml;nder ofta. Du kan &auml;ven h&ouml;gerklicka p&aring; bakgrunden. D&aring; visas en meny.</para></listitem><listitem><para>Platsen <guilabel>B&ouml;rja h&auml;r</guilabel></para><para>Platsen <guilabel>B&ouml;rja h&auml;r</guilabel> ger tillg&aring;ng till n&aring;gra av GNOME-skrivbordets centrala funktioner. Du hittar dina GNOME-program och konfigurationsverktyg p&aring; platsen <guilabel>B&ouml;rja h&auml;r</guilabel>. Du kommer &auml;ven &aring;t program som ger dig m&ouml;jlighet att konfigurera systemet som en server och v&auml;lja andra systeminst&auml;llningar.</para></listitem><listitem><para>Skrivbordsinst&auml;llningar</para><para>GNOME-skrivbordet har egna <firstterm>inst&auml;llningsverktyg</firstterm>. Varje verktyg p&aring;verkar en s&auml;rskild del av skrivbordets beteende. V&auml;lj <menuchoice><guimenu>Program</guimenu><guimenuitem>Skrivbordsinst&auml;llningar</guimenuitem></menuchoice> om du vill starta ett inst&auml;llningsverktyg. V&auml;lj alternativet som du vill konfigurera p&aring; undermenyerna.</para></listitem></itemizedlist></para>
    <para>De m&aring;nga konfigurationsm&ouml;jligheterna och m&aring;nga s&auml;tten som du kan utf&ouml;ra uppgifter p&aring; &auml;r skrivbordets fr&auml;msta egenskaper.</para>
    <para>Skrivbordet knyter samman skrivbordskomponenterna. I de flesta fall kan en &aring;tg&auml;rd utf&ouml;ras p&aring; flera olika s&auml;tt. Du kan exempelvis starta program fr&aring;n paneler, menyer eller skrivbordsbakgrunden. </para>
    <para>Systemadministrat&ouml;ren kan ha &auml;ndrat konfigurationen s&aring; att den passar dina behov. Skrivbordet beh&ouml;ver d&auml;rf&ouml;r inte se ut exakt s&aring; som beskrivs i det h&auml;r kapitlet. Kapitlet &auml;r &auml;nd&aring; en anv&auml;ndbar guide till hur arbetet med skrivbordet g&aring;r till. </para>
  </sect1>
  <sect1 id="gosoverview-502">
    <title>Paneler</title>
    <indexterm>
      <primary>paneler</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>Du kan n&auml;r som helst l&auml;gga till eller ta bort paneler. F&ouml;rsta g&aring;ngen du startar en session finns det normalt &aring;tminstone tv&aring; paneler p&aring; skrivbordet: </para>
    <itemizedlist>
      <listitem>
        <para>Menypanel</para>
      </listitem>
      <listitem>
        <para>Kantpanel l&auml;ngst ned p&aring; skrivbordet</para>
      </listitem>
    </itemizedlist>
    <para>Du kan utf&ouml;ra de f&ouml;ljande &aring;tg&auml;rderna med paneler:</para>
    <itemizedlist>
      <listitem>
        <para>Skapa paneler.</para>
      </listitem>
      <listitem>
        <para>Ta bort paneler.</para>
      </listitem>
      <listitem>
        <para>D&ouml;lja paneler.</para>
      </listitem>
      <listitem>
        <para>L&auml;gga till objekt p&aring; paneler.</para>
      </listitem>
      <listitem>
        <para>Manipulera objekt p&aring; panelen.</para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosoverview-26">
      <title>S&aring; h&auml;r skapar du paneler</title>
      <para>G&ouml;r s&aring; h&auml;r om du vill skapa en panel: </para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; ett tomt omr&aring;de p&aring; en valfri panel och v&auml;lj sedan <guimenuitem>Ny panel</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>V&auml;lj vilken typ av panel som du vill skapa p&aring; undermenyn. Panelen l&auml;ggs till p&aring; skrivbordet.</para>
        </listitem>
      </orderedlist>
      <para>Du kan skapa s&aring; m&aring;nga paneler du vill. Det g&aring;r emellertid bara att ha en menypanel. Du kan skapa olika typer av paneler s&aring; att de passar dina behov. Du kan anpassa panelernas upptr&auml;dande och utseende. Du kan t ex &auml;ndra panelernas bakgrund.</para>
    </sect2>
    <sect2 id="gosoverview-508">
      <title>S&aring; h&auml;r tar du bort paneler</title>
      <para>H&ouml;gerklicka p&aring; panelen och v&auml;lj sedan <guimenuitem>Ta bort den h&auml;r panelen</guimenuitem> om du vill ta bort en panel.</para>
    </sect2>
    <sect2 id="gosoverview-24">
      <title>S&aring; h&auml;r d&ouml;ljer du paneler</title>
      <para>Alla paneler kan ha d&ouml;ljknappar i b&auml;gge &auml;ndar, med undantag av menypanelen. Klicka p&aring; d&ouml;ljknapparna om du vill d&ouml;lja eller visa panelen.</para>
    </sect2>
    <sect2 id="gosoverview-4">
      <title>S&aring; h&auml;r l&auml;gger du till objekt p&aring; paneler</title>
      <para>Paneler kan inneh&aring;lla flera typer av objekt. Panelen i <xref linkend="gosoverview-FIG-28"/> inneh&aring;ller exempel p&aring; alla olika typer av panelobjekt. </para>
      <figure id="gosoverview-FIG-28">
        <title>En panel med diverse panelobjekt</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/sample_anno_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>En panel med diverse panelobjekt. Bildtext: programsstartare för Miniräknare, Meny, panelprogrammet Cd-spelare, Låda, knappen Lås.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Du kan l&auml;gga till f&ouml;ljande objekt p&aring; alla typer av paneler:</para>
      <itemizedlist>
        <listitem>
          <para>Panelprogram</para>
          <indexterm>
            <primary>panelprogram</primary>
            <secondary> &ouml;versikt</secondary>
          </indexterm>
          <para><firstterm>Panelprogram</firstterm> &auml;r sm&aring;, interaktiva program som upptr&auml;der p&aring; en panel, till exempel <application>Cd-spelaren</application> i <xref linkend="gosoverview-FIG-28"/>. Varje panelprogram har ett enkelt anv&auml;ndargr&auml;nssnitt som du sk&ouml;ter med musen eller tangentbordet. F&ouml;ljande panelprogram finns med p&aring; panelerna, om du inte har angett n&aring;got annat:</para>
          <itemizedlist>
            <listitem>
              <para><application>F&ouml;nsterlista</application>: Inneh&aring;ller en knapp f&ouml;r varje &ouml;ppet f&ouml;nster. Du kan klicka p&aring; en knapp i f&ouml;nsterlistan om du vill minimera eller &aring;terst&auml;lla ett f&ouml;nster. Programmet <application>F&ouml;nsterlista</application> finns normalt p&aring; kantpanelen l&auml;ngst ned p&aring; skrivbordet.</para>
            </listitem>
            <listitem>
              <para><application>Arbetsytebytare</application>: Inneh&aring;ller en visuell representation av arbetsytorna. Du kan v&auml;xla mellan arbetsytor med <application>Arbetsytebytarens</application> hj&auml;lp. Programmet <application>Arbetsytebytaren</application> finns normalt p&aring; kantpanelen l&auml;ngst ned p&aring; skrivbordet.</para>
            </listitem>
          </itemizedlist>
          <para>H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan <guimenuitem>L&auml;gg till i panelen</guimenuitem> om du vill l&auml;gga till ett panelprogram p&aring; en panel. V&auml;lj &ouml;nskat panelprogram p&aring; en av de f&ouml;ljande undermenyerna:</para>
          <itemizedlist>
            <listitem>
              <para>Tillbeh&ouml;r</para>
            </listitem>
            <listitem>
              <para>Underh&aring;llning</para>
            </listitem>
            <listitem>
              <para>Internet</para>
            </listitem>
            <listitem>
              <para>Multimedia</para>
            </listitem>
            <listitem>
              <para>Verktyg</para>
            </listitem>
          </itemizedlist>
        </listitem>
        <listitem>
          <para>Programstartare</para>
          <para>En <firstterm>programstartare</firstterm> startar ett visst program, k&ouml;r ett visst kommando eller &ouml;ppnar en viss fil. Minir&auml;knarikonen i <xref linkend="gosoverview-FIG-28"/> startar programmet <application>Minir&auml;knare</application>. Programstartare kan finnas p&aring; paneler eller menyer. Klicka p&aring; programstartaren om du vill utf&ouml;ra &aring;tg&auml;rden som &auml;r knuten till den.</para>
          <para>Du kan skapa egna programstartare. Du kan t ex skapa en programstartare f&ouml;r ett ordbehandlingsprogram som du anv&auml;nder ofta och placera den p&aring; en panel s&aring; att den &auml;r l&auml;tt att komma &aring;t. H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>Programstartare</guimenuitem></menuchoice> om du vill l&auml;gga till en ny programstartare p&aring; en panel. </para>
          <para>Du kan &auml;ven h&ouml;gerklicka p&aring; en tom yta p&aring; panelen och sedan v&auml;lja <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>Programstartare fr&aring;n meny</guimenuitem></menuchoice> om du vill l&auml;gga till en programstartare fr&aring;n en meny. V&auml;lj programstartaren som du vill l&auml;gga till p&aring; undermenyerna.</para>
        </listitem>
        <listitem>
          <para>Menyer</para>
          <para>Alla skrivbordsfunktioner &auml;r tillg&auml;ngliga via menyer. Standardpanelerna inneh&aring;ller menyer. Du kan allts&aring; utf&ouml;ra ditt arbete via en kombination av menyer och paneler. Klicka p&aring; ikonen som representerar menyn om du vill &ouml;ppna en meny fr&aring;n en panel. Klicka p&aring; texten som representerar menyn om du vill &ouml;ppna en meny fr&aring;n menypanelen. </para>
          <para>Menyer som du l&auml;gger till p&aring; panelerna representeras av en ikon med en pil. Pilen visar att ikonen representerar en meny. Ikonen i <xref linkend="gosoverview-FIG-28"/> &auml;r densamma som visas d&aring; du l&auml;gger till menyn <guimenuitem>Skrivbordsinst&auml;llningar</guimenuitem> p&aring; en panel.</para>
          <para>Du kan &auml;ven l&auml;gga till <guimenu>GNOME-menyn</guimenu> p&aring; vilken panel som helst. H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>GNOME-meny</guimenuitem></menuchoice> om du vill l&auml;gga till <guimenu>GNOME-menyn</guimenu> p&aring; en panel.</para>
        </listitem>
        <listitem>
          <para>L&aring;dor</para>
          <para><firstterm>L&aring;dor</firstterm> &auml;r glidande till&auml;gg till en panel som du kan &ouml;ppna eller st&auml;nga med hj&auml;lp av en l&aring;dikon, vilket visas i <xref linkend="gosoverview-FIG-28"/>. Om du k&ouml;r m&aring;nga program samtidigt &auml;r arbetet mer l&auml;ttorganiserat om du anv&auml;nder l&aring;dor. Du kan l&auml;gga samma element i l&aring;dor som du kan l&auml;gga p&aring; alla andra typer av paneler. </para>
          <para>H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>L&aring;da</guimenuitem></menuchoice> om du vill l&auml;gga till en ny l&aring;da p&aring; en panel. </para>
          <para>Klicka p&aring; l&aring;dan om du vill &ouml;ppna den. Klicka p&aring; l&aring;dan igen om du vill st&auml;nga den.</para>
        </listitem>
        <listitem>
          <para>Knapparna <guibutton>L&aring;s</guibutton> och <guibutton>Logga ut </guibutton></para>
          <para>Med knappen <guibutton>L&aring;s</guibutton> kan du l&aring;sa sk&auml;rmen. Knappen <guibutton>L&aring;s</guibutton> representeras av l&aring;sikonen i <xref linkend="gosoverview-FIG-28"/>. Med knappen <guibutton>Logga ut</guibutton> kan du avsluta en session. </para>
          <para>H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan <guimenuitem>L&auml;gg till i panelen</guimenuitem> om du vill l&auml;gga till knapparna p&aring; en panel. Sedan kan du v&auml;lja den knapp som du beh&ouml;ver. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosoverview-21">
      <title>S&aring; h&auml;r manipulerar du panelobjekt</title>
      <para>Du kan manipulera panelobjekt p&aring; f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>Flytta objekt p&aring; en panel eller till en annan panel.</para>
          <para>Du kan flytta vilket objekt som helst till en annan plats p&aring; panelen. Du kan &auml;ven flytta ett objekt fr&aring;n en panel till en annan. Dra panelobjektet till den nya platsen med den mellersta musknappen.</para>
        </listitem>
        <listitem>
          <para>Kopiera menyalternativ till en panel.</para>
          <para>Dra menyalternativet fr&aring;n menyn till panelen. H&ouml;gerklicka p&aring; menyalternativet och v&auml;lj sedan <guimenuitem>L&auml;gg till den h&auml;r programstartaren p&aring; panelen</guimenuitem> om menyalternativet &auml;r en programstartare.</para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-42">
    <title>Menyer</title>
    <indexterm>
      <primary>menyer</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>Alla skrivbordsfunktioner &auml;r tillg&auml;ngliga via menyer. Standardpanelerna inneh&aring;ller menyer, vilket inneb&auml;r att du kan utf&ouml;ra &aring;tg&auml;rder antingen med hj&auml;lp av menyer eller paneler. Menypanelen inneh&aring;ller menyerna <guimenu>Program</guimenu> och <guimenu>&Aring;tg&auml;rder</guimenu>. Du kan &auml;ven l&auml;gga till <guimenu>GNOME-menyn</guimenu> p&aring; panelerna. </para>
    <para>Du kan komma &aring;t praktiskt taget alla program, kommandon och konfigurationsalternativ som &auml;r standard p&aring; menyerna <guimenu>Program</guimenu> och <guimenu>&Aring;tg&auml;rder</guimenu>. Du kan ocks&aring; komma &aring;t objekten p&aring; menyerna <guimenu>Program</guimenu> och <guimenu>&Aring;tg&auml;rder</guimenu> fr&aring;n <guimenu>GNOME</guimenu>-menyn. Alternativen p&aring; <guimenu> &Aring;tg&auml;rder</guimenu>-menyn finns p&aring; &ouml;versta niv&aring;n p&aring; <guimenu>GNOME-menyn</guimenu>. </para>
    <para>H&ouml;gerklicka p&aring; panelen och v&auml;lj sedan <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>GNOME-meny</guimenuitem></menuchoice> om du vill l&auml;gga till <guimenu>GNOME-menyn</guimenu> p&aring; en panel. <guimenu>GNOME-menyn</guimenu> representeras av ett stiliserat fotavtryck:</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>GNOME-menyns ikon.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Klicka p&aring; <guibutton>GNOME-menyns</guibutton> knapp p&aring; en panel om du vill visa <guimenu>GNOME-menyn</guimenu>. </para>
    <para>Du kan l&auml;gga till hur m&aring;nga menyer du vill p&aring; alla paneler. Klicka p&aring; panelens menyikon om du vill visa menyn som du har lagt till p&aring; panelen. Du kan utf&ouml;ra andra &aring;tg&auml;rder med menyerna, till exempel kopiera menyalternativ till paneler. </para>
  </sect1>
  <sect1 id="gosoverview-18">
    <title>F&ouml;nster p&aring; skrivbordet</title>
    <indexterm>
      <primary>f&ouml;nster</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>Du kan visa flera f&ouml;nster samtidigt p&aring; skrivbordet. Varje f&ouml;nster har en ram. F&ouml;nsterramen inneh&aring;ller aktiva kontrollelement som du kan anv&auml;nda om du vill g&ouml;ra n&aring;got med f&ouml;nstret.</para>
    <sect2 id="gosoverview-16">
      <title>F&ouml;nstertyper</title>
      <para>Skrivbordet kan inneh&aring;lla f&ouml;ljande typer av f&ouml;nster:</para>
      <itemizedlist>
        <listitem>
          <para>Programf&ouml;nster</para>
          <para>N&auml;r du k&ouml;r ett program omges det normalt av en ram. L&auml;ngst upp i programf&ouml;nstret finns en titelrad. Titelraden inneh&aring;ller knappar som du kan anv&auml;nda om du vill g&ouml;ra n&aring;got med f&ouml;nstret. Knapparna i programf&ouml;nstrets ram g&ouml;r det t ex m&ouml;jligt att &ouml;ppna <guimenu>F&ouml;nstermenyn</guimenu> eller st&auml;nga f&ouml;nstret. <guimenu>F&ouml;nstermenyn</guimenu> inneh&aring;ller kommandon som utf&ouml;r n&aring;gon slags &aring;tg&auml;rd p&aring; f&ouml;nstret.</para>
        </listitem>
        <listitem>
          <para>Dialogf&ouml;nster</para>
          <para>Dialogf&ouml;nster h&ouml;r till interaktiva processer. Ett dialogf&ouml;nster best&aring;r av en f&ouml;nsterram och en interaktiv panel som inneh&aring;ller kontroller samt information till anv&auml;ndaren. Den interaktiva delen av ett dialogf&ouml;nster ben&auml;mns ett dialogf&ouml;nster i den h&auml;r handboken. Dialogf&ouml;nstret ram inneh&aring;ller knappar som ger tillg&aring;ng till <guimenu>F&ouml;nstermenyn</guimenu> eller m&ouml;jlighet att st&auml;nga dialogf&ouml;nstret.</para>
        </listitem>
      </itemizedlist>
<!--<para>To change the theme of your window frames, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Desktop Preferences</guisubmenu><guisubmenu>Advanced</guisubmenu><guimenuitem>FIXME</guimenuitem></menuchoice>, then choose the theme that you require. </para>-->
    </sect2>
    <sect2 id="gosoverview-32">
      <title>S&aring; h&auml;r manipulerar du f&ouml;nster</title>
      <para>Du kan utf&ouml;ra vissa &aring;tg&auml;rder med kontrollerna i ett programf&ouml;nsters eller ett dialogf&ouml;nsters ram. De flesta kontrollelementen finns p&aring; f&ouml;nsterramens &ouml;verkant. <xref linkend="gosoverview-FIG-33"/> visar &ouml;verkanten p&aring; ett normalt programf&ouml;nsters ram.</para>
      <figure id="gosoverview-FIG-33">
        <title>Ramens &ouml;verkant p&aring; ett normalt programf&ouml;nster</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/titlebar_anno_window.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Ramens överkant på ett programfönster. Bildtext: Fönstermeny, Titelrad, Minimera, Maximera, Stäng fönster.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <para>Detta &auml;r de aktiva kontrollelementen p&aring; en f&ouml;nsterram: </para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="41.65*"/>
          <colspec colname="colspec1" colwidth="58.35*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Kontrollelement</para>
              </entry>
              <entry valign="top">
                <para>Beskrivning </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Knappen <guibutton>F&ouml;nstermeny</guibutton></para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Klicka p&aring; <guibutton>f&ouml;nstermenyknappen</guibutton> om du vill visa <guimenu>F&ouml;nstermenyn</guimenu>. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Titelrad</para>
              </entry>
              <entry valign="top">
                <para> Du kan flytta eller skugga f&ouml;nstret med hj&auml;lp av titelraden. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Minimeringsknappen</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Klicka p&aring; knappen <guibutton>Minimera</guibutton> om du vill minimera f&ouml;nstret. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>
                  <guibutton>Maximeringsknappen</guibutton>
                </para>
              </entry>
              <entry valign="top">
                <para>Du kan maximera eller &aring;terst&auml;lla f&ouml;nstret med hj&auml;lp av <guibutton>maximeringsknappen</guibutton>.</para>
                <para>Klicka p&aring; <guibutton>maximeringsknappen</guibutton> om du vill maximera ett f&ouml;nster. Klicka en g&aring;ng till p&aring; <guibutton>maximeringsknappen</guibutton> om du vill &aring;terst&auml;lla f&ouml;nstret. </para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Knappen <guibutton>St&auml;ng f&ouml;nster</guibutton></para>
              </entry>
              <entry valign="top">
                <para>Klicka p&aring; knappen <guibutton>St&auml;ng f&ouml;nster</guibutton> om du vill st&auml;nga f&ouml;nstret. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0">
                <para>Kant</para>
              </entry>
              <entry colname="colspec1">
                <para> H&ouml;gerklicka p&aring; kanten om du vill visa <guimenu>F&ouml;nstermenyn</guimenu>.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Ta tag i f&ouml;nsterkanten men inte i titelraden om du vill &auml;ndra f&ouml;nstrets storlek. Dra i kanten tills f&ouml;nstret &auml;r s&aring; stort som du vill ha det. </para>
    </sect2>
    <sect2 id="gosoverview-20">
      <title>S&aring; h&auml;r aktiverar du ett f&ouml;nster</title>
      <para>Ett f&ouml;nster som &auml;r aktivt reagerar p&aring; indata fr&aring;n musen och tangentbordet. Endast ett f&ouml;nster &aring;t g&aring;ngen kan vara aktiverat. Det aktiverade f&ouml;nstret ser annorlunda ut &auml;n de &ouml;vriga f&ouml;nstren. </para>
      <para>Du kan aktivera ett f&ouml;nster med hj&auml;lp av de f&ouml;ljande elementen:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="33.62*"/>
          <colspec colname="colspec1" colwidth="66.38*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Element</para>
              </entry>
              <entry valign="top">
                <para> &Aring;tg&auml;rd</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para>Mus</para>
              </entry>
              <entry valign="top">
                <para> Klicka p&aring; f&ouml;nstret om det &auml;r synligt. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Snabbkommandon</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Anv&auml;nd snabbkommandon om du vill v&auml;xla till ett annat &ouml;ppet f&ouml;nster. Sl&auml;pp tangenterna n&auml;r du vill aktivera ett f&ouml;nster. Standardsnabbkommandot f&ouml;r att v&auml;xla mellan olika f&ouml;nster &auml;r <keycombo><keycap>Alt</keycap><keycap> Tabb</keycap></keycombo>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para><application>F&ouml;nsterlista</application>:</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Klicka p&aring; knappen som representerar f&ouml;nstret i <application>F&ouml;nsterlista</application>. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>
                  <application>Arbetsytebytaren</application>
                </para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Klicka p&aring; f&ouml;nstret som du vill aktivera i <application>Arbetsytebytaren</application>.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-39">
    <title>Arbetsytor</title>
    <indexterm>
      <primary>arbetsytor</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>Du kan visa flera f&ouml;nster samtidigt p&aring; skrivbordet. F&ouml;nstren visas i underavdelningar p&aring; skrivbordet som kallas arbetsytor. En arbetsyta &auml;r ett speciellt omr&aring;de som du kan arbeta i. </para>
    <para>Varje arbetsyta p&aring; skrivbordet har samma skrivbordsbakgrund, paneler och menyer. Du kan emellertid k&ouml;ra olika program och &ouml;ppna olika f&ouml;nster p&aring; varje arbetsyta. Du kan bara visa en arbetsyta &aring;t g&aring;ngen p&aring; skrivbordet, men andra arbetsytor kan ha &ouml;ppna f&ouml;nster. </para>
    <para>Arbetsytor ger dig m&ouml;jlighet att ordna upp p&aring; skrivbordet d&aring; du k&ouml;r m&aring;nga program samtidigt. N&auml;r arbetsytan som du arbetar med blir full av f&ouml;nster kan du flytta &ouml;ver till en annan arbetsyta. Du kan &auml;ven v&auml;xla till en annan arbetsyta och starta fler program.</para>
    <para>Arbetsytorna visas i panelprogrammet <application>Arbetsytebytaren</application>. I <xref linkend="gosoverview-FIG-42"/> inneh&aring;ller <application>Arbetsytebytaren</application> fyra arbetsytor. De f&ouml;rsta tre arbetsytorna inneh&aring;ller &ouml;ppna f&ouml;nster. Den sista arbetsytan inneh&aring;ller inga aktiva f&ouml;nster. </para>
    <figure id="gosoverview-FIG-42">
      <title>Arbetsytor som visas i Arbetsytebytaren</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/workspace_switcher_applet.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Arbetsytebytaren. Bilden beskrivs av den omgivande texten.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
    <sect2 id="gosoverview-41">
      <title>S&aring; h&auml;r v&auml;xlar du mellan olika arbetsytor</title>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>v&auml;xla mellan</secondary>
      </indexterm>
      <para>Du kan v&auml;xla mellan arbetsytor p&aring; f&ouml;ljande s&auml;tt: </para>
      <itemizedlist>
        <listitem>
          <para>Klicka p&aring; arbetsytan d&auml;r du vill arbeta i <application>Arbetsytebytaren</application>.</para>
        </listitem>
        <listitem>
          <para>Tryck p&aring; <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>h&ouml;gerpil</keycap></keycombo> om du vill v&auml;xla till arbetsytan till h&ouml;ger om den aktuella.</para>
        </listitem>
        <listitem>
          <para>Tryck p&aring; <keycombo><keycap>Control</keycap><keycap>Alt</keycap><keycap>v&auml;nsterpil</keycap></keycombo> om du vill v&auml;xla till arbetsytan till v&auml;nster om den aktuella.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gosoverview-40">
      <title>S&aring; h&auml;r l&auml;gger du till arbetsytor</title>
      <indexterm>
        <primary>arbetsytor</primary>
        <secondary>ange antal</secondary>
      </indexterm>
      <para>H&ouml;gerklicka p&aring; panelprogrammet <application>Arbetsytebytaren</application> och v&auml;lj sedan <guimenuitem>Inst&auml;llningar</guimenuitem> om du vill l&auml;gga till arbetsytor p&aring; skrivbordet. Dialogf&ouml;nstret <guilabel>Inst&auml;llningar f&ouml;r arbetsytebytare</guilabel> visas. Ange &ouml;nskat antal arbetsytor i rotationsrutan <guilabel>Antal arbetsytor</guilabel>.</para>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-56">
    <title>Filhanteraren Nautilus</title>
    <indexterm>
      <primary>Nautilus, filhanterare</primary>
      <see>filhanterare</see>
    </indexterm>
    <indexterm>
      <primary>filhanterare</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>Filhanteraren <application>Nautilus</application> ger tillg&aring;ng till alla dina filer, program och FTP-platser. V&auml;lj <menuchoice><guimenu>Program</guimenu><guimenuitem>Hemmapp</guimenuitem></menuchoice> om du vill &ouml;ppna ett <application>Nautilus</application>-f&ouml;nster. Figuren h&auml;r nedan visar ett <application>Nautilus</application>-f&ouml;nster som presenterar inneh&aring;llet i en mapp.</para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_iconview_window.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Ett exempel på ett Nautilusfönster. Bilden förklaras av den omgivande texten.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para><application>Nautilus</application>-f&ouml;nster inneh&aring;ller f&ouml;ljande paneler:</para>
    <itemizedlist>
      <listitem>
        <para>Sidopanel</para>
        <para>Ger dig m&ouml;jlighet att leta bland dina filer. Den h&auml;r panelen inneh&aring;ller &auml;ven information om den aktuella filen eller mappen. Sidopanelen visas i f&ouml;nstrets v&auml;nstra del.</para>
      </listitem>
      <listitem>
        <para>Inneh&aring;llspanelen</para>
        <para>Visar inneh&aring;llet i filer eller mappar. Inneh&aring;llspanelen visas i f&ouml;nstrets h&ouml;gra del.</para>
      </listitem>
    </itemizedlist>
    <para>Du kan vidta f&ouml;ljande &aring;tg&auml;rder med hj&auml;lp av <application>Nautilus</application>: </para>
    <itemizedlist>
      <listitem>
        <para>Granska filer och mappar</para>
        <para>Du kan betrakta dina filer och mappar i ikon- eller listform. Du kan titta p&aring; inneh&aring;llet i vissa typer av filer i ett <application>Nautilus</application>-f&ouml;nster. Du kan &auml;ven &ouml;ppna filerna i n&aring;got l&auml;mpligt program fr&aring;n <application>Nautilus</application>. </para>
      </listitem>
      <listitem>
        <para>Hantera filer och mappar</para>
        <para>Du kan skapa, flytta, kopiera, ta bort och byta namn p&aring; filer och mappar med <application>Nautilus</application> hj&auml;lp.</para>
      </listitem>
      <listitem>
        <para>K&ouml;ra skript</para>
        <para>Du kan k&ouml;ra skript fr&aring;n <application>Nautilus</application> och du kan v&auml;lja filer och mappar som skripten ska k&ouml;ras p&aring;.</para>
      </listitem>
      <listitem>
        <para>Anpassa filer och mappar</para>
        <para>Du kan ge filerna och mapparna emblem som visar i vilket tillst&aring;nd de befinner sig. Du kan exempelvis ge en fil emblemet Viktigt f&ouml;r att visa att den &auml;r viktig. Du kan &auml;ven anpassa mapparna p&aring; f&ouml;ljande s&auml;tt: <itemizedlist><listitem><para>L&auml;gga till en anteckning till en mapp.</para></listitem><listitem><para>Ange ett s&auml;rskilt bakgrundsm&ouml;nster.</para></listitem><listitem><para>Ange en zoomningsinst&auml;llning.</para></listitem></itemizedlist></para>
      </listitem>
    </itemizedlist>
    <para>Det &auml;r &auml;ven i <application>Nautilus</application> som skrivbordsbakgrunden st&auml;lls in. </para>
    <sect2 id="gosoverview-58">
      <title>S&aring; h&auml;r &ouml;ppnar du filer fr&aring;n filhanteraren Nautilus</title>
      <para>Dubbelklicka p&aring; mappikonerna i inneh&aring;llspanelen om du vill flytta till en mapp som inneh&aring;ller en fil som du vill &ouml;ppna. Dubbelklicka p&aring; filikonen n&auml;r filen som du vill &ouml;ppna visas. D&aring; &ouml;ppnas filen. </para>
    </sect2>
    <sect2 id="gosoverview-57">
      <title>S&aring; h&auml;r flyttar du filer fr&aring;n en mapp till en annan</title>
      <para>Du kan flytta filer fr&aring;n en mapp till en annan genom att &ouml;ppna tv&aring; eller flera <application>Nautilus</application>-f&ouml;nster. &Ouml;ppna olika mappar i varje f&ouml;nster och dra sedan filerna fr&aring;n det ena till det andra. </para>
    </sect2>
  </sect1>
  <sect1 id="gosgetstarted-11">
    <title>Skrivbordsbakgrund</title>
    <indexterm>
      <primary>Nautilus skrivbordsbakgrund</primary>
      <see>skrivbordsbakgrund </see>
    </indexterm>
    <indexterm>
      <primary>skrivbordsbakgrund</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>Skrivbordsbakgrunden &auml;r en av skrivbordets aktiva komponenter. Du kan utf&ouml;ra f&ouml;ljande &aring;tg&auml;rder med skrivbordsbakgrundens hj&auml;lp:</para>
    <itemizedlist>
      <listitem>
        <para>Starta program och &ouml;ppna filer och mappar. </para>
        <para>Du kan l&auml;gga till <firstterm>objekt p&aring; skrivbordsbakgrunden</firstterm> s&aring; att du l&auml;tt kommer &aring;t filer, mappar och program som du anv&auml;nder ofta. Du kan exempelvis l&auml;gga till en programstartare f&ouml;r ett program som du anv&auml;nder ofta.</para>
      </listitem>
      <listitem>
        <para>&Ouml;ppna <guimenu>Skrivbordsbakgrund</guimenu>-menyn.</para>
        <para>H&ouml;gerklicka p&aring; skrivbordsbakgrunden. Menyn <guimenu>Skrivbordsbakgrund</guimenu> visas. Du kan utnyttja menyn <guimenu>Skrivbordsbakgrund</guimenu> f&ouml;r att utf&ouml;ra &aring;tg&auml;rder p&aring; skrivbordsbakgrunden.</para>
      </listitem>
    </itemizedlist>
    <para>Filhanteraren <application>Nautilus</application> hanterar skrivbordsbakgrunden.</para>
    <sect2 id="gosoverview-29">
      <title>S&aring; h&auml;r &ouml;ppnar du skrivbordsbakgrundsobjekt</title>
      <para>Dubbelklicka p&aring; objektet i skrivbordsbakgrunden om du vill &ouml;ppna det. Du kan ange inst&auml;llningar i <application>Nautilus</application>-f&ouml;nstret som inneb&auml;r att du bara beh&ouml;ver klicka en g&aring;ng f&ouml;r att utf&ouml;ra standard&aring;tg&auml;rden.</para>
    </sect2>
    <sect2 id="gosoverview-19">
      <title>S&aring; h&auml;r l&auml;gger du till objekt p&aring; skrivbordsbakgrunden</title>
      <para>Du kan l&auml;gga till objekt p&aring; skrivbordsbakgrunden s&aring; att du l&auml;tt kommer &aring;t filer, mappar och program som du anv&auml;nder ofta. Du kan l&auml;gga till objekt p&aring; skrivbordsbakgrunden p&aring; f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>L&auml;gg till en programstartare p&aring; skrivbordsbakgrunden med hj&auml;lp av menyn <guimenu>Skrivbordsbakgrund</guimenu>.</para>
        </listitem>
        <listitem>
          <para>Dra ett objekt fr&aring;n ett av filhanterarens f&ouml;nster till skrivbordsbakgrunden. Du kan exempelvis skapa en symbolisk l&auml;nk till en fil som du anv&auml;nder ofta och sedan dra l&auml;nken till skrivbordsbakgrunden. Ikonens l&auml;nk flyttas d&aring; till skrivbordsbakgrunden. Dubbelklicka p&aring; ikonen om du vill &ouml;ppna filen. Du kan &auml;ven dra filer och mappar till skrivbordsbakgrunden. </para>
        </listitem>
        <listitem>
          <para>Dra en programstartare fr&aring;n en meny till skrivbordsbakgrunden. Du kan t ex visa en meny som inneh&aring;ller en programstartare f&ouml;r ett program som du anv&auml;nder ofta och sedan dra programstartaren till skrivbordsbakgrunden. </para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
  <sect1 id="gosoverview-509">
    <title>Ikonen B&ouml;rja h&auml;r</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/naut_starthere_launcher.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Ikonen Börja Här.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>B&ouml;rja h&auml;r, ikon</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <indexterm>
      <primary>filhanterare</primary>
      <secondary>B&ouml;rja h&auml;r, ikon</secondary>
      <see>B&ouml;rja h&auml;r, ikon</see>
    </indexterm>
    <para>Med platsen <guilabel>B&ouml;rja h&auml;r</guilabel> kommer du &aring;t f&ouml;ljande funktioner: </para>
    <itemizedlist>
      <listitem>
        <para>
          <guilabel>Program</guilabel>
        </para>
        <para>Dubbelklicka p&aring; <guilabel>Program</guilabel> om du vill komma &aring;t de viktigaste GNOME-programmen. Du kan &auml;ven komma &aring;t <guimenu>Program</guimenu>-menyn via <guimenu>GNOME-menyn</guimenu> och menypanelen.</para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Skrivbordsinst&auml;llningar</guilabel>
        </para>
        <para>Dubbelklicka p&aring; <guilabel>Skrivbordsinst&auml;llningar</guilabel> om du vill anpassa skrivbordet. </para>
      </listitem>
      <listitem>
        <para>Program som du kan anv&auml;nda f&ouml;r att konfigurera datorn som en server och v&auml;lja andra systeminst&auml;llningar.</para>
      </listitem>
    </itemizedlist>
    <para>Du kan komma &aring;t ikonen <guilabel>B&ouml;rja h&auml;r</guilabel> p&aring; f&ouml;ljande s&auml;tt:</para>
    <itemizedlist>
      <listitem>
        <para>Fr&aring;n ett <application>Nautilus</application>-f&ouml;nster</para>
        <para>V&auml;lj <menuchoice><guimenu>G&aring;</guimenu><guimenuitem>B&ouml;rja h&auml;r</guimenuitem></menuchoice>. Inneh&aring;llet i <guilabel>B&ouml;rja h&auml;r</guilabel> visas i f&ouml;nstret.</para>
      </listitem>
      <listitem>
        <para>Fr&aring;n skrivbordsbakgrunden</para>
        <para>Dubbelklicka p&aring; objektet <guilabel>B&ouml;rja h&auml;r</guilabel> p&aring; skrivbordsbakgrunden. Inneh&aring;llet i <guilabel>B&ouml;rja h&auml;r</guilabel> visas i ett <application>Nautilus</application>-f&ouml;nster.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-55">
    <title>Skrivbordsinst&auml;llningar</title>
    <indexterm>
      <primary>inst&auml;llningsverkyg</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>Du kan konfigurera n&auml;stan alla skrivbordets funktioner med hj&auml;lp av inst&auml;llningsverktygen. Varje verktyg p&aring;verkar en s&auml;rskild del av skrivbordets beteende. Du kan t ex v&auml;lja ett tema f&ouml;r skrivbordet med hj&auml;lp av ett inst&auml;llningsverktyg. Ett <firstterm>tema</firstterm> &auml;r en grupp samordnade inst&auml;llningar som avg&ouml;r hur en del av anv&auml;ndargr&auml;nssnittet ser ut. </para>
    <para>F&ouml;r bekv&auml;mlighets skull &auml;r grupperna indelade i f&ouml;ljande huvudomr&aring;den: </para>
    <itemizedlist>
      <listitem>
        <para>Standard</para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Hj&auml;lpmedel</guilabel>
        </para>
      </listitem>
      <listitem>
        <para>
          <guilabel>Avancerat</guilabel>
        </para>
      </listitem>
    </itemizedlist>
    <para>Du kan starta skrivbordsinst&auml;llningsverktygen p&aring; n&aring;got av f&ouml;ljande s&auml;tt:</para>
    <itemizedlist>
      <listitem>
        <para>V&auml;lj <menuchoice><guimenu>Program</guimenu><guimenuitem>Skrivbordsinst&auml;llningar</guimenuitem></menuchoice>. V&auml;lj &ouml;nskat alternativ p&aring; undermenyerna. </para>
      </listitem>
      <listitem>
        <para>Dubbelklicka p&aring; objektet <guilabel>B&ouml;rja h&auml;r</guilabel> p&aring; skrivbordsbakgrunden. Ett <application>Nautilus</application>-f&ouml;nster &ouml;ppnas och visar inneh&aring;llet i <guilabel>B&ouml;rja h&auml;r</guilabel>. Dubbelklicka p&aring; objektet <guilabel>Skrivbordsinst&auml;llningar</guilabel> i <application>Nautilus</application>-f&ouml;nstret om du vill visa skrivbordsinst&auml;llningsverktygen. Dubbelklicka p&aring; &ouml;nskad post.</para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-54">
    <title>Program</title>
    <indexterm>
      <primary>program</primary>
      <secondary>&ouml;versikt</secondary>
    </indexterm>
    <para>GNOME-skrivbordets program har flera gemensamma egenskaper. Programmen &auml;r t ex konsekvent utformade. Programmen har gemensamma egenskaper eftersom de utnyttjar samma programmeringsbibliotek. Ett program som anv&auml;nder de vanliga GNOME-programmeringsbiblioteken &auml;r ett <firstterm>GNOME-kompatibelt program</firstterm>. <application>Nautilus</application> och textredigeraren <application>gedit</application> &auml;r tv&aring; exempel p&aring; GNOME-kompatibla program.</para>
    <para>I GNOME ing&aring;r andra bibliotek &auml;n de bibliotek som operativsystemet st&auml;ller till f&ouml;rfogande. Biblioteken ger GNOME m&ouml;jlighet att k&ouml;ra s&aring;v&auml;l befintliga program som GNOME-kompatibla program. Om ditt operativsystem t ex &auml;r UNIX-baserat kan du k&ouml;ra befintliga X11-program och Motifprogram fr&aring;n GNOME-skrivbordet.</para>
    <para>Detta &auml;r n&aring;gra av egenskaperna hos GNOME-kompatibla program: </para>
    <itemizedlist>
      <listitem>
        <para>Konsekvent utformning</para>
        <para>GNOME-kompatibla program &auml;r konsekvent utformade. GNOME-kompatibla program ser ut p&aring; det s&auml;tt som du anger med hj&auml;lp av skrivbordets inst&auml;llningsverktyg. Du kan anv&auml;nda verktygen h&auml;r nedan om du vill &auml;ndra utseendet p&aring; dina GNOME-kompatibla program:<itemizedlist><listitem><para><menuchoice><guimenu>Program</guimenu><guisubmenu> Skrivbordsinst&auml;llningar</guisubmenu><guimenuitem>Menyer och verktygsrader </guimenuitem></menuchoice></para></listitem><listitem><para><menuchoice><guimenu>Program</guimenu><guisubmenu> Skrivbordsinst&auml;llningar</guisubmenu><guimenuitem>Tema</guimenuitem></menuchoice></para></listitem></itemizedlist></para>
      </listitem>
      <listitem>
        <para>Menyrader, verktygsrader och statusrader</para>
        <para>De flesta GNOME-kompatibla program har en menyrad, en verktygsrad och en statusrad. Menyraden inneh&aring;ller alltid en meny som heter <guimenu>Arkiv</guimenu> och en som heter <guimenu>Hj&auml;lp</guimenu>. <guimenu>Arkiv</guimenu>-menyn inneh&aring;ller alltid ett alternativ som heter <guimenuitem>Avsluta</guimenuitem> och <guimenu>Hj&auml;lp</guimenu>-menyn alltid ett alternativ som heter <guimenuitem>Om</guimenuitem>.</para>
        <para>En <firstterm>verktygsrad</firstterm> &auml;r en rad som visas under menyraden. En verktygsrad inneh&aring;ller knappar som representerar de vanligaste kommandona. En <firstterm>statusrad</firstterm> &auml;r en rad l&auml;ngst ned i ett f&ouml;nster, som inneh&aring;ller aktuell information om det som visas i f&ouml;nstret just nu. GNOME-kompatibla program kan &auml;ven inneh&aring;lla andra rader. <application>Nautilus</application> inneh&aring;ller t ex en adressrad.</para>
        <para>Vissa av raderna i GNOME-kompatibla program kan tas loss och flyttas runt. Raden har ett handtag som du kan gripa tag i f&ouml;r att flytta raden till ett annat st&auml;lle. Du kan dra raden och f&auml;sta den vid en annan av f&ouml;nstrets kanter eller dra den till en annan del av skrivbordet. Du kan t ex ta loss menyraden, verktygsraden och adressraden i filhanteraren <application>Nautilus</application>. </para>
      </listitem>
      <listitem>
        <para>Standardsnabbkommandon</para>
        <para>Ett visst snabbkommando utf&ouml;r samma &aring;tg&auml;rd i alla GNOME-kompatibla program. Du kan t ex trycka p&aring; <keycombo><keycap>Control</keycap><keycap>Q</keycap></keycombo> om du vill avsluta ett GNOME-kompatibelt program. Tryck p&aring; <keycombo><keycap>Control</keycap><keycap>Z</keycap></keycombo> om du vill &aring;ngra en &aring;tg&auml;rd i ett GNOME-kompatibelt program. </para>
      </listitem>
      <listitem>
        <para>Dra och sl&auml;ppa</para>
        <para>Alla GNOME-kompatibla program implementerar dra och sl&auml;pp&aring;tg&auml;rder med hj&auml;lp av samma protokoll. De GNOME-kompatibla programmen reagerar allts&aring; p&aring; samma s&auml;tt n&auml;r du drar och sl&auml;pper objekt.</para>
        <para>Bruket av ett gemensamt protokoll inneb&auml;r dessutom att de GNOME-kompatibla programmen kan samverka p&aring; ett sinnrikt s&auml;tt. Bland annat k&auml;nner GNOME-kompatibla program igen formatet p&aring; objekt som dras. N&auml;r du drar en HTML-fil fr&aring;n ett <application>Nautilus</application>-f&ouml;nster till en webbl&auml;sare visas filen i HTML-format i webbl&auml;saren. Om du emellertid drar HTML-filen till en textredigerare visas den i textformat i textredigeraren. </para>
      </listitem>
    </itemizedlist>
  </sect1>
  <sect1 id="gosoverview-12">
    <title>S&aring; h&auml;r hittar du mer information</title>
    <indexterm>
      <primary>hj&auml;lp</primary>
      <secondary>f&aring; mer hj&auml;lp</secondary>
    </indexterm>
    <para>Skrivbordet har en hj&auml;lpfunktion som du kan anv&auml;nda om du vill ta reda p&aring; mer om f&ouml;ljande &auml;mnen: </para>
    <itemizedlist>
      <listitem>
        <para>Skrivbords&auml;mnen</para>
      </listitem>
      <listitem>
        <para>Panelprogram</para>
      </listitem>
      <listitem>
        <para>Program</para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosoverview-31">
      <title>S&aring; h&auml;r tar du reda p&aring; mer information om skrivbords&auml;mnen</title>
      <indexterm>
        <primary>hj&auml;lp</primary>
        <secondary>starta hj&auml;lpsystemet</secondary>
      </indexterm>
      <indexterm>
        <primary>hj&auml;lp</primary>
        <secondary>skrivbords&auml;mnen</secondary>
      </indexterm>
      <para>Du kan f&aring; mer information om vissa skrivbords&auml;mnen i det integrerade hj&auml;lpsystemet <application>Yelp</application>. V&auml;lj <menuchoice><guimenu>Program</guimenu><guimenuitem>Hj&auml;lp</guimenuitem></menuchoice> om du vill starta hj&auml;lpsystemet <application> Yelp</application>. </para>
    </sect2>
    <sect2 id="gosgetstarted-33">
      <title>S&aring; h&auml;r tar du reda p&aring; mer information om panelprogram</title>
      <indexterm>
        <primary>panelprogram</primary>
        <secondary>f&aring; hj&auml;lp om</secondary>
      </indexterm>
      <indexterm>
        <primary>hj&auml;lp</primary>
        <secondary>panelprogram</secondary>
      </indexterm>
      <para>H&ouml;gerklicka p&aring; panelprogrammet och v&auml;lj sedan <guimenuitem>Hj&auml;lp</guimenuitem> om du vill ha mer information om ett visst panelprogram. </para>
    </sect2>
    <sect2 id="gosgetstarted-35">
      <title>S&aring; h&auml;r tar du reda p&aring; mer information om program</title>
      <indexterm>
        <primary>program</primary>
        <secondary>hj&auml;lp</secondary>
      </indexterm>
      <indexterm>
        <primary>hj&auml;lp</primary>
        <secondary>program</secondary>
      </indexterm>
      <para>Starta programmet och v&auml;lj sedan <menuchoice><guimenu>Hj&auml;lp</guimenu><guimenuitem>Inneh&aring;ll</guimenuitem></menuchoice> om du vill ha reda p&aring; mer information om ett s&auml;rskilt program. Du kan ocks&aring; starta programmet och sedan trycka p&aring; <keycap> F1</keycap>.</para>
    </sect2>
  </sect1>
</chapter>
