<?xml version="1.0" encoding="utf-8"?>
<chapter id="gospanel-1">
  <title>Arbeta med paneler</title>
  <highlights>
    <para>Informationen i det h&auml;r kapitlet handlar om hur du anv&auml;nder paneler. </para>
  </highlights>
  <sect1 id="gospanel-2">
    <title>Introduktion till paneler</title>
    <indexterm>
      <primary>paneler</primary>
      <secondary>introduktion till</secondary>
    </indexterm>
    <para>En panel &auml;r ett omr&aring;de p&aring; skrivbordet d&auml;r du kan v&auml;lja att k&ouml;ra program och panelprogram och utf&ouml;ra andra &aring;tg&auml;rder. N&auml;r du startar en session f&ouml;r f&ouml;rsta g&aring;ngen inneh&aring;ller skrivbordet f&ouml;ljande paneler: </para>
    <itemizedlist>
      <listitem>
        <para>Menypanel</para>
      </listitem>
      <listitem>
        <para>Kantpanel l&auml;ngst ned p&aring; skrivbordet</para>
      </listitem>
    </itemizedlist>
    <para>Panelerna beskrivs i de f&ouml;ljande avsnitten.</para>
    <sect2 id="gospanel-6">
      <title>Menypanelen</title>
      <indexterm>
        <primary>Menypanelen</primary>
        <secondary>introduktion</secondary>
      </indexterm>
      <indexterm>
        <primary>paneler</primary>
        <secondary>Menypanelen</secondary>
        <see>Menypanelen</see>
      </indexterm>
      <para>Menypanelen l&ouml;per l&auml;ngs sk&auml;rmens &ouml;vre kant. Menypanelen inneh&aring;ller textmenyer i st&auml;llet f&ouml;r bildmenyer. <xref linkend="gospanel-FIG-60"/> visar menypanelen. Systemadministrat&ouml;ren kan ha st&auml;llt in menypanelen enligt lokala kriterier. Det kan allts&aring; t&auml;nkas att menypanelen som du har framf&ouml;r dig ser n&aring;got annorlunda ut.</para>
      <figure id="gospanel-FIG-60">
        <title>En typisk menypanel</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/menu_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Standardmenypanelen. Bilden förklaras av den omgivande texten.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <indexterm>
        <primary>Menypanel</primary>
        <secondary>standardinneh&aring;ll</secondary>
      </indexterm>
      <para>Standardmenypanelen inneh&aring;ller f&ouml;ljande objekt: </para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec3" colwidth="30.95*"/>
          <colspec colname="colspec4" colwidth="69.05*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Objekt</para>
              </entry>
              <entry valign="top">
                <para> Beskrivning </para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry valign="top">
                <para><guimenu>Program</guimenu>-menyn:</para>
              </entry>
              <entry valign="top">
                <para><guimenu>Program</guimenu>-menyn inneh&aring;ller GNOME:s standardprogram.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Menyn <guimenu>&Aring;tg&auml;rder</guimenu></para>
              </entry>
              <entry valign="top">
                <para><guimenu>&Aring;tg&auml;rder</guimenu>-menyn inneh&aring;ller olika kommandon som du kan utf&ouml;ra skrivbords&aring;tg&auml;rder med. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3">
                <para>Programstartare f&ouml;r hemmappen</para>
              </entry>
              <entry colname="colspec4">
                <para>Klicka p&aring; den h&auml;r programstartaren om du vill &ouml;ppna hemmappen i ett <application>Nautilus</application>-filhanterarf&ouml;nster. </para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3">
                <para>Programstartare f&ouml;r <application>Terminal</application></para>
              </entry>
              <entry colname="colspec4">
                <para>Klicka p&aring; den h&auml;r programstartaren om du vill starta <application>Terminal</application>-programmet. Med <application>Terminal </application> f&aring;r du tillg&aring;ng till en UNIX-kommandorad.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3" valign="top">
                <para>Panelprogrammet <application>Volymkontroll</application></para>
              </entry>
              <entry colname="colspec4" valign="top">
                <para>Du kan &auml;ndra volymen p&aring; systemh&ouml;gtalarna med hj&auml;lp av panelprogrammet <application>Volymkontroll</application>.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Panelprogrammet <application>Klocka</application></para>
              </entry>
              <entry valign="top">
                <para>Panelprogrammet <application>Klocka</application> visar vad klockan &auml;r. Om du klickar p&aring; urtavlan visas en meny med klockkommandon.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec3" valign="top">
                <indexterm>
                  <primary>Menypanel </primary>
                  <secondary>f&ouml;nsterlistans ikon</secondary>
                </indexterm>
                <para>F&ouml;nsterlistans ikon</para>
              </entry>
              <entry colname="colspec4" valign="top">
                <para>F&ouml;nsterlistan &auml;r en lista &ouml;ver alla &ouml;ppna f&ouml;nster. Klicka p&aring; ikonen l&auml;ngst till h&ouml;ger p&aring; menypanelen och v&auml;lj ett f&ouml;nster som du vill aktivera. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Till skillnad fr&aring;n andra paneltyper kan det bara finnas en menypanel &aring;t g&aring;ngen p&aring; skrivbordet.</para>
    </sect2>
    <sect2 id="gospanel-3">
      <title>Den undre kantpanelen</title>
      <indexterm>
        <primary>paneler</primary>
        <secondary>undre kantpanelen</secondary>
        <see>kantpanel, undre</see>
      </indexterm>
      <indexterm>
        <primary>kantpanel, undre</primary>
        <secondary>introduktion</secondary>
      </indexterm>
      <para>N&auml;r datorn startas l&ouml;per en kantpanel l&auml;ngs skrivbordets underkant. <xref linkend="gospanel-FIG-58"/> visar en normal undre kantpanel. Systemadministrat&ouml;ren kan ha st&auml;llt in den undre kantpanelen enligt lokala kriterier. Det kan allts&aring; t&auml;nkas att den undre kantpanel som du har framf&ouml;r dig ser n&aring;got annorlunda ut. </para>
      <figure id="gospanel-FIG-58">
        <title>En normal undre kantpanel</title>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/menu_panel.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>Visar den undre kantpanelen. Bilden förklaras av den omgivande texten.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </figure>
      <indexterm>
        <primary>kantpanel, undre</primary>
        <secondary>normalt inneh&aring;ll</secondary>
      </indexterm>
      <para>Den undre kantpanelen inneh&aring;ller f&ouml;ljande panelprogram:</para>
      <itemizedlist>
        <listitem>
          <para><application>F&ouml;nsterlista</application>: Inneh&aring;ller en knapp f&ouml;r varje &ouml;ppet f&ouml;nster. Du kan minimera och &aring;terst&auml;lla f&ouml;nster med panelprogrammet <application>F&ouml;nsterlista</application>.</para>
        </listitem>
        <listitem>
          <para><application>Arbetsytebytare</application>: G&ouml;r det m&ouml;jligt att v&auml;xla mellan olika arbetsytor.</para>
        </listitem>
      </itemizedlist>
      <para>Du kan &auml;ndra den undre kantpanelens upptr&auml;dande och utseende efter eget tycke och smak. Du kan &auml;ven l&auml;gga till eller ta bort objekt fr&aring;n den undre kantpanelen. Du kan skapa flera paneler och ge dem individuella egenskaper och bakgrunder och fylla dem med olika objekt. Du kan &auml;ven d&ouml;lja paneler.</para>
    </sect2>
  </sect1>
  <sect1 id="gospanel-5">
    <title>Hantera paneler</title>
    <indexterm>
      <primary>paneler</primary>
      <secondary>hantera</secondary>
    </indexterm>
    <para>De f&ouml;ljande avsnitten beskriver hur det g&aring;r till att hantera paneler.</para>
    <sect2 id="gospanel-10">
      <title>S&aring; h&auml;r l&auml;gger du till en ny panel</title>
      <indexterm>
        <primary>paneler</primary>
        <secondary>l&auml;gga till ny </secondary>
      </indexterm>
      <para>Du kan l&auml;gga till olika typer av paneler p&aring; skrivbordet. <xref linkend="gospanel-TBL-47"/> visar en lista &ouml;ver vilka typer av paneler du kan l&auml;gga till och deras egenskaper. </para>
      <table frame="topbot" id="gospanel-TBL-47">
        <title>Paneltyper</title>
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="24.28*"/>
          <colspec colname="colspec1" colwidth="37.36*"/>
          <colspec colname="colspec2" colwidth="37.36*"/>
          <thead>
            <row rowsep="1">
              <entry valign="top">
                <para>Paneltyp</para>
              </entry>
              <entry valign="top">
                <para>F&auml;stfunktion </para>
              </entry>
              <entry valign="top">
                <para> Storlek</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>H&ouml;rnpanel</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>F&auml;ster vid n&aring;gon av sk&auml;rmens kanter, men kan bara f&auml;stas vid kantens mitt eller h&ouml;rn. </para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>Utvidgas s&aring; mycket som kr&auml;vs f&ouml;r att objekten p&aring; panelen ska vara synliga.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Kantpanel</para>
              </entry>
              <entry valign="top">
                <para> F&auml;ster vid n&aring;gon av sk&auml;rmens kanter. Startpanelen l&auml;ngst ned p&aring; skrivbordet &auml;r ett exempel p&aring; en kantpanel. </para>
              </entry>
              <entry valign="top">
                <para> L&ouml;per l&auml;ngs hela kanten som panelen &auml;r f&auml;st vid.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Flytande panel</para>
              </entry>
              <entry valign="top">
                <para> F&auml;ster inte vid n&aring;got. Du kan placera en flytande panel var som helst p&aring; skrivbordet.</para>
              </entry>
              <entry valign="top">
                <para>Utvidgas s&aring; mycket som kr&auml;vs f&ouml;r att objekten p&aring; panelen ska vara synliga.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Glidande panel</para>
              </entry>
              <entry valign="top">
                <para> F&auml;ster vid vilken som helst av sk&auml;rmens kanter. Panelen kan f&auml;stas var som helst p&aring; kanten. </para>
              </entry>
              <entry valign="top">
                <para>Utvidgas s&aring; mycket som kr&auml;vs f&ouml;r att objekten p&aring; panelen ska vara synliga.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Menypanel</para>
              </entry>
              <entry colname="colspec1">
                <para> F&auml;ster vid sk&auml;rmens &ouml;verkant. Det g&aring;r inte att flytta menypanelen.</para>
              </entry>
              <entry colname="colspec2" valign="top">
                <para>L&ouml;per l&auml;ngs hela &ouml;verkanten p&aring; sk&auml;rmen. Det kan bara finnas en menypanel p&aring; skrivbordet.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </table>
      <para>G&ouml;r s&aring; h&auml;r om du vill skapa en panel:</para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; ett tomt omr&aring;de p&aring; en valfri panel och v&auml;lj sedan <guimenuitem>Ny panel</guimenuitem>.</para>
        </listitem>
        <listitem>
          <para>V&auml;lj den typ av panel som du vill l&auml;gga till. Den nya panelen l&auml;ggs till p&aring; skrivbordet. Den nya panelen inneh&aring;ller inga objekt f&ouml;rutom menypanelen. </para>
          <para>Du kan anpassa den nya panelen s&aring; att den passar dina behov.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gospanel-11">
      <title>S&aring; h&auml;r &auml;ndrar du en panel</title>
      <indexterm>
        <primary>paneler</primary>
        <secondary>&auml;ndra</secondary>
      </indexterm>
      <para>Du m&aring;ste klicka med den h&ouml;gra, mellersta eller v&auml;nstra musknappen p&aring; ett tomt omr&aring;de p&aring; panelen om du vill &auml;ndra n&aring;got p&aring; den. Du kan &auml;ven aktivera panelen genom att klicka med den mellersta eller h&ouml;gra musknappen p&aring; en av d&ouml;ljknapparna om det inte finns n&aring;gon tom yta p&aring; panelen. &Auml;ndra panelens egenskaper s&aring; att panelens d&ouml;ljknappar syns om de inte g&ouml;r det. </para>
      <para>Du &auml;ndrar en panel med musknapparna p&aring; f&ouml;ljande s&auml;tt:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="30.65*"/>
          <colspec colname="colspec1" colwidth="69.35*"/>
          <tbody>
            <row>
              <entry valign="top">
                <para>Klicka med mellersta musknappen</para>
              </entry>
              <entry valign="top">
                <para> G&ouml;r det m&ouml;jligt att ta tag i panelen och dra den till en ny position.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Klicka med h&ouml;gra musknappen</para>
              </entry>
              <entry valign="top">
                <para> Panelens popupmeny visas.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gospanel-12">
      <title>S&aring; h&auml;r flyttar du en panel</title>
      <indexterm>
        <primary>paneler</primary>
        <secondary>flytta</secondary>
      </indexterm>
      <para>Du kan flytta paneler till olika positioner p&aring; skrivbordet. Tryck ned och h&aring;ll kvar den mellersta musknappen och dra sedan panelen till den nya positionen om du vill flytta den.</para>
      <para>Om du drar en flytande panel f&ouml;ljer panelen med pekaren. Panelen f&auml;sts inte vid n&aring;gon del av skrivbordet. Om du drar en h&ouml;rnpanel, en kantpanel eller en glidande panel f&auml;sts den vid sk&auml;rmens kant.</para>
      <note>
        <para>Det g&aring;r inte att flytta menypanelen.</para>
      </note>
    </sect2>
    <sect2 id="gospanel-7">
      <title>S&aring; h&auml;r d&ouml;ljer du en panel</title>
      <indexterm>
        <primary>paneler</primary>
        <secondary>d&ouml;lja</secondary>
      </indexterm>
      <para>Du kan d&ouml;lja och visa paneler med undantag f&ouml;r menypanelen. Anv&auml;nd n&aring;gon av d&ouml;ljknapparna om du vill d&ouml;lja en panel. &Auml;ndra panelens egenskaper panelens d&ouml;ljknappar syns om de inte g&ouml;r det. </para>
      <para>Knapparna &auml;r placerade p&aring; panelens b&auml;gge &auml;ndar. Det kan finnas en ikon i form av en pil p&aring; knapparna. Figuren h&auml;r nedan visar hur d&ouml;ljknapparna ser ut. </para>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/four_hide_button.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>En horisontell och en vertikal panel som båda innehåller döljknappar.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <para>Klicka p&aring; n&aring;gon av d&ouml;ljknapparna om du vill d&ouml;lja en panel. Panelen d&ouml;ljs i samma riktning som pilen p&aring; knappen visar. Knappen p&aring; panelens andra sida f&ouml;rblir synlig.</para>
      <para>Klicka p&aring; den synliga knappen om du vill visa en dold panel igen. Panelen &ouml;kar i storlek i samma riktning som pilen p&aring; knappen visar. B&aring;da knapparna &auml;r nu synliga.</para>
      <para>Du kan ange att en panel ska d&ouml;ljas automatiskt. Om du g&ouml;r det d&ouml;ljs panelen automatiskt d&aring; pekaren inte befinner sig &ouml;ver panelen. Panelen &aring;terst&auml;lls om du placerar pekaren &ouml;ver den del av sk&auml;rmen d&auml;r panelen finns. &Auml;ndra panelens egenskaper om du vill att den ska d&ouml;ljas automatiskt.</para>
      <note>
        <para>Knapparna beter sig n&aring;got annorlunda p&aring; en kantpanel. Du kan anv&auml;nda knapparna p&aring; f&ouml;ljande s&auml;tt, om panelen befinner sig i n&aring;got av sk&auml;rmens h&ouml;rn:</para>
        <itemizedlist>
          <listitem>
            <para>Klicka p&aring; knappen som befinner sig n&auml;rmast sk&auml;rmens kant om du vill d&ouml;lja panelen. Det &auml;r det normala f&ouml;rfarandet.</para>
          </listitem>
          <listitem>
            <para>Klicka p&aring; knappen som befinner sig l&auml;ngst bort fr&aring;n sk&auml;rmens kant om du vill flytta panelen till motsatta h&ouml;rnet p&aring; sk&auml;rmen.</para>
          </listitem>
        </itemizedlist>
      </note>
    </sect2>
    <sect2 id="gospanel-28">
      <title>S&aring; h&auml;r &auml;ndrar du panelegenskaper</title>
      <indexterm>
        <primary>paneler</primary>
        <secondary>&auml;ndra egenskaper</secondary>
      </indexterm>
      <para>V&auml;lj <menuchoice><guimenu>Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Avancerat</guisubmenu><guimenuitem>Panel</guimenuitem></menuchoice> och utf&ouml;r &ouml;nskade &auml;ndringar om du vill &auml;ndra inst&auml;llningarna f&ouml;r samtliga paneler. Du kan t ex ange diverse inst&auml;llningar som har med panelobjektens utseende och upptr&auml;dande att g&ouml;ra. </para>
      <para>Du kan &auml;ven &auml;ndra individuella panelers egenskaper. Du kan &auml;ndra varje panels egenskaper, t ex dess typ och utseende och hur den beter sig n&auml;r den d&ouml;ljs. </para>
      <note>
        <para>Det g&aring;r inte att &auml;ndra menypanelens egenskaper.</para>
      </note>
      <para>S&aring; h&auml;r &auml;ndrar du en panels egenskaper: </para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan <guimenuitem>Egenskaper</guimenuitem>. Dialogf&ouml;nstret <guilabel>Panelegenskaper</guilabel> visas. </para>
          <para>Dialogf&ouml;nstret <guilabel>Panelegenskaper</guilabel> inneh&aring;ller f&ouml;ljande flikavsnitt: </para>
          <itemizedlist>
            <listitem>
              <para>
                <guilabel><replaceable>Paneltyp</replaceable> panel</guilabel>
              </para>
            </listitem>
            <listitem>
              <para>
                <guilabel>Bakgrund</guilabel>
              </para>
            </listitem>
          </itemizedlist>
        </listitem>
        <listitem>
          <para>Klicka p&aring; fliken <guilabel><replaceable>Paneltyp</replaceable> panel</guilabel> om du vill &auml;ndra panelens storlek eller position eller hur den beter sig d&aring; den d&ouml;ljs. Tabellen h&auml;r nedan beskriver dialogf&ouml;nsterelementen i flikavsnittet <guilabel><replaceable>Paneltyp</replaceable> panel</guilabel>: </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec0" colwidth="28.57*"/>
              <colspec colname="colspec1" colwidth="71.43*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Dialogf&ouml;nsterelement</para>
                  </entry>
                  <entry valign="top">
                    <para>Beskrivning </para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>Position</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>Best&auml;mmer var panelen placeras p&aring; skrivbordet. Markera panelens &ouml;nskade position. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Storlek</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>V&auml;lj panelstorlek.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Orientera horisontellt</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>G&auml;ller enbart flytande paneler. Markera det h&auml;r alternativet om du &ouml;nskar en horisontell panel. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Orientera vertikalt</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>G&auml;ller enbart flytande paneler. Markera det h&auml;r alternativet om du &ouml;nskar en vertikal panel. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>Horisontellt avst&aring;nd</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>G&auml;ller enbart flytande paneler. Ange i rotationsrutan hur l&aring;ngt fr&aring;n skrivbordets v&auml;nstra kant panelen ska placeras. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec0">
                    <para>
                      <guilabel>Vertikalt avst&aring;nd</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec1">
                    <para>G&auml;ller enbart flytande paneler. Ange i rotationsrutan hur l&aring;ngt fr&aring;n skrivbordets &ouml;verkant panelen ska placeras. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Sk&auml;rmkantsavst&aring;nd</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>G&auml;ller enbart glidande paneler. Ange avst&aring;endet (i bildpunkter) mellan panelen och skrivbordskanten i den h&auml;r rotationsrutan. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>D&ouml;lj automatiskt</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Ange att panelen ska d&ouml;ljas automatiskt med det h&auml;r alternativet. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Visa d&ouml;ljknappar</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Markera det h&auml;r alternativet om du vill att d&ouml;ljknapparna ska vara synliga. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Pilar p&aring; d&ouml;ljknapp </guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>V&auml;lj det h&auml;r alternativet om du vill ha pilar p&aring; d&ouml;ljknapparna, under f&ouml;ruts&auml;ttning att de &auml;r aktiverade.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Klicka p&aring; fliken <guilabel>Bakgrund</guilabel> om du vill &auml;ndra panelens bakgrund. Flikavsnittet <guilabel>Bakgrund</guilabel> inneh&aring;ller f&ouml;ljande element: </para>
          <informaltable frame="topbot">
            <tgroup cols="3" colsep="0" rowsep="0">
              <colspec colwidth="27.00*"/>
              <colspec colname="colspec5" colwidth="29.14*"/>
              <colspec colname="colspec6" colwidth="42.86*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Dialogf&ouml;nsterelement</para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Beskrivning</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Bakgrundstyp</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>V&auml;lj panelens bakgrundstyp. Du kan v&auml;lja mellan f&ouml;ljande alternativ:</para>
                    <itemizedlist>
                      <listitem>
                        <para><guilabel>Standard</guilabel>: Den normala bakgrundstypen. Standardbakgrunden beror p&aring; inst&auml;llningarna i <menuchoice><guimenu>Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guimenuitem> Tema</guimenuitem></menuchoice>. </para>
                      </listitem>
                      <listitem>
                        <para><guilabel>F&auml;rg</guilabel>: Ger dig m&ouml;jlighet att v&auml;lja en f&auml;rg p&aring; panelens bakgrund.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Bild</guilabel>: Ger dig m&ouml;jlighet att v&auml;lja en bild som visas p&aring; panelens bakgrund. </para>
                      </listitem>
                    </itemizedlist>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Bakgrundsf&auml;rg</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>Klicka p&aring; knappen <guibutton>F&auml;rg som ska anv&auml;ndas</guibutton> om <guilabel>Bakgrundstyp</guilabel> har v&auml;rdet <guilabel>F&auml;rg</guilabel>. D&aring; visas f&auml;rgv&auml;ljaren. V&auml;lj &ouml;nskad f&auml;rg i f&auml;rgv&auml;ljaren. </para>
                  </entry>
                </row>
                <row>
                  <entry morerows="4" valign="top">
                    <para>
                      <guilabel>Bild</guilabel>
                    </para>
                  </entry>
                  <entry namest="colspec5" nameend="colspec6" valign="top">
                    <para>V&auml;lj vilken bild du vill ha som panelbakgrund om <guilabel>Bakgrundstyp</guilabel> har v&auml;rdet <guilabel>Bild</guilabel>. Ange f&ouml;ljande inst&auml;llningar f&ouml;r bakgrundsbilden:</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Skala inte bilden s&aring; att den passar</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Markera det h&auml;r alternativet om du vill att bakgrundsbilden visas upprepade g&aring;nger och fyller ut bakgrunden. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Skala bild</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Markera det h&auml;r alternativet om du vill att bakgrundsbilden skalas s&aring; att den fyller ut hela panelbakgrunden. Bildens proportioner bevaras. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Str&auml;ck ut bild</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para> Markera det h&auml;r alternativet om du vill att bakgrundsbilden ska t&ouml;jas s&aring; att den fyller ut hela panelbakgrunden. Bildens proportioner bevaras inte. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Rotera bild i vertikala paneler</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Markera det h&auml;r alternativet om du vill att bakgrundsbilden i vertikala paneler roteras. </para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
          <para>Du kan &auml;ven dra en f&auml;rg eller bild och sl&auml;ppa den p&aring; en panel om du vill ange att f&auml;rgen eller bilden ska anv&auml;ndas som panelbakgrund. Mer information finns i <xref linkend="gospanel-61"/>. </para>
        </listitem>
        <listitem>
          <para>St&auml;ng dialogf&ouml;nstret <guilabel>Panelegenskaper</guilabel> genom att klicka p&aring; <guibutton>St&auml;ng</guibutton>.</para>
        </listitem>
      </orderedlist>
      <sect3 id="gospanel-61">
        <title>S&aring; h&auml;r drar du en f&auml;rg eller bild till en panels bakgrund</title>
        <indexterm>
          <primary>paneler</primary>
          <secondary>&auml;ndra bakgrund</secondary>
        </indexterm>
        <para>Du kan dra en f&auml;rg eller bild och sl&auml;ppa den p&aring; en panel om du vill ange att den ska anv&auml;ndas som panelbakgrund. Du kan dra en f&auml;rg eller bild fr&aring;n m&aring;nga program. Du kan t ex dra en f&auml;rg fr&aring;n filhanteraren <application>Nautilus</application> till en panel om du vill att panelen ska ha bakgrundsf&auml;rgen i fr&aring;ga. Du kan &auml;ven dra en f&auml;rg fr&aring;n en f&auml;rgv&auml;ljare.</para>
        <para>Du kan dra en bild till en panel om du vill att panelen ska ha den som bakgrundsbild. Du kan &auml;ven dra m&ouml;nsterbilder fr&aring;n filhanteraren <application>Nautilus </application> om du vill st&auml;lla in panelens bakgrund. </para>
      </sect3>
    </sect2>
    <sect2 id="gospanel-31">
      <title>S&aring; har tar du bort en panel</title>
      <indexterm>
        <primary>paneler</primary>
        <secondary>ta bort</secondary>
      </indexterm>
      <para>H&ouml;gerklicka p&aring; panelen som du vill ta bort och v&auml;lj sedan <menuchoice><guimenuitem>Ta bort den h&auml;r panelen</guimenuitem></menuchoice>.</para>
      <note>
        <para>Det m&aring;ste alltid finnas &aring;tminstone en panel p&aring; skrivbordet. Om det bara finns en panel p&aring; skrivbordet g&aring;r den inte att ta bort.</para>
      </note>
    </sect2>
  </sect1>
  <sect1 id="gospanel-8">
    <title>Panelobjekt</title>
    <indexterm>
      <primary>paneler</primary>
      <secondary>panelobjekt</secondary>
      <see> panelobjekt</see>
    </indexterm>
    <para>I det h&auml;r avsnittet beskrivs vilka objekt du kan l&auml;gga till p&aring; och anv&auml;nda fr&aring;n paneler.</para>
    <sect2 id="gospanel-100">
      <title>Anv&auml;nda panelobjekt</title>
      <indexterm>
        <primary>panelobjekt</primary>
        <secondary>anv&auml;nda</secondary>
      </indexterm>
      <para>Du &auml;ndrar ett panelobjekt med musknapparna p&aring; f&ouml;ljande s&auml;tt:</para>
      <informaltable frame="topbot">
        <tgroup cols="2" colsep="0" rowsep="0">
          <colspec colname="colspec0" colwidth="30.65*"/>
          <colspec colname="colspec1" colwidth="69.35*"/>
          <tbody>
            <row>
              <entry colname="colspec0" valign="top">
                <para>Klicka med v&auml;nstra musknappen</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>Panelobjektet startas.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Klicka med mellersta musknappen</para>
              </entry>
              <entry valign="top">
                <para> G&ouml;r det m&ouml;jligt att ta tag i objektet och dra det till en ny position.</para>
              </entry>
            </row>
            <row>
              <entry valign="top">
                <para>Klicka med h&ouml;gra musknappen</para>
              </entry>
              <entry valign="top">
                <para> Panelens popupmeny visas.</para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
      <para>Panelprogram anv&auml;nds p&aring; ett annat s&auml;tt. Mer information finns i <xref linkend="gospanel-39"/>.</para>
    </sect2>
    <sect2 id="gospanel-15">
      <title>S&aring; h&auml;r l&auml;gger du till ett objekt i en panel</title>
      <indexterm>
        <primary>panelobjekt</primary>
        <secondary>l&auml;gga till</secondary>
      </indexterm>
      <para>Du kan l&auml;gga till ett objekt p&aring; en panel p&aring; flera s&auml;tt: </para>
      <itemizedlist>
        <listitem>
          <para>Fr&aring;n panelens popupmeny</para>
          <para>H&ouml;gerklicka p&aring; en tom yta p&aring; en panel. Panelens popupmeny visas. Panelens popupmeny inneh&aring;ller undermenyn <guisubmenu>L&auml;gg till i panelen</guisubmenu>. Undermenyn <guisubmenu>L&auml;gg till i panelen</guisubmenu> g&ouml;r det m&ouml;jligt att l&auml;gga till f&ouml;ljande objekt p&aring; panelerna: <itemizedlist><listitem><para>Tillbeh&ouml;rspanelprogram</para></listitem><listitem><para>Underh&aring;llningspanelprogram</para></listitem><listitem><para>Internetpanelprogram</para></listitem><listitem><para>Multimediepanelprogram</para></listitem><listitem><para>Verktygspanelprogram</para></listitem><listitem><para>Programstartare</para></listitem><listitem><para>Prgramstartare fr&aring;n menyer</para></listitem><listitem><para>GNOME-menyn</para></listitem><listitem><para>L&aring;dor</para></listitem><listitem><para>Knappen <guibutton>Logga ut</guibutton></para></listitem><listitem><para>Knappen <guibutton>L&aring;s</guibutton></para></listitem></itemizedlist></para>
        </listitem>
        <listitem>
          <para>Fr&aring;n en valfri meny</para>
          <para>Om du h&ouml;gerklickar p&aring; en programstartare p&aring; en valfri meny visas dess popupmeny. Du kan l&auml;gga till programstartaren p&aring; en panel med popupmenyns hj&auml;lp. </para>
          <para>Du kan &auml;ven dra menyer, programstartare och panelprogram fr&aring;n menyer till paneler. </para>
        </listitem>
        <listitem>
          <para>Fr&aring;n filhanteraren</para>
          <para>Varje programstartare och panelprogram h&ouml;r till en viss <filename>.desktop</filename>-fil. Du kan dra <filename>.desktop</filename>-filen till panelerna om du vill l&auml;gga till programstartaren eller panelprogrammet p&aring; panelen. </para>
<!--<para><emphasis>Question:</emphasis> Are applets still represented by .desktop files?</para>-->
          <para>Varje meny motsvarar en katalog. Du kan dra katalogen till en panel om du vill l&auml;gga till den p&aring; panelen i form av ett menyobjekt.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-9">
      <title>S&aring; h&auml;r &auml;ndrar du ett objekts egenskaper</title>
      <indexterm>
        <primary>panelobjekt</primary>
        <secondary>&auml;ndra egenskaper</secondary>
      </indexterm>
      <para>Vissa panelobjekt har egenskaper. Egenskaperna &auml;r olika f&ouml;r olika typer av objekt. Egenskaperna best&auml;mmer attribut av exempelvis f&ouml;ljande typer: <itemizedlist><listitem><para>Kommandot som startar en programstartare.</para></listitem><listitem><para>Var k&auml;llfilerna till en meny lagras.</para></listitem><listitem><para>Ikonen som representerar objektet.</para></listitem></itemizedlist></para>
      <para>S&aring; h&auml;r &auml;ndrar du ett objekts egenskaper: </para>
      <orderedlist>
        <listitem>
          <indexterm>
            <primary>panelobjektets popupmeny, illustration av</primary>
          </indexterm>
          <para>H&ouml;gerklicka p&aring; objektet s&aring; att panelobjektets popupmeny visas (se <xref linkend="gospanel-FIG-54"/>).</para>
          <figure id="gospanel-FIG-54">
            <title>Panelobjektets popupmeny</title>
            <screenshot>
              <mediaobject>
                <imageobject>
                  <imagedata fileref="figures/panel_object_popup_menu.png" format="PNG"/>
                </imageobject>
                <textobject>
                  <phrase>Popupmeny för panelobjekt. Menyalternativ en Egenskaper, Hjälp, Ta bort från panelen, Flytta.</phrase>
                </textobject>
              </mediaobject>
            </screenshot>
          </figure>
        </listitem>
        <listitem>
          <para>V&auml;lj <guimenuitem>Egenskaper</guimenuitem>. &Auml;ndra de &ouml;nskade egenskaperna i dialogf&ouml;nstret <guilabel>Egenskaper</guilabel>. Egenskaperna i dialogf&ouml;nstret <guilabel>Egenskaper</guilabel> beror p&aring; vilket objekt du valde i steg 1. </para>
        </listitem>
        <listitem>
          <para>Spara &auml;ndringarna genom att klicka p&aring; <guibutton>OK</guibutton> och st&auml;ng sedan dialogf&ouml;nstret <guilabel>Egenskaper</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
    <sect2 id="gospanel-32">
      <title>S&aring; h&auml;r flyttar du ett panelobjekt</title>
      <indexterm>
        <primary>panelobjekt</primary>
        <secondary>flytta</secondary>
      </indexterm>
      <para>Du kan flytta panelobjekten inom en panel och fr&aring;n en panel till en annan. Du kan &auml;ven flytta objekt mellan paneler och l&aring;dor.</para>
      <para>H&aring;ll ned den mellersta musknappen och dra panelobjektet till den nya positionen om du vill flytta det. N&auml;r du sl&auml;pper upp den mellersta musknappen stannar objektet kvar p&aring; den nya positionen.</para>
      <para>Du kan &auml;ven flytta ett panelobjekt med hj&auml;lp av dess popupmeny: </para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; objektet och v&auml;lj sedan <guimenuitem>Flytta</guimenuitem>. </para>
        </listitem>
        <listitem>
          <para>Peka p&aring; objektets nya position och klicka sedan med valfri musknapp. Objektet flyttas d&aring; till den nya positionen. Du kan flytta objektet till vilken panel som helst p&aring; skrivbordet. </para>
        </listitem>
      </orderedlist>
      <para>Placeringen av de &ouml;vriga objekten p&aring; en panel p&aring;verkas n&auml;r ett panelobjekt flyttas. Du kan ange en flyttningsmetod om du vill ha kontroll &ouml;ver hur objekten f&ouml;rflyttas p&aring; en panel. Tryck p&aring; en av de f&ouml;ljande tangenterna medan du flyttar panelobjektet om du vill p&aring;verka flyttningsmetoden:</para>
      <informaltable frame="topbot">
        <tgroup cols="3" colsep="0" rowsep="0">
          <colspec colname="colspec2" colwidth="15.00*"/>
          <colspec colname="colspec1" colwidth="30.00*"/>
          <colspec colname="colspec3" colwidth="54.00*"/>
          <thead>
            <row rowsep="1">
              <entry colname="colspec2" valign="top">
                <para>Tangent</para>
              </entry>
              <entry valign="top">
                <para>  Flyttningsmetod</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Beskrivning</para>
              </entry>
            </row>
          </thead>
          <tbody>
            <row>
              <entry colname="colspec2" valign="top">
                <para>Ingen tangent</para>
              </entry>
              <entry colname="colspec1" valign="top">
                <para>  Platsbyte</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Objektet byter plats med andra panelobjekt. Platsbyte &auml;r den normala flyttningsmetoden.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para><keycap>Alt</keycap>-tangenten </para>
              </entry>
              <entry valign="top">
                <para>  Fri f&ouml;rflyttning</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>Objektet flyttas f&ouml;rbi de &ouml;vriga panelobjekten till f&ouml;rsta lediga plats p&aring; panelen.</para>
              </entry>
            </row>
            <row>
              <entry colname="colspec2" valign="top">
                <para>
                  <keycap>Skifttangenten</keycap>
                </para>
              </entry>
              <entry valign="top">
                <para>  Ins&auml;ttning</para>
              </entry>
              <entry colname="colspec3" valign="top">
                <para>De &ouml;vriga panelobjekten flyttas l&auml;ngre bort. </para>
              </entry>
            </row>
          </tbody>
        </tgroup>
      </informaltable>
    </sect2>
    <sect2 id="gospanel-33">
      <title>S&aring; h&auml;r tar du bort ett panelobjekt</title>
      <indexterm>
        <primary>panelobjekt</primary>
        <secondary>ta bort</secondary>
      </indexterm>
      <para>H&ouml;gerklicka p&aring; panelobjektet s&aring; att dess popupmeny visas och v&auml;lj sedan <guimenuitem>Ta bort fr&aring;n panel</guimenuitem> om du vill ta bort ett objekt fr&aring;n en panel. </para>
    </sect2>
  </sect1>
  <sect1 id="gospanel-17">
    <title>Panelprogram</title>
    <indexterm>
      <primary>panelprogram</primary>
      <secondary>introduktion</secondary>
    </indexterm>
    <indexterm>
      <primary>panelobjekt</primary>
      <secondary>panelprogram</secondary>
      <see>panelprogram</see>
    </indexterm>
    <para>Ett panelprogram &auml;r ett litet program vars anv&auml;ndargr&auml;nssnitt visas inom ramen f&ouml;r panelen. Anv&auml;nd panelprogramobjektet f&ouml;r att komma &aring;t panelprogrammet. Figuren h&auml;r nedan, t ex, visar f&ouml;ljande panelprogram, fr&aring;n v&auml;nster till h&ouml;ger: </para>
    <itemizedlist>
      <listitem>
        <para><application>F&ouml;nsterlista</application>: Visar vilka f&ouml;nster som &auml;r &ouml;ppna.</para>
      </listitem>
      <listitem>
        <para><application>Cd-spelare</application>: Ger dig m&ouml;jlighet att styra datorns Cd-spelare.</para>
      </listitem>
      <listitem>
        <para><application>Volymkontroll</application>: Ger dig m&ouml;jlighet att st&auml;lla in h&ouml;gtalarvolymen.</para>
      </listitem>
    </itemizedlist>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/sample_applet.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Prov på panelprogram. Bilden beskrivs i den omgivande texten.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <sect2 id="gospanel-40">
      <title>S&aring; h&auml;r l&auml;gger du till ett panelprogram p&aring; en panel</title>
      <indexterm>
        <primary>panelprogram</primary>
        <secondary>l&auml;gga till p&aring; panel</secondary>
      </indexterm>
      <para>Du kan l&auml;gga till ett panelprogram p&aring; en panel fr&aring;n panelens popupmeny. H&ouml;gerklicka p&aring; en tom yta p&aring; en panel. Panelens popupmeny visas. V&auml;lj <guimenu>L&auml;gg till i panelen</guimenu> och sedan panelprogrammet som du vill l&auml;gga till fr&aring;n n&aring;gon av de f&ouml;ljande undermenyerna:</para>
      <itemizedlist>
        <listitem>
          <para>
            <guimenu>Tillbeh&ouml;r</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Underh&aring;llning</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Internet</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Multimedia</guimenu>
          </para>
        </listitem>
        <listitem>
          <para>
            <guimenu>Verktyg</guimenu>
          </para>
        </listitem>
      </itemizedlist>
      <para>Du kan &auml;ven dra panelprogrammet fr&aring;n undermenyn till panelen. </para>
    </sect2>
    <sect2 id="gospanel-39">
      <title>S&aring; h&auml;r v&auml;ljer du ett panelprogram</title>
      <indexterm>
        <primary>panelprogram</primary>
        <secondary>v&auml;lja</secondary>
      </indexterm>
      <para>Du m&aring;ste h&ouml;gerklicka p&aring; en panel och visa panelobjektets popupmeny innan du kan &auml;ndra panelprogrammets egenskaper. Klicka med den mellersta musknappen om du vill flytta ett panelprogram. </para>
      <para>Du kan klicka var som helst p&aring; ett panelprogram om du vill visa panelobjektets popupmeny eller flytta panelprogrammet, med vissa f&ouml;rbeh&aring;ll: </para>
      <itemizedlist>
        <listitem>
          <para>P&aring; vissa panelprograms popupmenyer finns det kommandon som enbart g&auml;ller panelprogrammet i fr&aring;ga och som visas n&auml;r du h&ouml;gerklickar p&aring; vissa delar av programmet. P&aring; h&ouml;ger sida av panelprogrammet <application>F&ouml;nsterlista</application>, t ex, finns det ett lodr&auml;tt handtag och knappar som representerar f&ouml;nster. Du m&aring;ste h&ouml;gerklicka p&aring; handtaget om du vill visa popupmenyn f&ouml;r panelprogrammet <application>F&ouml;nsterlista</application>. Om du h&ouml;gerklickar p&aring; en knapp till h&ouml;ger visas knappens popupmeny.</para>
        </listitem>
        <listitem>
          <para>P&aring; vissa panelprogram finns det omr&aring;den som inte g&aring;r att anv&auml;nda f&ouml;r att markera panelprogrammet. Panelprogrammet <application>Kommandorad</application>, t ex, har ett f&auml;lt d&auml;r du kan ange kommandon. Det g&aring;r inte att markera panelprogrammet genom att klicka med den mellersta eller h&ouml;gra musknappen p&aring; det h&auml;r f&auml;ltet. Klicka i st&auml;llet med den mellersta eller h&ouml;gra musknappen p&aring; n&aring;gon annan del av panelprogrammet. </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-41">
      <title>S&aring; h&auml;r &auml;ndrar du ett panelprograms inst&auml;llningar</title>
      <indexterm>
        <primary>panelprogram</primary>
        <secondary>&auml;ndra inst&auml;llningar</secondary>
      </indexterm>
      <para>S&aring; h&auml;r &auml;ndrar du inst&auml;llningar f&ouml;r ett panelprogram: </para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; panelprogrammet och v&auml;lj sedan <guimenuitem>Inst&auml;llningar</guimenuitem>. &Auml;ndra de &ouml;nskade inst&auml;llningarna i dialogf&ouml;nstret <guilabel>Inst&auml;llningar</guilabel>. Inst&auml;llningarna f&ouml;r panelprogrammen varierar.</para>
        </listitem>
        <listitem>
          <para>Klicka p&aring; <guibutton>St&auml;ng</guibutton> n&auml;r du vill st&auml;nga dialogutan <guilabel>Inst&auml;llningar</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-16">
    <title>Programstartare</title>
    <indexterm>
      <primary>panelobjekt</primary>
      <secondary>programstartare</secondary>
      <see>programstartare</see>
    </indexterm>
    <para>N&auml;r du klickar p&aring; en programstartare p&aring;b&ouml;rjas en av de f&ouml;ljande &aring;tg&auml;rderna: </para>
    <itemizedlist>
      <listitem>
        <para>Ett visst program startats.</para>
      </listitem>
      <listitem>
        <para>Ett kommando k&ouml;rs.</para>
      </listitem>
      <listitem>
        <para>En mapp i ett av filhanterarens f&ouml;nster &ouml;ppnas.</para>
      </listitem>
      <listitem>
        <para>Starta en webbl&auml;sare och g&aring; till en viss <firstterm>Internetadress</firstterm> (URL, Uniform Resource Locator). En URL &auml;r en adress till ett visst st&auml;lle p&aring; webben.</para>
      </listitem>
    </itemizedlist>
    <para>Programstartare finns p&aring; f&ouml;ljande platser p&aring; skrivbordet:</para>
    <itemizedlist>
      <listitem>
        <para>Paneler: P&aring; paneler representeras programstartare av ikoner.</para>
      </listitem>
      <listitem>
        <para>Menyer: P&aring; menyer representeras programstartare av menyalternativ. Det brukar finnas en ikon bredvid menyalternativen.</para>
      </listitem>
      <listitem>
        <para>Skrivbordsbakgrund: P&aring; skrivbordsbakgrunden representeras programstartare av ikoner.</para>
      </listitem>
    </itemizedlist>
    <para>Du kan &auml;ndra en programstartares egenskaper. Programstartarens namn, ikonen som representerar den och hur programstartaren k&ouml;rs &auml;r n&aring;gra av dess egenskaper. </para>
    <sect2 id="gospanel-34">
      <title>S&aring; h&auml;r l&auml;gger du till en programstartare p&aring; en panel</title>
      <indexterm>
        <primary>programstartare</primary>
        <secondary>l&auml;gga till p&aring; panel</secondary>
      </indexterm>
      <para>Du kan l&auml;gga till en panel p&aring; n&aring;got av f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>Fr&aring;n panelens popupmeny</para>
          <para>H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>Programstartare</guimenuitem></menuchoice> om du vill skapa en ny programstartare. Dialogf&ouml;nstret <guilabel>Skapa programstartare</guilabel> visas. Mer information om hur du fyller i f&auml;lten i dialogf&ouml;nstret finns i <xref linkend="gospanel-52"/>.</para>
          <para>Du kan &auml;ven v&auml;lja <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>Programstartare fr&aring;n meny</guimenuitem></menuchoice> p&aring; panelens popupmeny om du vill l&auml;gga till en befintlig programstartare p&aring; panelen. V&auml;lj programstartaren som du vill l&auml;gga till p&aring; menyn.</para>
        </listitem>
        <listitem>
          <para>Fr&aring;n en valfri meny</para>
          <para>Utf&ouml;r n&aring;gon av f&ouml;ljande &aring;tg&auml;rder om du vill l&auml;gga till en programstartare p&aring; en panel fr&aring;n n&aring;gon meny:<itemizedlist><listitem><para>&Ouml;ppna menyn d&auml;r programstartaren ing&aring;r p&aring; panelen d&auml;r du vill att programstartaren ska synas. H&ouml;gerklicka p&aring; programstartarens namn. V&auml;lj <guimenuitem>L&auml;gg till den h&auml;r programstartaren p&aring; panelen</guimenuitem>. </para></listitem><listitem><para>Visa en meny d&auml;r programstartaren ing&aring;r. Dra programstartaren till panelen. </para></listitem></itemizedlist></para>
        </listitem>
        <listitem>
          <para>Fr&aring;n filhanteraren</para>
          <para>Leta reda p&aring; <filename>.desktop</filename>-filen som h&ouml;r till programstartaren i filsystemet om du vill l&auml;gga till programstartaren p&aring; en panel fr&aring;n filhanteraren. Dra <filename>.desktop</filename>-filen till panelen om du vill l&auml;gga till programstartaren. </para>
        </listitem>
      </itemizedlist>
      <sect3 id="gospanel-52">
        <title>S&aring; h&auml;r skapar du en programstartare med dialogf&ouml;nstret Skapa programstartare</title>
        <para>S&aring; h&auml;r skapar du en programstartare med hj&auml;lp av dialogf&ouml;nstret <guilabel>Skapa programstartare</guilabel>: </para>
        <orderedlist>
          <listitem>
            <para>H&ouml;gerklicka p&aring; n&aring;gon del av panelen s&aring; att dess popupmeny visas. V&auml;lj <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>Programstartare</guimenuitem></menuchoice>. Dialogf&ouml;nstret <guilabel>Skapa programstartare</guilabel> visas. Flikavsnittet <guilabel>Grundl&auml;ggande</guilabel> i dialogf&ouml;nstret visas.</para>
          </listitem>
          <listitem>
            <para>Ange programstartarens egenskaper i dialogf&ouml;nstret. Tabellen h&auml;r nedan beskriver dialogf&ouml;nsterelementen i flikavsnittet <guilabel>Grundl&auml;ggande</guilabel>: </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colname="colspec0" colwidth="26.19*"/>
                <colspec colname="colspec1" colwidth="73.81*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>Dialogf&ouml;nsterelement</para>
                    </entry>
                    <entry valign="top">
                      <para>Beskrivning </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Namn</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Ange programstartarens namn i den h&auml;r textrutan. Du kan l&auml;gga till &ouml;vers&auml;ttningar av namnet p&aring; fliken <guilabel>Avancerat</guilabel>. Namnet &auml;r vad som visas d&aring; programstartaren l&auml;ggs till p&aring; en meny eller p&aring; skrivbordet. </para>
                    </entry>
                  </row>
                  <row>
                    <entry colname="colspec0">
                      <para>
                        <guilabel>Allm&auml;nt namn</guilabel>
                      </para>
                    </entry>
                    <entry colname="colspec1">
                      <para>Ange programklassen som programstartaren tillh&ouml;r i den h&auml;r textrutan. Du skulle t ex kunna skriva <userinput>Texthanteraren</userinput> i textrutan om programstartaren g&auml;ller <application>gedit</application>. Du kan l&auml;gga till &ouml;vers&auml;ttningar av det allm&auml;nna namnet p&aring; fliken <guilabel>Avancerat</guilabel>. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Kommentar</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Skriv en kort kommentar om programstartaren i den h&auml;r textrutan. Kommentaren visas i form av en verktygsbeskrivning n&auml;r pekaren befinner sig &ouml;ver programstartarens ikon p&aring; panelen. Du kan l&auml;gga till &ouml;vers&auml;ttningar av kommentaren p&aring; fliken <guilabel>Avancerat</guilabel>. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Kommando</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Ange ett kommando som ska k&ouml;ras d&aring; du klickar p&aring; programstartaren. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Typ</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Ange programstartarens typ i den h&auml;r nedrullningsbara kombinationsrutan. V&auml;lj mellan f&ouml;ljande alternativ: </para>
                      <itemizedlist>
                        <listitem>
                          <para><guilabel>Program</guilabel>: V&auml;lj det h&auml;r alternativet om du vill skapa en programstartare som k&ouml;r ett program.</para>
                        </listitem>
                        <listitem>
                          <para><guilabel>L&auml;nk</guilabel>: V&auml;lj det h&auml;r alternativet om du vill skapa en programstartare som utg&ouml;r en l&auml;nk till en fil, mapp eller FTP-plats.</para>
                        </listitem>
                      </itemizedlist>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Ikon</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>V&auml;lj en ikon som ska representera programstartaren. Klicka p&aring; knappen <guibutton>Ingen ikon</guibutton> om du vill v&auml;lja en ikon. Ett dialogf&ouml;nster d&auml;r du kan v&auml;lja en ikon visas. V&auml;lj en ikon i dialogf&ouml;nstret. Klicka p&aring; <guibutton>Bl&auml;ddra</guibutton> om du vill v&auml;lja en ikon fr&aring;n en annan katalog. Klicka p&aring; <guibutton>OK</guibutton> n&auml;r du har valt en ikon. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>K&ouml;r i terminal</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>V&auml;lj det h&auml;r alternativet om du vill k&ouml;ra programmet eller kommandot i ett terminalf&ouml;nster. V&auml;lj det h&auml;r alternativet i fr&aring;ga om program eller kommandon som inte skapar ett f&ouml;nster n&auml;r de k&ouml;rs.</para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
          </listitem>
          <listitem>
            <para>Klicka p&aring; fliken <guilabel>Avancerat</guilabel> om du vill st&auml;lla in programstartarens avancerade egenskaper. Dialogf&ouml;nstret <guilabel>Egenskaper f&ouml;r programstartaren</guilabel> visas med flikavsnittet <guilabel>Avancerat</guilabel> aktiverat.</para>
          </listitem>
          <listitem>
            <para>Ange programstartarens avancerade egenskaper i dialogf&ouml;nstret. Tabellen h&auml;r nedan beskriver dialogf&ouml;nsterelementen i den &ouml;vre delen av flikavsnittet <guilabel>Avancerat</guilabel>: </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colwidth="32.03*"/>
                <colspec colwidth="67.97*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>Dialogf&ouml;nsterelement</para>
                    </entry>
                    <entry valign="top">
                      <para>Beskrivning </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>F&ouml;rs&ouml;k med detta innan du anv&auml;nder</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Ange ett kommando som kontrolleras innan programstartaren k&ouml;rs ig&aring;ng. Om kommandot &auml;r k&ouml;rbart och finns n&aring;gonstans i s&ouml;kv&auml;gen visas programstartaren p&aring; panelen.</para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>
                        <guilabel>Dokumentation</guilabel>
                      </para>
                    </entry>
                    <entry valign="top">
                      <para>Ange s&ouml;kv&auml;gen til programstartarens hj&auml;lpfil. Om du anger en s&ouml;kv&auml;g i det h&auml;r f&auml;ltet visas menyobjektet <guimenuitem>Hj&auml;lp om <replaceable>programstartarnamn </replaceable>-program</guimenuitem> p&aring; programstartarens popupmeny.</para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
          </listitem>
          <listitem>
            <para>Du kan &auml;ven l&auml;gga till &ouml;vers&auml;ttningar av f&auml;lten <guilabel>Namn</guilabel>, <guilabel>Allm&auml;nt namn</guilabel> och <guilabel>Kommentar</guilabel> fr&aring;n flikavsnittet <guilabel>Grundl&auml;ggande</guilabel>. Ange &ouml;vers&auml;ttningen i tabellen <guilabel>Namn/Kommentar f&ouml;r &ouml;vers&auml;ttningar</guilabel> p&aring; f&ouml;ljande s&auml;tt: </para>
            <informaltable frame="topbot">
              <tgroup cols="2" colsep="0" rowsep="0">
                <colspec colname="colspec0" colwidth="20.78*"/>
                <colspec colname="colspec1" colwidth="79.22*"/>
                <thead>
                  <row rowsep="1">
                    <entry valign="top">
                      <para>F&auml;lt</para>
                    </entry>
                    <entry valign="top">
                      <para> Beskrivning </para>
                    </entry>
                  </row>
                </thead>
                <tbody>
                  <row>
                    <entry valign="top">
                      <para>F&ouml;rsta f&auml;ltet</para>
                    </entry>
                    <entry valign="top">
                      <para> Ange den tv&aring; tecken l&aring;nga koden f&ouml;r spr&aring;ket som du vill &ouml;vers&auml;tta till. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>Andra f&auml;ltet</para>
                    </entry>
                    <entry valign="top">
                      <para> Ange &ouml;vers&auml;ttningen av programstartarens <guilabel>Namn</guilabel>.</para>
                    </entry>
                  </row>
                  <row>
                    <entry colname="colspec0">
                      <para>Tredje f&auml;ltet</para>
                    </entry>
                    <entry colname="colspec1">
                      <para> Ange &ouml;vers&auml;ttningen av programstartarens <guilabel>Allm&auml;nt namn</guilabel>. </para>
                    </entry>
                  </row>
                  <row>
                    <entry valign="top">
                      <para>Fj&auml;rde f&auml;ltet</para>
                    </entry>
                    <entry valign="top">
                      <para> Ange &ouml;vers&auml;ttningen av programstartarens <guilabel>Kommentar</guilabel>. </para>
                    </entry>
                  </row>
                </tbody>
              </tgroup>
            </informaltable>
            <para>Klicka d&auml;refter p&aring; knappen <guibutton>L&auml;gg till/St&auml;ll in</guibutton>. </para>
            <para>Markera &ouml;vers&auml;ttningen om du vill redigera den. Den &ouml;versatta texten visas i den nedre delen av dialogf&ouml;nstret. Redigera f&auml;lten och klicka sedan p&aring; knappen <guibutton>L&auml;gg till/St&auml;ll in</guibutton>.</para>
            <para>Markera &ouml;vers&auml;ttningen och klicka sedan p&aring; <guibutton>Ta bort</guibutton> om du vill ta bort &ouml;vers&auml;ttningen.</para>
          </listitem>
          <listitem>
            <para>Klicka p&aring; <guibutton>OK</guibutton>. Dialogf&ouml;nstret <guilabel>Egenskaper f&ouml;r programstartaren</guilabel> st&auml;ngs och programstartaren skapas.</para>
          </listitem>
        </orderedlist>
      </sect3>
    </sect2>
    <sect2 id="gospanel-36">
      <title>S&aring; h&auml;r &auml;ndrar du en programstartares egenskaper</title>
      <indexterm>
        <primary>programstartare</primary>
        <secondary>&auml;ndra egenskaper</secondary>
      </indexterm>
      <para>S&aring; h&auml;r &auml;ndrar du en programstartares egenskaper: </para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; programstartaren s&aring; att panelobjektets popupmeny visas.</para>
        </listitem>
        <listitem>
          <para>V&auml;lj <guimenuitem>Egenskaper</guimenuitem>. &Auml;ndra de aktuella egenskaperna i dialogf&ouml;nstret <guilabel>Egenskaper f&ouml;r programstartaren</guilabel>. Mer information om dialogf&ouml;nstret <guilabel>Egenskaper f&ouml;r programstartaren</guilabel> finns i <xref linkend="gospanel-52"/>. </para>
        </listitem>
        <listitem>
          <para>St&auml;ng dialogf&ouml;nstret <guilabel>Egenskaper f&ouml;r programstartaren</guilabel> genom att klicka p&aring; <guibutton>St&auml;ng</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-37">
    <title>Menyer</title>
    <indexterm>
      <primary>menyer</primary>
      <secondary>l&auml;gga till p&aring; panel</secondary>
    </indexterm>
    <indexterm>
      <primary>panelobjekt</primary>
      <secondary>menyer</secondary>
    </indexterm>
    <para>Du kan l&auml;gga till f&ouml;ljande menytyper p&aring; panelerna: </para>
    <itemizedlist>
      <listitem>
        <para>Systemmenyer: Systemmenyer inneh&aring;ller skrivbordets standardprogram och standardverktyg. Menyerna <guimenu>Program</guimenu> och <guimenu>&Aring;tg&auml;rder</guimenu> &auml;r systemmenyer. H&ouml;gerklicka p&aring; en programstartare p&aring; menyn och v&auml;lj sedan <menuchoice><guimenu>Hela menyn</guimenu><guimenuitem>L&auml;gg till detta som en meny p&aring; panelen</guimenuitem></menuchoice> om du vill l&auml;gga till en systemmeny p&aring; en panel. </para>
      </listitem>
      <listitem>
        <para><guimenu>GNOME-menyn</guimenu>: Du kan komma &aring;t praktiskt taget alla program, kommandon och konfigurationsalternativ f&ouml;r skrivbordet fr&aring;n <guimenu>GNOME-menyn</guimenu>. H&ouml;gerklicka p&aring; en tom yta p&aring; en panel och v&auml;lj sedan <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>GNOME-meny</guimenuitem></menuchoice> om du vill l&auml;gga till <guimenu>GNOME-menyn</guimenu> p&aring; en panel. Du kan l&auml;gga till precis s&aring; m&aring;nga <guimenu>GNOME-menyobjekt</guimenu> p&aring; panelerna som du vill. <guimenu>GNOME-menyn</guimenu> representeras normalt av en ikon som ser ut som ett stiliserat fotavtryck p&aring; panelerna:</para>
        <screenshot>
          <mediaobject>
            <imageobject>
              <imagedata fileref="figures/footprint_icon.png" format="PNG"/>
            </imageobject>
            <textobject>
              <phrase>GNOME-menyns ikon.</phrase>
            </textobject>
          </mediaobject>
        </screenshot>
      </listitem>
    </itemizedlist>
    <para>Menyer som du l&auml;gger till p&aring; panelerna representeras av en ikon med en pil. Pilen visar att ikonen representerar en meny eller l&aring;da. <xref linkend="gospanel-FIG-68"/> visar hur menyerna brukar se ut p&aring; en panel. </para>
    <figure id="gospanel-FIG-68">
      <title>Typiska menyobjekt p&aring; en panel</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/typical_menu.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Typiska menyobjekt på en panel.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
    </figure>
  </sect1>
  <sect1 id="gospanel-18">
    <title>L&aring;dor</title>
    <indexterm>
      <primary>panelobjekt</primary>
      <secondary>l&aring;dor</secondary>
      <see>l&aring;dor</see>
    </indexterm>
    <para>En l&aring;da &auml;r en ut&ouml;kad version av en panel. Du kan &ouml;ppna och st&auml;nga en l&aring;da p&aring; samma s&auml;tt som du kan visa och d&ouml;lja en panel. En l&aring;da kan inneh&aring;lla alla slags panelobjekt, d&auml;ribland programstartare, menyer, panelprogram, andra panelobjekt och andra l&aring;dor. N&auml;r du &ouml;ppnar en l&aring;da kan du anv&auml;nda objekten i den p&aring; samma s&auml;tt som du anv&auml;nder objekten p&aring; en panel. </para>
    <para>Figuren h&auml;r nedan visar en &ouml;ppen l&aring;da som inneh&aring;ller tv&aring; panelobjekt. </para>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/open_drawer.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Öppen låda. Bilden beskrivs av den omgivande texten.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Pilen p&aring; l&aring;dans ikon visar att ikonen representerar en l&aring;da eller en meny.</para>
    <para>Du kan l&auml;gga till, flytta och ta bort objekt fr&aring;n l&aring;dor p&aring; samma s&auml;tt som du kan l&auml;gga till, flytta och ta bort objekt fr&aring;n paneler. </para>
    <sect2 id="gospanel-42">
      <title>S&aring; h&auml;r &ouml;ppnar och st&auml;nger du en l&aring;da</title>
      <indexterm>
        <primary>l&aring;dor</primary>
        <secondary>&ouml;ppna</secondary>
      </indexterm>
      <indexterm>
        <primary>l&aring;dor</primary>
        <secondary>st&auml;nga</secondary>
      </indexterm>
      <para>Klicka p&aring; l&aring;dobjektet p&aring; en panel om du vill &ouml;ppna l&aring;dan. Du kan st&auml;nga en l&aring;da p&aring; f&ouml;ljande s&auml;tt: </para>
      <itemizedlist>
        <listitem>
          <para>Klicka p&aring; l&aring;dan.</para>
        </listitem>
        <listitem>
          <para>Klicka p&aring; l&aring;dans d&ouml;ljknapp.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-420">
      <title>S&aring; h&auml;r l&auml;gger du till en l&aring;da p&aring; en panel</title>
      <indexterm>
        <primary>l&aring;dor</primary>
        <secondary>l&auml;gga till p&aring; panel</secondary>
      </indexterm>
      <para>Du kan l&auml;gga till en l&aring;da p&aring; en panel p&aring; f&ouml;ljande s&auml;tt: </para>
      <itemizedlist>
        <listitem>
          <para>Fr&aring;n panelens popupmeny</para>
          <para>H&ouml;gerklicka p&aring; en tom yta p&aring; panelen och v&auml;lj sedan 
<menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem>L&aring;da</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>Fr&aring;n en valfri meny</para>
          <para>Du kan l&auml;gga till en meny i form av ett l&aring;dobjekt p&aring; en panel.</para>
          <para>&Ouml;ppna menyn fr&aring;n panelen om du vill l&auml;gga till den i form av en l&aring;da. H&ouml;gerklicka p&aring; n&aring;gon programstartare p&aring; menyn och v&auml;lj sedan <menuchoice><guimenu>Hela menyn</guimenu><guimenuitem>L&auml;gg till detta som en l&aring;da p&aring; panelen</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="gospanel-54">
      <title>S&aring; h&auml;r l&auml;gger du till ett objekt i en l&aring;da</title>
      <indexterm>
        <primary>l&aring;dor</primary>
        <secondary>l&auml;gga till objekt i</secondary>
      </indexterm>
      <para>Objekt l&auml;ggs till i l&aring;dor p&aring; samma s&auml;tt som objekt l&auml;ggs till p&aring; paneler. Mer information finns i <xref linkend="gospanel-15"/>. </para>
    </sect2>
    <sect2 id="gospanel-550">
      <title>S&aring; h&auml;r &auml;ndrar du en l&aring;das egenskaper</title>
      <indexterm>
        <primary>l&aring;dor</primary>
        <secondary>&auml;ndra egenskaper</secondary>
      </indexterm>
      <para>V&auml;lj <menuchoice><guimenu>Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Avancerat</guisubmenu><guimenuitem>Panel</guimenuitem></menuchoice> och &auml;ndra sedan det du vill &auml;ndra om du vill ge samtliga paneler och l&aring;dor nya inst&auml;llningar. Du kan t ex v&auml;lja diverse inst&auml;llningar som har med panel- och l&aring;dobjektens utseende och upptr&auml;dande att g&ouml;ra. Du kan &auml;ven v&auml;lja alternativ som enbart har med l&aring;dor att g&ouml;ra. Du kan t ex v&auml;lja att l&aring;dorna ska st&auml;ngas n&auml;r du klickar p&aring; en programstartare i dem.</para>
      <para>Du kan &auml;ven &auml;ndra andra egenskaper f&ouml;r enskilda l&aring;dor. Du kan &auml;ndra egenskaper f&ouml;r individuella l&aring;dor, t ex deras utseende och om de ska ha d&ouml;ljknappar eller inte.</para>
      <para>S&aring; h&auml;r &auml;ndrar du en l&aring;das egenskaper: </para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; l&aring;dan och v&auml;lj sedan <guimenuitem>Egenskaper</guimenuitem> s&aring; att dialogf&ouml;nstret <guilabel>Panelegenskaper</guilabel> visas. Dialogf&ouml;nstret visas med flikavsnittet <guilabel>L&aring;da</guilabel> aktiverat.</para>
        </listitem>
        <listitem>
          <para>V&auml;lj l&aring;dans egenskaper i dialogf&ouml;nstret. Tabellen som f&ouml;ljer beskriver elementen i flikavsnittet <guilabel>L&aring;da</guilabel>: </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec2" colwidth="29.44*"/>
              <colspec colname="colspec3" colwidth="70.56*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Dialogf&ouml;nsterelement</para>
                  </entry>
                  <entry valign="top">
                    <para>Beskrivning </para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Storlek</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Ange l&aring;dans storlek. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Verktygbeskrivning/Namn</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Ange l&aring;dans namn i den h&auml;r textrutan. Namnet visas som en verktygsbeskrivning n&auml;r pekaren placeras ovanf&ouml;r panelen.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Ikon</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>V&auml;lj en ikon som ska representera l&aring;dan. Klicka p&aring; knappen <guibutton>Ikon</guibutton>. Dialogf&ouml;nstret f&ouml;r ikonval visas. V&auml;lj en ikon i dialogf&ouml;nstret. Du kan &auml;ven klicka p&aring; <guibutton>Bl&auml;ddra</guibutton> och v&auml;lja en ikon i en annan katalog. Klicka p&aring; <guibutton>OK</guibutton> n&auml;r du har valt en ikon. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Visa d&ouml;ljknapp</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Markera det h&auml;r alternativet om du vill att en d&ouml;ljknapp ska visas d&aring; l&aring;dan &ouml;ppnas. </para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Visa pil p&aring; d&ouml;ljknappen</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Markera det h&auml;r alternativet om du vill att det ska finnas en pil p&aring; en eventuell d&ouml;ljknapp.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Du kan st&auml;lla in l&aring;dans bakgrund p&aring; flikavsnittet <guilabel>Bakgrund</guilabel>. Mer information om hur du fyller i f&auml;lten i flikavsnittet <guilabel>Bakgrund</guilabel> finns i <xref linkend="gospanel-28"/>. Du kan &auml;ven dra en f&auml;rg eller bild och sl&auml;ppa den p&aring; en l&aring;da om du vill ange att f&auml;rgen eller bilden ska anv&auml;ndas som l&aring;dans bakgrund. Mer information finns i <xref linkend="gospanel-61"/>.</para>
        </listitem>
        <listitem>
          <para>St&auml;ng dialogf&ouml;nstret <guilabel>Panelegenskaper</guilabel> genom att klicka p&aring; <guibutton>St&auml;ng</guibutton>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gospanel-20">
    <title>Knappen Logga ut</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/logout_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Ikonen Logga ut.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>panelobjekt</primary>
      <secondary>Logga ut, knapp</secondary>
    </indexterm>
    <indexterm>
      <primary>Logga ut, knapp</primary>
    </indexterm>
    <para> Knappen <guibutton>Logga ut</guibutton> g&ouml;r att du loggas ut fr&aring;n en GNOME-session. </para>
    <para>Du l&auml;gger till en <guibutton>Logga ut</guibutton>-knapp p&aring; en panel genom att h&ouml;gerklicka i ett tomt utrymme p&aring; panelen. V&auml;lj <menuchoice><guimenu> L&auml;gg till i panelen</guimenu><guimenuitem>Logga ut-knappen</guimenuitem></menuchoice>. Klicka p&aring; <guibutton>Logga ut</guibutton> om du vill logga ut fr&aring;n sessionen eller st&auml;nga av datorn. </para>
  </sect1>
  <sect1 id="gospanel-21">
    <title>Knappen L&aring;s</title>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/lockscreen_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Bilden visar en låsikon som representerar funktionen Lås skärm.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <indexterm>
      <primary>panelobjekt</primary>
      <secondary>L&aring;s, knapp</secondary>
    </indexterm>
    <indexterm>
      <primary>L&aring;s, knapp</primary>
    </indexterm>
    <indexterm>
      <primary>l&aring;sa sk&auml;rmen</primary>
    </indexterm>
    <para>Om du klickar p&aring; knappen <guibutton>L&aring;s</guibutton> l&aring;ses sk&auml;rmen och sk&auml;rmsl&auml;ckaren g&aring;r ig&aring;ng. Du m&aring;ste ange ditt l&ouml;senord om du vill &aring;teruppta sessionen. Det m&aring;ste finnas en aktiv sk&auml;rmsl&auml;ckare om du ska kunna l&aring;sa sk&auml;rmen.</para>
    <para>Du l&auml;gger till en <guibutton>L&aring;s</guibutton>-knapp p&aring; en panel genom att h&ouml;gerklicka i ett tomt utrymme p&aring; panelen. V&auml;lj <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem> L&aring;s-knappen</guimenuitem></menuchoice>. </para>
    <para>H&ouml;gerklicka p&aring; <guibutton>L&aring;s</guibutton>. D&aring; visas en meny med kommandon som har med sk&auml;rmsl&auml;ckaren att g&ouml;ra. <xref linkend="gosstartsession-TBL-83"/> beskriver kommandona som finns tillg&auml;ngliga p&aring; menyn.</para>
    <table frame="topbot" id="gosstartsession-TBL-83">
      <title>Menyalternativ p&aring; menyn L&aring;s sk&auml;rmen</title>
      <tgroup cols="2" colsep="0" rowsep="0">
        <colspec colname="colspec0" colwidth="43.55*"/>
        <colspec colname="colspec1" colwidth="56.45*"/>
        <thead>
          <row rowsep="1">
            <entry valign="top">
              <para>Alternativ</para>
            </entry>
            <entry valign="top">
              <para> Funktion</para>
            </entry>
          </row>
        </thead>
        <tbody>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Aktivera sk&auml;rmsl&auml;ckare</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Sk&auml;rmsl&auml;ckaren aktiveras omedelbart, men sk&auml;rmen l&aring;ses inte.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>L&aring;s sk&auml;rm</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Sk&auml;rmen l&aring;ses omedelbart. Det h&auml;r kommandot ger samma effekt som om du hade klickat p&aring; knappen <guibutton>L&aring;s</guibutton>. </para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Avsluta sk&auml;rmsl&auml;ckardemon</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Sk&auml;rmsl&auml;ckarprocessen avslutas. Du kan inte l&aring;sa sk&auml;rmen efter att du har avslutat sk&auml;rmsl&auml;ckarprocessen.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Starta om sk&auml;rmsl&auml;ckardemon</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Sk&auml;rmsl&auml;ckarprocessen avslutas och startas om. Anv&auml;nd det h&auml;r kommandot n&auml;r du har bytt l&ouml;senord. Ange det nya l&ouml;senordet d&aring; du anv&auml;nder sk&auml;rmsl&auml;ckaren efter att ha startat om sk&auml;rmsl&auml;ckarprocessen.</para>
            </entry>
          </row>
          <row>
            <entry valign="top">
              <para>
                <guimenuitem>Egenskaper</guimenuitem>
              </para>
            </entry>
            <entry valign="top">
              <para>Visar dialogf&ouml;nstret <guilabel>XScreenSaver</guilabel> d&auml;r du kan konfigurera sk&auml;rmsl&auml;ckaren. </para>
            </entry>
          </row>
        </tbody>
      </tgroup>
    </table>
  </sect1>
</chapter>
