<?xml version="1.0" encoding="utf-8"?>
<chapter id="gosgetstarted-1">
  <title>Skrivbordssessioner </title>
  <highlights>
    <para>Detta kapitel inneh&aring;ller information om hur du startar, hanterar och avslutar en skrivbordssession.</para>
  </highlights>
  <sect1 id="gosgetstarted-69">
    <title>Starta en skrivbordssession</title>
    <indexterm>
      <primary>session</primary>
      <secondary>starta</secondary>
    </indexterm>
    <para>En skrivbordssession intr&auml;ffar mellan tiden som du loggar in p&aring; skrivbordet och loggar ut. Inloggningsf&ouml;nstret, som visas av <application>Inloggningshanteraren</application>, &auml;r ink&ouml;rsporten till skrivbordet. Inloggningsf&ouml;nstret inneh&aring;ller f&auml;lt som du kan skriva in anv&auml;ndarnamn och l&ouml;senord i. P&aring; <guimenu> Alternativ</guimenu>-menyn i inloggningsf&ouml;nstret visas inloggningsalternativen. Du kan t ex v&auml;lja spr&aring;k f&ouml;r sessionen. </para>
    <para>Du startar en session n&auml;r du loggar in. Sessionshanteraren startar efter att <application>Inloggningshanteraren</application> har verifierat anv&auml;ndarnamn och l&ouml;senord. Med sessionshanteraren kan du hantera en session. Du kan t ex spara status f&ouml;r den senaste sessionen och &aring;terg&aring; till den sessionen n&auml;sta g&aring;ng du loggar in. Sessionshanteraren sparar och &aring;terst&auml;ller f&ouml;ljande: </para>
    <itemizedlist>
      <listitem>
        <para>Inst&auml;llningar f&ouml;r utseende och funktion, till exempel inst&auml;llningar f&ouml;r teckensnitt, f&auml;rger och mus. </para>
      </listitem>
      <listitem>
        <para>De program som var &ouml;ppna, till exempel filhanterar- och textredigeringsf&ouml;nster. Du kan inte spara och &aring;terst&auml;lla program som sessionshanteraren inte hanterar. Om du till exempel startar <application>vi</application>-redigeraren fr&aring;n kommandoraden i ett terminalf&ouml;nster, kan sessionshanteraren inte &aring;terst&auml;lla redigeringssessionen. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosgetstarted-65">
      <title>Logga in till en skrivbordssession</title>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>logga in</secondary>
      </indexterm>
      <indexterm>
        <primary>logga in</primary>
      </indexterm>
      <para>Utf&ouml;r f&ouml;ljande &aring;tg&auml;rder f&ouml;r att logga in till en session.</para>
      <orderedlist>
        <listitem>
          <para>V&auml;lj <menuchoice><guimenu>Alternativ</guimenu><guimenuitem> Session</guimenuitem></menuchoice>. V&auml;lj GNOME-skrivbordet fr&aring;n listan &ouml;ver tillg&auml;ngliga skrivbordsmilj&ouml;er.</para>
        </listitem>
        <listitem>
          <para>Skriv in inloggningsnamn i f&auml;ltet i dialogf&ouml;nstret <guilabel>Inloggningshanteraren</guilabel> och klicka p&aring; <guibutton>OK</guibutton>. </para>
        </listitem>
        <listitem>
          <para>Skriv in l&ouml;senordet i f&auml;ltet i dialogf&ouml;nstret <guilabel>Inloggningshanteraren</guilabel> och klicka p&aring; <guibutton>OK</guibutton>. </para>
        </listitem>
      </orderedlist>
      <para>Sessionshanteraren startar en session n&auml;r du loggar in. Sessionshanteraren startar en ny session n&auml;r du loggar in f&ouml;r f&ouml;rsta g&aring;ngen. Sessionshanteraren &aring;terst&auml;ller till din tidigare session om du har loggat in tidigare.</para>
    </sect2>
    <sect2 id="gosgetstarted-66">
      <title>Anv&auml;nda sessioner p&aring; annat spr&aring;k</title>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>annat spr&aring;k, starta i</secondary>
      </indexterm>
      <indexterm>
        <primary>spr&aring;k, starta session p&aring; annat</primary>
      </indexterm>
      <para>Utf&ouml;r f&ouml;ljande &aring;tg&auml;rder f&ouml;r att starta en session p&aring; ett annat spr&aring;k.</para>
      <orderedlist>
        <listitem>
          <para>V&auml;lj <menuchoice><guimenu>Alternativ</guimenu><guimenuitem>Session</guimenuitem></menuchoice> i inloggningsdialogf&ouml;nstret. V&auml;lj GNOME-skrivbordet fr&aring;n listan &ouml;ver tillg&auml;ngliga skrivbordsmilj&ouml;er.</para>
        </listitem>
        <listitem>
          <para>V&auml;lj <menuchoice><guimenu>Alternativ</guimenu><guimenuitem>Spr&aring;k</guimenuitem></menuchoice> i inloggningsdialogf&ouml;nstret. </para>
        </listitem>
        <listitem>
          <para>Markera den spr&aring;kgrupp som innefattar spr&aring;ket du vill anv&auml;nda.</para>
        </listitem>
        <listitem>
          <para>Markera ett spr&aring;k.</para>
        </listitem>
        <listitem>
          <para>Logga in.</para>
        </listitem>
      </orderedlist>
      <para>Systemadministrat&ouml;ren anger standardspr&aring;k f&ouml;r systemet. Via <guimenu>Alternativ</guimenu>-menyn i dialogf&ouml;nstret <guilabel>Inloggningshanteraren</guilabel> kan du komma &aring;t andra spr&aring;k. N&auml;r du valt ett spr&aring;k i <guimenu>Alternativ</guimenu>-menyn anges LANG-variabeln f&ouml;r sessionen. Standardspr&aring;ket &aring;terst&auml;lls vid sessionens slut. </para>
    </sect2>
  </sect1>
  <sect1 id="gosstartsession-1">
    <title>L&aring;sa sk&auml;rmen</title>
    <para>Detta avsnitt inneh&aring;ller information om hur du l&aring;ser sk&auml;rmen och konfigurerar sk&auml;rmsl&auml;ckaren.</para>
    <sect2 id="gosstartsession-4">
      <title>S&aring; h&auml;r l&aring;ser du sk&auml;rmen</title>
      <screenshot>
        <mediaobject>
          <imageobject>
            <imagedata fileref="figures/lockscreen_icon.png" format="PNG"/>
          </imageobject>
          <textobject>
            <phrase>Bilden visar en låsikon som representerar funktionen Lås skärm.</phrase>
          </textobject>
        </mediaobject>
      </screenshot>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>l&aring;sa sk&auml;rmen</secondary>
      </indexterm>
      <indexterm>
        <primary>l&aring;sa sk&auml;rmen</primary>
      </indexterm>
      <indexterm>
        <primary>l&aring;sknapp</primary>
      </indexterm>
      <para>Utf&ouml;r en av f&ouml;ljande &aring;tg&auml;rder f&ouml;r att l&aring;sa sk&auml;rmen:</para>
      <itemizedlist>
        <listitem>
          <para>V&auml;lj <menuchoice><guimenu>&Aring;tg&auml;rder</guimenu><guimenuitem> L&aring;s sk&auml;rm</guimenuitem></menuchoice>.</para>
        </listitem>
        <listitem>
          <para>Om <guibutton>L&aring;s</guibutton>-knappen finns p&aring; en panel, klicka p&aring; <guibutton>L&aring;s</guibutton>-knappen. </para>
          <para>H&ouml;gerklicka p&aring; en panel om du vill l&auml;gga till <guibutton>L&aring;s</guibutton>-knappen p&aring; panelen. V&auml;lj <menuchoice><guimenu>L&auml;gg till i panelen</guimenu><guimenuitem> L&aring;s-knappen</guimenuitem></menuchoice>.</para>
        </listitem>
      </itemizedlist>
      <para>N&auml;r du l&aring;ser sk&auml;rmen startas sk&auml;rmsl&auml;ckaren. Flytta musen f&ouml;r att visa dialogf&ouml;nstret f&ouml;r l&aring;st sk&auml;rm om du vill l&aring;sa upp sk&auml;rmen. Skriv anv&auml;ndarnamn och l&ouml;senord i dialogf&ouml;nstret f&ouml;r l&aring;st sk&auml;rm och tryck p&aring; <keycap>Retur</keycap>. </para>
      <note>
        <para>Du m&aring;ste ha sk&auml;rmsl&auml;ckaren aktiverad f&ouml;r att kunna l&aring;sa sk&auml;rmen. </para>
      </note>
    </sect2>
    <sect2 id="gosstartsession-3">
      <title>Konfigurera din sk&auml;rmsl&auml;ckare</title>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>konfigurera sk&auml;rmsl&auml;ckare</secondary>
      </indexterm>
      <indexterm>
        <primary>sk&auml;rmsl&auml;ckare, konfigurera</primary>
      </indexterm>
      <indexterm>
        <primary>XScreenSaver</primary>
        <see>sk&auml;rmsl&auml;ckare</see>
      </indexterm>
      <para>En sk&auml;rmsl&auml;ckare &auml;r ett program som du kan anv&auml;nda f&ouml;r att ers&auml;tta bilden p&aring; sk&auml;rmen n&auml;r sk&auml;rmen inte anv&auml;nds. Du kan anv&auml;nda sk&auml;rmsl&auml;ckaren p&aring; f&ouml;ljande s&auml;tt:</para>
      <itemizedlist>
        <listitem>
          <para>Aktivera efter en angiven inaktiv tid.</para>
        </listitem>
        <listitem>
          <para>Aktivera n&auml;r du l&aring;ser sk&auml;rmen.</para>
        </listitem>
        <listitem>
          <para>Energisparfunktionen f&ouml;r bildsk&auml;rmen n&auml;r datorn inte anv&auml;nds. </para>
        </listitem>
      </itemizedlist>
      <para>Utf&ouml;r f&ouml;ljande steg f&ouml;r att konfigurera sk&auml;rmsl&auml;ckaren: </para>
      <orderedlist>
        <listitem>
          <para>H&ouml;gerklicka p&aring; <guibutton>L&aring;s</guibutton>-knappen och v&auml;lj sedan <guimenuitem>Egenskaper</guimenuitem> fr&aring;n popupmenyn. Dialogf&ouml;nstret <guilabel> XScreenSaver</guilabel> visas. </para>
          <para>Om <guibutton>L&aring;s</guibutton>-knappen inte finns p&aring; en panel, kan du l&auml;gga till knappen p&aring; panelen. H&ouml;gerklicka p&aring; en panel om du vill l&auml;gga till <guibutton>L&aring;s</guibutton>-knappen p&aring; panelen. V&auml;lj <menuchoice><guimenu> L&auml;gg till i panelen</guimenu><guimenuitem>L&aring;s-knappen</guimenuitem></menuchoice>. </para>
        </listitem>
        <listitem>
          <para>Anv&auml;nd elementen p&aring; fliken <guilabel>Visningsl&auml;gen</guilabel> f&ouml;r att konfigurera sk&auml;rmsl&auml;ckaren. I f&ouml;ljande tabell beskrivs dialogf&ouml;nsterelementen p&aring; fliksektionen <guilabel>Visningsl&auml;gen</guilabel>: </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec2" colwidth="40.38*"/>
              <colspec colname="colspec3" colwidth="59.62*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Inst&auml;llning</para>
                  </entry>
                  <entry valign="top">
                    <para> Funktion</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>L&auml;ge</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Anv&auml;nd den nedrullningsbara listrutan f&ouml;r att ange egenskaperna f&ouml;r sk&auml;rmsl&auml;ckaren. V&auml;lj n&aring;got av f&ouml;ljande alternativ: </para>
                    <itemizedlist>
                      <listitem>
                        <para><guilabel>Inaktivera sk&auml;rmsl&auml;ckare</guilabel>: V&auml;lj detta alternativ om du inte vill anv&auml;nda sk&auml;rmsl&auml;ckaren.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Endast tom sk&auml;rm</guilabel>: V&auml;lj detta alternativ om du vill att sk&auml;rmen ska vara tom n&auml;r sk&auml;rmen l&aring;ses.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Endast en sk&auml;rmsl&auml;ckare</guilabel>: V&auml;lj detta alternativ om du vill visa en enda sk&auml;rmsl&auml;ckare fr&aring;n visningslistan n&auml;r sk&auml;rmen l&aring;ses.</para>
                      </listitem>
                      <listitem>
                        <para><guilabel>Slumpm&auml;ssig sk&auml;rmsl&auml;ckare</guilabel>: V&auml;lj detta alternativ om du vill visa slumpm&auml;ssigt valda sk&auml;rmsl&auml;ckare fr&aring;n listrutan n&auml;r sk&auml;rmen l&aring;ses. </para>
                      </listitem>
                    </itemizedlist>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>Visningslista</para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj den sk&auml;rmsl&auml;ckare som du &ouml;nskar fr&aring;n listan.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>T&ouml;m efter</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Ange hur l&aring;ng tid som ska g&aring; efter att musen eller tangentbordet anv&auml;nts senast f&ouml;r att sk&auml;rmsl&auml;ckaren ska aktiveras.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Byt efter</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Ange hur l&aring;ng tid en viss sk&auml;rmsl&auml;ckare ska visas innan den n&auml;sta visas.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>L&aring;s sk&auml;rm efter</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>V&auml;lj det h&auml;r alternativet om du vill att sk&auml;rmen ska l&aring;sas n&auml;r sk&auml;rmsl&auml;ckaren aktiverats. Anv&auml;nd rotationsrutan f&ouml;r att ange f&ouml;rdr&ouml;jningen mellan det att sk&auml;rmsl&auml;ckaren aktiveras och sk&auml;rmen l&aring;ses.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guibutton>F&ouml;rhandsgranska</guibutton>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Klicka p&aring; denna knapp f&ouml;r att f&ouml;rhandsgranska sk&auml;rmsl&auml;ckaren som har markerats i visningslistan. Tryck p&aring; valfri knapp eller en musknapp f&ouml;r att avbryta f&ouml;rhandgranskningen.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guibutton>Inst&auml;llningar</guibutton>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Klicka p&aring; denna knapp f&ouml;r att visa sk&auml;rmsl&auml;ckarens alternativ som har markerats i sk&auml;rmsl&auml;ckarens visningslista. </para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Klicka p&aring; fliken <guilabel>Avancerat </guilabel> f&ouml;r att konfigurera avancerade alternativ. I f&ouml;ljande tabell beskrivs dialogf&ouml;nsterelementen i <guilabel> Avancerat</guilabel>-fliksektionen: </para>
          <informaltable frame="topbot">
            <tgroup cols="2" colsep="0" rowsep="0">
              <colspec colname="colspec2" colwidth="40.38*"/>
              <colspec colname="colspec3" colwidth="59.62*"/>
              <thead>
                <row rowsep="1">
                  <entry valign="top">
                    <para>Inst&auml;llning</para>
                  </entry>
                  <entry valign="top">
                    <para> Funktion</para>
                  </entry>
                </row>
              </thead>
              <tbody>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>F&aring;nga skrivbordsbilder</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Med vissa sk&auml;rmsl&auml;ckare f&aring;ngas en sk&auml;rmbild av skrivbordet och sedan manipuleras sk&auml;rmbilden f&ouml;r att skapa din sk&auml;rmsl&auml;ckare. V&auml;lj detta alternativ om du vill kunna ta en sk&auml;rmbild av skrivbordet med sk&auml;rmsl&auml;ckaren.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>F&aring;nga bildrutor</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Med vissa sk&auml;rmsl&auml;ckare f&aring;ngas en bildruta och sedan manipuleras den f&aring;ngade bilden f&ouml;r att skapa din sk&auml;rmsl&auml;ckare. V&auml;lj detta alternativ, om ditt system har ett videoinspelningskort, om du vill kunna f&aring;nga en bildruta med sk&auml;rmsl&auml;ckare. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>V&auml;lj slumpm&auml;ssig bild</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj detta alternativ om du vill att sk&auml;rmsl&auml;ckaren ska kunna anv&auml;nda bilder fr&aring;n en katalog som du v&auml;ljer. Skriv in s&ouml;kv&auml;gen till katalogen i f&auml;ltet. Klicka alternativt p&aring; <guibutton>Bl&auml;ddra</guibutton> f&ouml;r att visa ett dialogf&ouml;nster som du kan v&auml;lja en katalog fr&aring;n. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Utf&ouml;rlig diagnostik</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj detta alternativ om du vill visa diagnostisk information f&ouml;r sk&auml;rmsl&auml;ckaren.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Visa underprocessfel</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj detta alternativ om du vill visa fel som &auml;r relaterade till sk&auml;rmsl&auml;ckarens underprocesser.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Visa startbild vid uppstart </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj detta alternativ om du vill att <application>Xscreensaver</application> ska visa ett v&auml;lkomstdialogf&ouml;nster n&auml;r <application>Xscreensaver</application> startas. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Str&ouml;msparfunktioner aktiverade</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj detta alternativ f&ouml;r att aktivera enegisparfunktionerna f&ouml;r bildsk&auml;rmen. Med energisparfunktionerna kan str&ouml;mf&ouml;rbrukningen f&ouml;r bildsk&auml;rmen reduceras n&auml;r du inte anv&auml;nder bildsk&auml;rmen. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>G&aring; i standby-l&auml;ge efter</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Ange hur l&aring;ng tid som ska l&ouml;pa innan bildsk&auml;rmen g&aring;r ned i vilol&auml;ge. N&auml;r bildsk&auml;rmen befinner sig i vilol&auml;ge &auml;r sk&auml;rmen tom.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>G&aring; i pausl&auml;ge efter</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Ange hur l&aring;ng tid som ska l&ouml;pa innan bildsk&auml;rmen g&aring;r ned i energisparl&auml;ge. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Av efter</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>Ange hur l&aring;ng tid som ska l&ouml;pa innan bildsk&auml;rmen st&auml;ngs av. </para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Installera f&auml;rgkarta</guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj det h&auml;r alternativet om du vill installera en egen f&auml;rgkarta n&auml;r sk&auml;rmsl&auml;ckaren aktiverats. Om du anv&auml;nder en egen f&auml;rgkarta kan f&auml;rgens kvalitet i vissa sk&auml;rmsl&auml;ckare f&ouml;rb&auml;ttras.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Tona m&ouml;rk n&auml;r sk&auml;rmen t&ouml;ms </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj detta alternativ om du vill att bildsk&auml;rmen ska tonas till svart n&auml;r sk&auml;rmsl&auml;ckaren aktiverats.</para>
                  </entry>
                </row>
                <row>
                  <entry colname="colspec2" valign="top">
                    <para>
                      <guilabel>Ljusna vid inaktivering </guilabel>
                    </para>
                  </entry>
                  <entry colname="colspec3" valign="top">
                    <para>V&auml;lj detta alternativ om du vill att bildsk&auml;rmen ska tonas fr&aring;n svart och sk&auml;rminneh&aring;llet &aring;terst&auml;llas n&auml;r sk&auml;rmsl&auml;ckaren inaktiverats.</para>
                  </entry>
                </row>
                <row>
                  <entry valign="top">
                    <para>
                      <guilabel>Toningsl&auml;ngd</guilabel>
                    </para>
                  </entry>
                  <entry valign="top">
                    <para>Ange hur l&aring;ng tid toningen ska ta n&auml;r sk&auml;rmsl&auml;ckaren aktiveras.</para>
                  </entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
        </listitem>
        <listitem>
          <para>Klicka p&aring; knappen <guibutton>St&auml;ng f&ouml;nster</guibutton> p&aring; f&ouml;nsterramen f&ouml;r att st&auml;nga dialogf&ouml;nstret <guilabel>XScreenSaver</guilabel>.</para>
        </listitem>
      </orderedlist>
    </sect2>
  </sect1>
  <sect1 id="gosstartsession-2">
    <title>Hantera sessionen</title>
    <indexterm>
      <primary>inst&auml;llningsverktyg</primary>
      <secondary>sessioner</secondary>
    </indexterm>
    <indexterm>
      <primary>sessioner</primary>
      <secondary>hantera</secondary>
    </indexterm>
    <para>Om du vill konfigurera sessionhanteringen f&ouml;r skrivbordet, v&auml;ljer du <menuchoice><guimenu>Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Avancerat</guisubmenu><guimenuitem>Sessioner</guimenuitem></menuchoice>. Inst&auml;llningsverktyget <application>Sessioner </application> identifierar f&ouml;ljande programtyper: </para>
    <itemizedlist>
      <listitem>
        <indexterm>
          <primary>uppstartsprogram</primary>
          <secondary>sessionshanterade</secondary>
        </indexterm>
        <para>Program som &auml;r sessionshanterade. N&auml;r du sparar inst&auml;llningarna f&ouml;r sessionen sparar sessionshanteraren alla sessionshanterade program. Om du loggar ut och sedan loggar in igen startar sessionshanteraren automatiskt de sessionshanterade programmen. </para>
      </listitem>
      <listitem>
        <para>Program som inte &auml;r sessionshanterade. N&auml;r du sparar inst&auml;llningarna f&ouml;r sessionen sparar inte sessionshanteraren program som inte &auml;r sessionshanterade. Om du loggar ut och sedan loggar in igen startar inte sessionshanteraren program som inte &auml;r sessionshanterade. Du m&aring;ste starta programmet manuellt. Du kan alternativt anv&auml;nda inst&auml;llningsverktyget <application>Sessioner </application> f&ouml;r att ange icke-sessionshanterade program som du vill ska startas automatiskt. </para>
      </listitem>
    </itemizedlist>
    <sect2 id="gosstartsession-9">
      <title>Definera sessionsegenskaper vid in- och utloggning</title>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>inloggningsegenskaper</secondary>
      </indexterm>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>utloggningsegenskaper </secondary>
      </indexterm>
      <para>Om du vill ange sessionegenskaper vi in- och utloggning, v&auml;ljer du <menuchoice><guimenu>Program</guimenu><guisubmenu> Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Avancerat</guisubmenu><guimenuitem>Sessioner</guimenuitem></menuchoice>. Utf&ouml;r &ouml;nskade &auml;ndringar i <guilabel>Sessionsalternativ</guilabel>-fliksektionen. Du kan t ex v&auml;lja att visa en v&auml;lkomstsk&auml;rm vid inloggning. </para>
    </sect2>
    <sect2 id="gosstartsession-6">
      <title>Anv&auml;nda uppstartsprogram</title>
      <indexterm>
        <primary>uppstartsprogram</primary>
        <see>uppstartsprogram</see>
      </indexterm>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>anv&auml;nda uppstartsprogram</secondary>
      </indexterm>
      <indexterm>
        <primary>uppstartsprogram </primary>
        <secondary>icke-sessionshanterade</secondary>
      </indexterm>
      <para>Du kan konfigurera sessionerna att starta med program som inte &auml;r sessionshanterade. Om du vill konfigurera icke-sessionshanterade uppstartsprogram, v&auml;ljer du <menuchoice><guimenu>Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Avancerat</guisubmenu><guimenuitem>Sessioner </guimenuitem></menuchoice>. Anv&auml;nd <guilabel>Startprogram</guilabel>-fliksektionen f&ouml;r att l&auml;gga till, redigera och ta bort program. Om du sparar inst&auml;llningarna och loggar ut startas uppstartsprogrammen automatiskt n&auml;sta g&aring;ng du loggar in. </para>
    </sect2>
    <sect2 id="gosstartsession-10">
      <title>Bl&auml;ddra mellan program i den aktuella sessionen</title>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>bl&auml;ddra mellan program</secondary>
      </indexterm>
      <para>Om du vill bl&auml;ddra mellan program i den aktuella sessionen, v&auml;ljer du <menuchoice><guimenu>Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Avancerat</guisubmenu><guimenuitem>Sessioner </guimenuitem></menuchoice>. I <guilabel>Aktuell session</guilabel>-fliksektionen visas f&ouml;ljande:</para>
      <itemizedlist>
        <listitem>
          <para>Alla GNOME-program som f&ouml;r n&auml;rvarande k&ouml;rs som kan anslutas till sessionshanteraren och som kan spara programmets status. </para>
        </listitem>
        <listitem>
          <para>Alla skrivbordsinst&auml;llningsverktyg som kan anslutas till sessionshanteraren och som kan spara verktygets status.</para>
        </listitem>
      </itemizedlist>
      <para>Du kan anv&auml;nda <guilabel>Aktuell session</guilabel>-fliksektionen f&ouml;r att utf&ouml;ra ett begr&auml;nsat antal &aring;tg&auml;rder i sessionsegenskaperna f&ouml;r ett program eller inst&auml;llningsverktyg. Du kan t ex redigera startordningen och starta om typ f&ouml;r alla GNOME-program eller skrivbordsinst&auml;llningsverktyg som finns i listan. </para>
    </sect2>
    <sect2 id="gosgetstarted-74">
      <title>Spara sessionsinst&auml;llningar</title>
      <indexterm>
        <primary>sessioner</primary>
        <secondary>spara inst&auml;llningar</secondary>
      </indexterm>
      <para>Utf&ouml;r f&ouml;ljande steg om du vill spara sessionsinst&auml;llningarna: </para>
      <orderedlist>
        <listitem>
          <para>Konfigurera sessioner s&aring; att inst&auml;llningarna sparas automatiskt n&auml;r du avslutar sessionen. Om du vill konfigurera din session, v&auml;ljer du <menuchoice><guimenu> Program</guimenu><guisubmenu>Skrivbordsinst&auml;llningar</guisubmenu><guisubmenu>Avancerat</guisubmenu><guimenuitem>Sessioner</guimenuitem></menuchoice>. Inst&auml;llningsverktyget <application>Sessioner</application> startar. V&auml;lj alternativet <guilabel>Spara &auml;ndringarna i sessionen automatiskt</guilabel> i <guilabel>Sessionsalternativ</guilabel>-fliksektionen.</para>
        </listitem>
        <listitem>
          <para>Avsluta sessionen. </para>
        </listitem>
      </orderedlist>
      <para>Om du inte v&auml;ljer alternativet <guilabel>Spara &auml;ndringarna i sessionen automatiskt </guilabel> visas ett dialogf&ouml;nster d&auml;r du kan v&auml;lja om du vill spara de aktuella inst&auml;llningarna n&auml;r du loggar ut. Om du vill spara inst&auml;llningarna v&auml;ljer du alternativet och forts&auml;tter att logga ut.</para>
    </sect2>
  </sect1>
  <sect1 id="gosgetstarted-73">
    <title>Avsluta en session</title>
    <indexterm>
      <primary>sessioner</primary>
      <secondary>avsluta</secondary>
    </indexterm>
    <indexterm>
      <primary>sessioner</primary>
      <secondary>logga ut</secondary>
    </indexterm>
    <indexterm>
      <primary>logga ut</primary>
    </indexterm>
    <screenshot>
      <mediaobject>
        <imageobject>
          <imagedata fileref="figures/logout_icon.png" format="PNG"/>
        </imageobject>
        <textobject>
          <phrase>Ikonen Logga ut.</phrase>
        </textobject>
      </mediaobject>
    </screenshot>
    <para>Om du vill avsluta din session st&auml;nger du alla f&ouml;r n&auml;rvarande aktiva processer och utf&ouml;r en av f&ouml;ljande &aring;tg&auml;rder:</para>
    <itemizedlist>
      <listitem>
        <para>Klicka p&aring; knappen <guibutton>Logga ut</guibutton>.</para>
      </listitem>
      <listitem>
        <para>V&auml;lj <menuchoice><guimenu>&Aring;tg&auml;rder</guimenu><guimenuitem> Logga ut</guimenuitem></menuchoice>.</para>
      </listitem>
      <listitem>
        <para>&Ouml;ppna <guimenu>GNOME-menyn</guimenu> och v&auml;lj sedan <guimenuitem> Logga ut</guimenuitem>.</para>
      </listitem>
    </itemizedlist>
    <para>Innan du avslutar en session kan du spara de aktuella inst&auml;llningarna s&aring; att du kan &aring;terst&auml;lla sessionen senare. Under utloggningen visas ett dialogf&ouml;nster d&auml;r du kan v&auml;lja att spara de aktuella inst&auml;llningarna. I inst&auml;llningsverktyget <application> Sessioner</application> kan du v&auml;lja ett alternativ som g&ouml;r att de aktuella inst&auml;llningarna sparas automatiskt.</para>
  </sect1>
</chapter>
