<?xml version="1.0" encoding="utf-8"?>
<part id="part1-1"><title>En guidad visning av GNOME-skrivbordet</title><partintro><para>I detta avsnitt presenteras de grundl&auml;ggande GNOME-komponenterna. I detta avsnitt f&aring;r du hj&auml;lp med hur du b&ouml;rjar arbeta med skrivbordet. Skrivbordet &auml;r mycket konfigurerbart. D&auml;rf&ouml;r t&auml;cker detta avsnitt de huvudsakliga skrivbordsfunktionerna. Mer information om hur du implementerar de olika konfigurationsm&ouml;jligheterna som n&auml;mns i detta avsnitt finns under <emphasis>Anpassa GNOME-skrivbordet</emphasis>. Kapitlen i detta avsnitt &auml;r som f&ouml;ljer: </para><itemizedlist><listitem><para><emphasis>Grundl&auml;ggande f&auml;rdigheter</emphasis></para><para>Information om musens anv&auml;ndning, snabbkommandon och grundl&auml;ggande f&ouml;nster- och dialogf&ouml;nsterkunskaper finns i detta kapitel. </para></listitem><listitem><para><emphasis>&Ouml;versikt &ouml;ver skrivbordet</emphasis></para><para>I detta kapitel presenteras skrivbordets huvudkomponenter och funktioner. L&auml;s &aring;tminstone detta kapitel om du inte l&auml;ser n&aring;got annat i manualen.</para></listitem><listitem><para><emphasis>Skrivbordssessioner</emphasis></para><para>L&auml;s detta kapitel f&ouml;r information om hur du startar, hanterar och avslutar skrivbordssessioner. </para></listitem><listitem><para><emphasis>Arbeta med paneler</emphasis></para><para>L&auml;s detta kapitel f&ouml;r att f&aring; mer information om hur du anv&auml;nder paneler. Paneler &auml;r en av skrivbordets huvudkomponenter. I detta kapitel f&aring;r du information om hur du anv&auml;nder panelernas olika delar och anropar skrivbordets tillg&auml;ngliga funktioner med hj&auml;lp av paneler.</para></listitem><listitem><para><emphasis>Arbeta med menyer</emphasis></para><para>L&auml;s detta kapitel f&ouml;r att f&aring; mer information om hur du anv&auml;nder menyer. </para></listitem><listitem><para><emphasis>Arbeta med f&ouml;nster</emphasis></para><para>L&auml;s detta kapitel f&ouml;r att f&aring; mer information om hur du anv&auml;nder f&ouml;nster. I detta kapitel beskrivs grundl&auml;ggande f&ouml;nsterfunktioner som t ex flytta och storleks&auml;ndra. I detta kapitel beskrivs &auml;ven reglagen som du anv&auml;nder med f&ouml;nsterna. </para></listitem><listitem><para><emphasis>Nautilus-filhanteraren</emphasis></para><para>L&auml;s detta kapitel f&ouml;r f&aring; mer information om filhanteraren <application>Nautilus</application>. I detta kapitel beskrivs hur du anv&auml;nder <application>Nautilus</application> ihop med filsystemet. I detta kapitel beskrivs &auml;ven hur du anpassar <application> Nautilus</application>.</para></listitem><listitem><para><emphasis>Anv&auml;nda skrivbordsbakgrunden</emphasis></para><para>L&auml;s detta kapitel f&ouml;r att f&aring; mer information om hur du anv&auml;nder skrivbordsbakgrunden. I detta kapitel beskrivs hur du anv&auml;nder skrivbordsbakgrunden f&ouml;r att starta program och &ouml;ppna filer och mappar. I detta kapitel beskrivs &auml;ven hur du anv&auml;nder <guilabel> Papperkorgen</guilabel> p&aring; skrivbordet, hur du anv&auml;nder <guimenu>Skrivbordsbakgrund</guimenu>-menyn och hur du anpassar skrivbordsbakgrunden.</para></listitem></itemizedlist></partintro>&gosbasic;
&gosoverview;
&gosstartsession;
&gospanel;
&goseditmainmenu;
&gosmetacity;
&gosnautilus;
&gosdeskback;</part>
