<?xml version="1.0" encoding="utf-8"?>
<part id="part2-1"><title>Anpassa GNOME-skrivbordet</title><partintro><para>Du kan anpassa m&aring;nga av egenskaperna f&ouml;r skrivbordet. Anpassningen av varje aspekt av skrivbordet styrs av ett dedikerat programvaruverktyg som kallas skrivbordsinst&auml;llningsverktyg. Av praktiska sk&auml;l &auml;r inst&auml;llningsverktygen grupperade under f&ouml;ljande rubriker:</para><itemizedlist><listitem><para>Standard</para></listitem><listitem><para><guilabel>Hj&auml;lpmedel</guilabel></para></listitem><listitem><para><guilabel>Avancerat</guilabel></para></listitem></itemizedlist><para>Du kan &ouml;ppna inst&auml;llningsverktygen p&aring; n&aring;got av f&ouml;ljande s&auml;tt: </para><itemizedlist><listitem><para>V&auml;lj <menuchoice><guimenu>Program</guimenu><guimenuitem>Skrivbordsinst&auml;llningar</guimenuitem></menuchoice>. V&auml;lj &ouml;nskat verktyg fr&aring;n undermenyerna. </para></listitem><listitem><para>Dubbelklicka p&aring; objektet <guilabel>B&ouml;rja h&auml;r</guilabel> p&aring; skrivbordsbakgrunden. Ett <application>Nautilus</application>-f&ouml;nster &ouml;ppnas och visar inneh&aring;llet i <guilabel>B&ouml;rja h&auml;r</guilabel>. Dubbelklicka p&aring; objeket <guilabel> Inst&auml;llningar</guilabel> i f&ouml;nstret <application>Nautilus</application> f&ouml;r att visa inst&auml;llningsverktygen. Dubbelklicka p&aring; det verktyg du beh&ouml;ver. </para></listitem></itemizedlist><para>I detta avsnitt f&aring;r du information om hur du konfigurerar skrivbordet i f&ouml;ljande kapitel. </para><itemizedlist><listitem><para><emphasis>Anv&auml;nda grundl&auml;ggande inst&auml;llningsverktyg</emphasis></para><para>L&auml;s detta kapitel f&ouml;r att f&aring; information om hur du anpassar skrivbordsbakgrunden. I detta kapitel finns &auml;ven information om hur du konfigurerar tangentbords- och musinst&auml;llningarna. I detta kapitel finns &auml;ven information om hur du konfigurerar kortkommandon, anger ljudinst&auml;llningarna och konfigurerar n&auml;tverksproxy. I detta kapitel finns &auml;ven information om hur du v&auml;ljer ett tema och typsnitt f&ouml;r skrivbordet samt hur du anpassar menyrader och verktygsf&auml;lt f&ouml;r program. I detta kapitel finns &auml;ven information om hur du anpassar egenskaper f&ouml;r aktiva f&ouml;nster. </para></listitem><listitem><para><emphasis>Anv&auml;nda avancerade inst&auml;llningsverktyg</emphasis></para><para>I detta kapitel finns information om hur du konfigurerar filtyper, &ouml;nskade program och paneler. I detta kapitel finns &auml;ven information om hur du anpassar sessioner och uppstartsprogram. </para></listitem><listitem><para><emphasis>Anv&auml;nda hj&auml;lpmedelsverktygen</emphasis></para><para>L&auml;s detta kapitel f&ouml;r att f&aring; information om hur du anv&auml;nder skrivbordets hj&auml;lpmedelsfunktioner. I detta kapitel finns information om hur du anv&auml;nder hj&auml;lpmedelsfunktioner f&ouml;r tangentbord.</para></listitem></itemizedlist></partintro>&goscustdesk;
&goscustlookandfeel;
&goscustaccess;</part>
